{"id":2272,"date":"2022-05-20T12:20:09","date_gmt":"2022-05-20T16:20:09","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?p=2272"},"modified":"2024-03-13T11:42:49","modified_gmt":"2024-03-13T15:42:49","slug":"saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022","status":"publish","type":"post","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/","title":{"rendered":"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 "},"content":{"rendered":"<p>The Saratoga Springs High School Hall of Distinction will honor six outstanding individuals for their extraordinary professional accomplishments at the 2022 Hall of Distinction Recognition Ceremony at 6:00 p.m. Tuesday, May 24, 2022, in the Meade Auditorium at Saratoga Springs High School.<\/p>\n<p>The Seventh Annual Hall of Distinction inductees are Wallace Allerdice, Meg Kelly, and Bill Grande. The Eighth Annual Hall of Distinction inductees are Jennifer Jolly and Matt Jones.  The Hall of Distinction was established to recognize and celebrate the accomplishments of outstanding graduates of Saratoga Springs High School who have made exceptional contributions and excelled in their chosen fields. The distinguished alumni named to the Hall of Distinction represent an extraordinary range of personal and professional achievements.  Their accomplishments serve as an inspiration for our current students in their motivation to attain their aspirations.<\/p>\n<p>At the ceremony, the district will celebrate the recipients from 2020 and 2022. Due to the pandemic, the district was not able to hold the Seventh Annual Hall of Distinction ceremony in 2020.   <\/p>\n<h2>Wallace W. Allerdice, Jr.<\/h2>\n<p>Wallace W. Allerdice Jr. graduated from Saratoga Springs High School in 1960. A lifelong resident whose family roots go back to Saratoga since 1860, he has never liked straying far from home. He attended Siena College for two years majoring in both engineering and then business administration, failing both times. The following fall of 1962 he attended Hudson Valley Community College graduating with an ASS degree in business administration. He then got a job for NYSDOT in Albany as a clerk. He was soon promoted to a computer programmer, a new and upcoming field. Meanwhile, he started going to night courses at Russell Sage College in business administration receiving a BS degree in business and economics. In 1969 he married the love of his life, Sue. He enjoyed his job at the state for 16 years but always dreamed of making a living in the city he loved. <\/p>\n<p>In 1975 he went to BOCES in Saratoga, took a welding course and began the first of many businesses, a welding shop out of his garage. Having success, he quit the State in 1980. In 1981 he purchased his first apartment house and proceeded to renovate it back to life. Wally always had a fascination for tools, construction, and mechanics. This lifelong obsession with learning served him well. <\/p>\n<p>In November of 1982, he was approached by the Grande Family urging him to buy their failing lumberyard on Division and Walworth. After saying no several times, they gave him a deal he couldn’t refuse. He was extremely lucky to quickly assemble an amazing team and the business took off. <\/p>\n<p>As the years went on, through many great friendships and the help of the Adirondack Trust Company, Wally was able to diversify the business and add a Commercial Door Shop and Glass and Mirror. In 2005 he added a homeowner-oriented hardware store in Milton and as the surrounding area grew in 2009 he expanded again to Malta. <\/p>\n<p>Coming from a family who served the Saratoga Community, it was important for Wally to give back and preserve the history of this area. He was elected to serve on the Saratoga Springs Preservation Foundation, Saratoga Historical Society, a Trustee of both the Walworth and Bolster Collections, and Brookside the Saratoga County History Museum. Looking towards the future and being a part of development in the city, he served 20 years on the Saratoga Springs City Planning Board. In 1996, he was elected to the board of the Adirondack Trust Company.  He served 21 years there. Recently he just ended his time on the board of Universal Preservation Hall and is still on the board of Saratoga Automobile Museum. <\/p>\n<p>Wally is very proud to accept the Hall of Distinction Award especially since his wife of 52 years, Sue received the same award in 2018. Both of his sons Wallace W. Allerdice III, and William J. Allerdice graduated from SSHS. Wally is living his dream of making a living in Saratoga Springs and doing what he loves.<\/p>\n<h2>Bill Grande<\/h2>\n<p>Bill was born and raised in Saratoga Springs and was a lifetime resident, his only time living away from his beloved community was from 1955-57 while proudly serving his country in the Corps of Engineers in Sondrestrom, Greenland, overseeing the construction of the airstrip support buildings there.<\/p>\n<p>Bill was an honors graduate of Saratoga Springs High School in 1951 and the School of Architecture at RPI in 1955 where he was president of Phi Kappa Tau fraternity. He attended the Corps of Engineers Officer Training School in 1954-55. Upon his return from Greenland, Bill became a professional engineer and dedicated much of his life to the improvement of the city he so loved. Along with his father and brother, Bill worked tirelessly to provide affordable housing in and around Saratoga, helping to build several hundred homes for working families, along with hundreds of additions to houses and businesses. Bill was involved in the design and construction of many commercial buildings in the community including projects for the Adirondack Trust Co., Stewarts, Fasig-Tipton, the Saratoga Raceway and numerous professional offices. He was also very involved in the land use planning and infrastructure development that brought these projects to fruition. His progressive approach to development was coupled with his lifelong interest in history and commitment to historic preservation as he oversaw the renovation construction of numerous historic homes and buildings throughout Saratoga County.<\/p>\n<p>Bill was keenly interested in improving the community and he devoted himself to many civic activities. He served on numerous boards including the Saratoga YMCA where he served as president, the Saratoga Springs Planning Board and was a charter member of the Architectural Review and Historic Review Boards as well as a director of the community bank, the Adirondack Trust Co. He worked with the Historic Preservation Foundation, the Saratoga Springs Historical Society, in particular the preservation of the Bolster Collection, and the National Bottle Museum. His fundraising efforts for community projects included the United Community Fund where he was campaign chairman, the Saratoga YMCA, the Saratoga Community Hotel, the Saratoga Hospital, the Saratoga Performing Arts Center, the Saratoga Emergency Corps, the Saratoga Historical Society, the Saratoga Preservation Foundation, Skidmore College and others.<\/p>\n<h2>Meg Kelly<\/h2>\n<p>Meg Kelly is a 1977 graduate of Saratoga Springs High School. After graduation, Meg studied at SUNY Brockport and graduated with a BS. She briefly worked in the healthcare field, but she was unfulfilled and decided to change careers to golf.  Meg worked for prestigious country clubs all over the east coast, while successfully pursuing her Ladies Professional Golf Association Class A Teaching Professional Certification, which she received in 1986.   <\/p>\n<p>During her professional golf teaching career, she published ‘Easy Golf’, an instructional guide for Men &amp; Women. In 1988, she became the co-owner of the business Exit 17 Golf.   <\/p>\n<p>In 2008, Meg founded Saratoga Children’s Theatre as a local not-for-profit.  She worked diligently to build this program from the ground up, serving hundreds of children from our community and many surrounding communities.   <\/p>\n<p>In 2016, Meg served as Deputy Mayor of Saratoga Springs, and was elected Mayor the next year, which began some of her most distinctive and meaningful service to our community.<\/p>\n<p> In August of 2018, City Hall experienced a rare lightning strike that caused flooding and destruction throughout this historic building.  Meg led the city’s emergency team to establish a plan and to relocate business functions at the Recreation Center.  In less than a week, hundreds of employees, thousands of files, miles of network cabling, and lots of make-shift office furniture were set up and providing services for the residents and businesses of Saratoga Springs.   <\/p>\n<p>The second “once-in-a-lifetime” event occurred in early 2020, when the global COVID-19 Pandemic was declared. Again, Meg’s expertise in collaborating with government officials, business leaders and residents was put to the test.<\/p>\n<h2>Jennifer Jolly<\/h2>\n<p>Jennifer Jolly is a graduate of Saratoga High School, class of 1989.  She was the concert master of the High School Orchestra and Chamber Orchestra throughout her time at SSHS, and graduated 3rd in her class.  She studied art history at Oberlin College and was inducted into the Phi Beta Kappa honor society.  She continued her studies in Art History at Northwestern University, where she completed her MA and PhD.  She pursued her dissertation research in Mexico with support of a Fulbright García Robles Fellowship and in Spain with a Samuel H. Kress Foundation fellowship.<\/p>\n<p>In 2003, Professor Jolly began her career at Ithaca College in Ithaca, New York, where she teaches courses in Latin American and Latinx Art History, ancient through contemporary.  She is a dedicated teacher and mentor to students, who appreciate how she supports and challenges them to think critically, develop their ideas in writing, and engage with the world.  In 2022 she was named a Charles A. Dana Professor of Art History.<\/p>\n<p>Professor Jolly is an internationally recognized scholar of Mexican Art.  She researches art and politics in early 20th-century Mexico and has published in leading art history journals.  Her book on art and tourism in 1930’s Mexico, Creating Pátzcuaro, Creating Mexico, was supported by a second Fulbright-García Robles fellowship and a National Endowment for the Humanities Fellowship.  Her book won two awards: the Arthur P. Whitaker Best Book Award from the Middle Atlantic Council of Latin American Studies and the Visual Culture Section Best Book Prize from the Latin American Studies Association. <\/p>\n<p>Professor Jolly is a leader in her campus community, where she has just been re-elected President of the Humanities and Sciences Faculty Senate for a third term.  She has been active in promoting and developing diversity and inclusion initiatives around campus and always welcomes the opportunity to mentor faculty.<\/p>\n<p>Professor Jolly is married to Chris Gonzales (SSHS class of 1990) and has twin boys: Mateo and Joseph. Mateo enjoys discussing art, history, and ideas with his mom, while Joey followed in her footsteps by playing French Horn in the local Youth Orchestra and dancing ballet.  Jennifer still finds time to dance and play violin—and even learned piano alongside her boys. Together, her family enjoys hiking in the Finger Lakes and Adirondacks, attending music and dance performances, and cooking and baking. <\/p>\n<p>Professor Jolly is grateful for her experiences at the Saratoga Springs High School, from the wonderful range of musical opportunities to the strong educational foundation it provided.  Growing up in Saratoga Springs cultivated her love of ballet and the out-of-doors, sparked her research into the history of tourism, and granted her cherished friendships and roots in upstate New York.<\/p>\n<h2>Matthew J. Jones<\/h2>\n<p>Matt is a 1972 graduate of Saratoga Springs High School and a recipient of the Yaddo Medal. He received a Bachelor of Arts degree from the University of Vermont in 1976, and a Juris Doctorate in 1978 from the University of Houston Law School.<\/p>\n<p>Matt is the founding partner of Jones Steves, LLP, Attorneys at Law, a Saratoga Springs law firm established in 1980 concentrating its practice in land use development.In his 42 years of practice, Matt served as lead counsel for the zoning and environmental reviews for GlobalFoundries in Malta, New York, a project described as one of the largest public\/private financed construction projects in the history of New York State. He has also served as lead counsel to The Saratoga Hospital for the past 25 years.<\/p>\n<p>Matt served as a Vice President of the New York State Bar Association and member of its Executive Committee as well as a former President of the Saratoga County Bar Association.In addition, Matt has served as: President of the Saratoga Springs Board of Education; Chairman of the Board of Directors of Saratoga County Chamber of Commerce; President of the Saratoga County YMCA Board of Directors; President of the Saratoga Springs Lions Club Foundation Board of Trustees; Vice Chairman and founding Director of the Saratoga Springs City Center Authority; Chairman of the West Avenue Redevelopment Advisory Committee; Chairman of the Saratoga Springs Committee on Recreation; Member of the Saratoga Springs Charter Review Commission; Member of the Board of Directors of the Leadership Saratoga Advisory Board; Member of the Board of Directors of the Saratoga Springs Preservation Foundation; Vice Chairman of the Blue Streaks Hall of Fame Committee; and Co-Founder of the Saratoga County Bar Association Mock Trial Program.<\/p>\n<p>Matt is a native Saratogian residing on Victoria Lane.His son, Lt. Ryan M. Jones served as a platoon commander with the 101st Airborne Division.He is now with the Army Reserves.His daughter, Logan K. Jones, resides in Saratoga Springs and is a student at SUNY Adirondack pursuing a degree in business.<\/p>\n<p>Matt is the recipient of the Leadership Saratoga Distinguished Alumnus Award for Outstanding Service and Achievement to the Community by a Graduate of the Leadership Saratoga program – 2001, the YMCA Outstanding Volunteer Service Award for Untiring Devotion to the YMCA – 1998, and the Community Leadership Association – Distinguished Leadership Award for Exemplary Service and Commitment to the Community.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Saratoga Springs High School Hall of Distinction will honor six outstanding individuals for their extraordinary professional accomplishments at the 2022 Hall of Distinction Recognition Ceremony at 6:00 p.m. Tuesday, May 24, 2022, in the Meade Auditorium at Saratoga Springs High School. The Seventh Annual Hall of Distinction inductees are Wallace Allerdice, Meg Kelly, and &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 &#8220;<\/span><\/a><\/p>\n","protected":false},"author":11,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":""},"categories":[2],"tags":[],"class_list":["post-2272","post","type-post","status-publish","format-standard","hentry","category-district"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The Saratoga Springs High School Hall of Distinction will honor six outstanding individuals for their extraordinary professional accomplishments at the 2022 Hall of Distinction Recognition Ceremony at 6:00 p.m. Tuesday, May 24, 2022, in the Meade Auditorium at Saratoga Springs High School. The Seventh Annual Hall of Distinction inductees are Wallace Allerdice, Meg Kelly, and &hellip; Continue reading &quot;Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 &quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:published_time\" content=\"2022-05-20T16:20:09+00:00\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-03-13T15:42:49+00:00\" \/>\r\n<meta name=\"author\" content=\"Alyssa.Teribury\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Alyssa.Teribury\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\",\"name\":\"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-05-20T16:20:09+00:00\",\"dateModified\":\"2024-03-13T15:42:49+00:00\",\"author\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#\/schema\/person\/829dc7d4ac4551160e23cf4aff5e2db2\"},\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 \"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.saratogaschools.org\/#\/schema\/person\/829dc7d4ac4551160e23cf4aff5e2db2\",\"name\":\"Alyssa.Teribury\",\"url\":\"https:\/\/www.saratogaschools.org\/author\/alyssa-teribury\/\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/","og_locale":"en_US","og_type":"article","og_title":"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District","og_description":"The Saratoga Springs High School Hall of Distinction will honor six outstanding individuals for their extraordinary professional accomplishments at the 2022 Hall of Distinction Recognition Ceremony at 6:00 p.m. Tuesday, May 24, 2022, in the Meade Auditorium at Saratoga Springs High School. The Seventh Annual Hall of Distinction inductees are Wallace Allerdice, Meg Kelly, and &hellip; Continue reading \"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 \"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/","og_site_name":"Saratoga City School District","article_published_time":"2022-05-20T16:20:09+00:00","article_modified_time":"2024-03-13T15:42:49+00:00","author":"Alyssa.Teribury","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Alyssa.Teribury","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/","name":"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022  - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-05-20T16:20:09+00:00","dateModified":"2024-03-13T15:42:49+00:00","author":{"@id":"https:\/\/www.saratogaschools.org\/#\/schema\/person\/829dc7d4ac4551160e23cf4aff5e2db2"},"breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school-to-honor-hall-of-distinction-recipients-on-may-24-2022\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School To Honor Hall Of Distinction Recipients On May 24, 2022 "}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/www.saratogaschools.org\/#\/schema\/person\/829dc7d4ac4551160e23cf4aff5e2db2","name":"Alyssa.Teribury","url":"https:\/\/www.saratogaschools.org\/author\/alyssa-teribury\/"}]}},"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"publishpress_future_action":{"enabled":false,"date":"2025-09-26 19:46:27","action":"change-status","newStatus":"draft","terms":[],"taxonomy":"category","extraData":[]},"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/posts\/2272","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=2272"}],"version-history":[{"count":2,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/posts\/2272\/revisions"}],"predecessor-version":[{"id":7972,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/posts\/2272\/revisions\/7972"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=2272"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/categories?post=2272"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/tags?post=2272"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}