{"id":1123,"date":"2022-02-28T13:50:23","date_gmt":"2022-02-28T18:50:23","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=1123"},"modified":"2025-08-21T14:12:28","modified_gmt":"2025-08-21T18:12:28","slug":"student-handbook","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/","title":{"rendered":"Maple Avenue Student Handbook"},"content":{"rendered":"<h2>Vision<\/h2>\n<p>The vision of Maple Avenue Middle School is that students are confident, dynamic citizens capable of collaboration in our ever-changing world.  Our students approach new experiences with kindness, curiosity, and open minds.  They effectively express their unique ideas, demonstrate their skills and engage others with empathy and respect, forging their paths to joy and fulfillment in their lives.<\/p>\n<h2>Mission<\/h2>\n<p>The Maple Avenue Middle School Community provides a welcoming and safe environment where students feel they belong. Students, staff, and families work together to create equitable learning opportunities accessible to all. We support students on their unique pathways to success.<\/p>\n<h2>Maple Avenue Middle School Administration<\/h2>\n<p>Contact: (518) 587-4551<\/p>\n<p>Building Principal, Scott Singer<\/p>\n<ul>\n<li>Grade 6 Assistant Principal, Corie Hart-Nelson<\/li>\n<li>Grade 7 Assistant Principal, Kara Likar<\/li>\n<li>Grade 8  Assistant Principal, <span>Christine Vilardo<\/span><\/li>\n<\/ul>\n<p>Special Education District Coordinator, Rob Kelly<br \/>\nExt. <span>12020<\/span><\/p>\n<p><strong>School Counselors<\/strong><\/p>\n<p>Columbian &amp; Hathorn Springs (Gr. 6), Christopher Wetzel <br \/>\nExt. 12259<\/p>\n<p>Excelsior &amp; Red Springs (Gr. 6), Rebecca Schnorr<br \/>\nExt. 12259<\/p>\n<p><span>Hathorn Springs (Gr. 7\/8), Jodie Plante<\/span><br \/>\nExt.12259<\/p>\n<p><span>Excelsior Springs (Gr. 7\/8), Joshua Muldner<\/span><br \/>\nExt. 12259<\/p>\n<p><span>Red Springs (Gr. 7\/8), Andrea Takacs<\/span><br \/>\nExt. 12259<\/p>\n<p><span>Columbian Springs (Gr. 7\/8), Melissa Conyers<\/span><br \/>\nExt. 12259<\/p>\n<p>School Psychologist, Don VanPatten <br \/>\nExt. 12020<\/p>\n<p>School Psychologist, Amy Fehringer <br \/>\nExt. 12020<\/p>\n<p>Social Worker, Brendon Russell <br \/>\nExt. 12020<\/p>\n<p>Social Worker, Jessi Boucher<br \/>\nExt. 12020<\/p>\n<p><strong>Other Contacts<\/strong><\/p>\n<p>Attendance Office <br \/>\nExt. 12001<\/p>\n<p>School Nurse <br \/>\nExt. 12040<\/p>\n<p>Student Records <br \/>\nExt. 12030<\/p>\n<h2>Board of Education Meetings<\/h2>\n<p><span>Board of Education meetings traditionally take place on the second and fourth Thursday of the month starting at 7:00 p.m., unless otherwise noted. Please check the school website for the meeting locations, agendas, minutes, and recordings.<\/span><\/p>\n<h2>SchoolTool\/Digital Tools<\/h2>\n<h3>SchoolTool<\/h3>\n<p>SchoolTool is a secure, online student management system that provides current grades, progress report data, and digital copies of report cards as well as schedule, attendance and discipline information.  There are direct email contact links to teachers and school counselors.  A Parent Portal account provides access for ALL children regardless of grade level for as long as they are in the District. To request a Parent Portal account, please go to <a href=\"http:\/\/www.saratogaschools.org\">www.saratogaschools.org<\/a><u>. <\/u>  Each parent can have an account (or you can share one account). To have individual accounts each parent must have a unique email address on file. Please note, Yahoo and AOL email addresses will not work through SchoolTool. We encourage you to use a different email provider with your SchoolTool Parent Portal account. Students have their own accounts, which are activated at school. <\/p>\n<p>SchoolTool can be accessed through the District website, at: <a href=\"http:\/\/www.saratogaschools.org\/\"><span>www.saratogaschools.org<\/span><\/a><\/p>\n<p>\nSchoolTool can be accessed through the District website, under the Home Communication tab.<\/p>\n<p>SchoolTool – DATA FOCUS<br \/>\nStudent Grade Information<br \/>\nAddress Information (family)<br \/>\nContact Information<br \/>\nStudent Schedule<br \/>\nStudent Attendance<br \/>\nStudent Discipline Information<\/p>\n<h3>Digital Tools<\/h3>\n<p>The Saratoga Springs City School District will continue to use digital connectivity and technology to support individualized instruction and student-centered learning.<\/p>\n<p>For students, these could include resources such as Seesaw (K-5 Assignment and Portfolio tool), and Canvas (6-8), Microsoft Office 365, cloud-based learning tools, blended learning, digital collaboration, and project-based learning.  All resources support real world connections, and student choice in demonstrating understanding. Teachers may choose to use many district-supported digital tools such as Canva, Nearpod, WeVideo, Library databases, as well as many other products.<\/p>\n<h3>COMPUTER USE<\/h3>\n<p>The Saratoga Springs City School District will continue to use digital connectivity and technology to support individualized instruction and student-centered learning.  For students this could include, but is not limited to, blended learning, collaboration, project-based learning, real world connections, and student choice in demonstrating understanding.  Account information for a specific digital tool, if needed, will be provided  by the teacher.  Students are required to utilize a school issued device to support and enhance their learning.                                                                                                                                                 <\/p>\n<p>The use of the school computers and Internet access is supported, provided that abuses do not occur.  Access is a privilege that will be denied if used inappropriately.  Student  passwords are not to be shared.                                                      <\/p>\n<p>Students will not engage in activities that might disrupt the educational process or damage school property.  These behaviors include but are not limited to: <\/p>\n<ul>\n<li>downloading of music <\/li>\n<li>pictures or videos <\/li>\n<li>playing of games or music  <\/li>\n<li>sharing of logons and passwords <\/li>\n<li>inappropriate language or gestures when online <\/li>\n<li>use of ChatGPT or other AI tools to complete school assignments unless explicitly approved by a teacher<\/li>\n<li><\/li>\n<\/ul>\n<p>Only school-related information should be downloaded. Disciplinary and\/or legal action may be taken if school computers are not used appropriately. <\/p>\n<p> <strong><u>Student Technology Expectations<\/u><\/strong> <\/p>\n<p>All SSCSD students receive access to technology resources as enrolled students. Some of these resources may vary based on the grade level and course participation; however, ALL students have access to base software, and ALL students have the responsibility to act as proper digital citizens while using District Technology.<\/p>\n<p>As a digital citizen of Saratoga Springs City School District, I understand that my actions fall under the purview of the student Code of Conduct and all Board of Education policies, including those related to bullying, harassment and Title IX as they apply to interactions with Technology, regardless of the student’s physical location.<\/p>\n<p><strong>Accounts <\/strong> <\/p>\n<p>Students are provided with a Saratoga Springs City School District account. These account usernames and student passwords are provided to your students’ teachers and are available at the IT Helpdesk. This account is used to access all District resources and applications, including Office 365 for Education (including email), their Cloudbook, and Clever.<\/p>\n<p>Students are responsible for their individual accounts and should take all reasonable precautions to prevent others from being able to use them.  <\/p>\n<p>Students must immediately notify a teacher or an IT Help Desk personnel if they have identified a possible security problem.    <\/p>\n<p>Students will not attempt to gain unauthorized access to any SSCSD network or computing device. This includes attempting to log in through another person&#8217;s account. <\/p>\n<p><strong>Student Email <\/strong> <\/p>\n<p>Students will have filtered access to email to facilitate learning goals and initiatives. Access to email will promote student accountability and ownership in their education by enabling students to receive and respond to notifications, reminders, and school related communications.<\/p>\n<p>Students should utilize email for educational activities, including research, collaboration, and direct contact with teachers. Email is an official form of communication and students should always be respectful and appropriate in all interactions with teachers, staff, and peers.<\/p>\n<p><strong>Proper Device Care <\/strong> <\/p>\n<ul>\n<li>Transport and store your Cloudbook responsibly:  \n<ul>\n<li>Protect the Cloudbook from inclement weather and extreme temperatures.  <\/li>\n<li>Cloudbooks should be carried within the SSCSD-provided or another approved protective case taking caution not to allow the screen to be damaged by external items.  <\/li>\n<\/ul>\n<\/li>\n<li>Cloudbooks must never be left in an unattended or unsupervised area  <\/li>\n<li>Please refrain from consuming food or drinks near the Cloudbook.  <\/li>\n<li>Take care of the screen by not carrying the device by the screen and closing it carefully. Failure to handle it by the base or slamming it will result in damage.  <\/li>\n<li>Students are responsible for keeping their Cloudbook’s battery charged for school each day. Cloudbooks should be plugged in each night prior to bedtime to allow for a full charge in the morning  <\/li>\n<li>Cloudbooks are intended for use at school each day. In addition to teacher expectations for Cloudbook use, school messages, announcements, calendars and schedules may be accessed 24\/7 using the Cloudbook. Students are responsible for bringing their Cloudbook to all classes, unless otherwise instructed by their teacher.<\/li>\n<\/ul>\n<p>If a student’s Cloudbook is being repaired, a loaner device may be issued to the student for the time period of the repair. <\/p>\n<h2>School Lunch Program Prices<\/h2>\n<p>School meals are a great value and a huge convenience for busy families.  Parents may prepay for student meals by sending in a check or cash, to be added to their child’s account. Make the check out to the School Lunch Program. Online payment is also available through LINQ Connect (https:\/\/ linqconnect.com).  First breakfast and lunch orders are free.  If you order a second meal the price is $3.25 for lunch and $2.25 for breakfast.<\/p>\n<p>There will be an extra charge for any a la carte snacks or additional items.  Students should use their I.D. cards when purchasing food.  Please be sure to submit your application for free or reduced-price meals as this may qualify you for other benefits.<\/p>\n<h2>Locker Procedures<\/h2>\n<p>Each student will be loaned a school lock for their locker.  Only school issued locks are permitted on the lockers.  Students need to be conscious of how they secure their locks.  Students are also discouraged from sharing their combinations.  If a student feels that someone knows their combination and has been opening their locker, they can return their lock to their house office and be issued a new one.  Be advised that the administration is legally permitted to enter any school locker if they have sufficient reason.   <\/p>\n<h2>Attendance Procedures<\/h2>\n<ol>\n<li>\n<p>When your child is absent, call or e-mail the Attendance Office at maple_attendance@saratogaschools.org (as early as possible), to state the reason and date of absence. If an email is not provided with a legal excuse, the student’s attendance record will be marked as an unexcused absence.<\/p>\n<\/li>\n<li>\n<p>When a student is tardy (not in class by 7:50 am), they must report to the attendance office immediately upon arrival. A note should be brought in stating the reason for tardiness. Multiple tardies may be referred to a grade level administrator or attendance supervisor.<\/p>\n<p><strong>**Please include the student’s first and last name in the note; this is especially important if the parent\/guardian’s name is different.<\/strong><\/p>\n<\/li>\n<li>\n<p>Students with 5 or more absences will be referred to their grade level administrator or District attendance supervisor for intervention.<\/p>\n<\/li>\n<\/ol>\n<p> If you are having difficulty getting your child to attend school, please call 518-587-4551, and ask for the Attendance Superviso<\/p>\n<h2>Early Dismissal<\/h2>\n<p>If you need to have your child dismissed during the school day for appointments: <\/p>\n<ol>\n<li>1. Please email the Attendance Office at maple_attendance@saratogaschools.org stating who will be picking up your child, the reason and time of dismissal. (The person picking up your child MUST be on SchoolTool as an approved person.) Please note, our cut off time to pick up students is 2:00 pm. <\/li>\n<li>At the time requested, the individual picking up the student needs to come to the attendance office with a <strong>photo ID to sign the child out; at that time the student will be called down to the Main Office.<\/strong> Students <strong>cannot<\/strong> be released without a parent or guardian signature. <\/li>\n<\/ol>\n<p>If you pick up your child at regular dismissal time, a note is not required.  Make arrangements directly with your child to meet at the student pick up area. <\/p>\n<h2>Visitors to Maple Avenue<\/h2>\n<p>In an effort to maintain safety and security for our building, all visitors are required to present a photo ID. Information such as name, date of birth, and photo will be digitally scanned into the system and the visitor will be issued a temporary photo ID for the duration of their visit. Once a visitor’s information is in our system, we will be able to print a new photo ID for subsequent visits. You will need to present your photo ID each time. The information provided at the visitor station is secure, confidential, and will not be shared with any 3rd party group. Thank you in advance for your patience as we work toward improving both student safety and punctuality.<\/p>\n<h2>Emergency Evacuation Procedures<\/h2>\n<p><span>In the event that students must evacuate the building, they are to proceed out of the building via the emergency exit routes posted in each classroom. Students are to stay with their class and classroom teacher. They are to proceed out of the building at a safe, rapid pace, with no talking, and in an orderly fashion (no pushing, horseplay, etc.). <strong>Students, who are in the hallways not under the direct supervision of a teacher, are to exit via the nearest exit, locate an adult, and identify themselves.<\/strong><\/span><\/p>\n<h2>Emergency School Closings<\/h2>\n<p>In the event of an emergency during school hours or an early dismissal, the District will use Parent Square to send an email, SMS text message and\/or phone notification to the Parent(s)\/Guardian(s) listed in SchoolTool. The building will follow your “Annual Parent Authorization Form” that parents submit online at the beginning of the school year for the emergency closing plan of action for your children.<\/p>\n<p>Weather cancellations and delays are posted on the school district’s website, right on the homepage at <u>www.saratogaschools.org<\/u>. The District will also send a ParentSquare email and SMS text message to families. The decision to close or delay the starting time of school will be made as early as possible.<\/p>\n<p>School closings are also announced through the media via the School Closing Network (which includes many local TV and radio stations as well as newspaper websites).  Parents are urged to check the website or news stations for the announcements rather than call the school district.  <\/p>\n<h2>Student I.D.<\/h2>\n<p>Students receive an ID card that has their name, photo, and student number barcode. IDs are used to board school buses, purchase lunches, check out books in the library, and attend student events such as dances. They are also a valuable security tool in quickly accounting for students on field trips or emergency evacuations. Students are required to carry their ID with them while on school grounds or attending school events. Please encourage your child to demonstrate responsibility by safeguarding their ID.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>DO NOT THROW AWAY YOUR OLD ID!!<\/strong><\/span><\/p>\n<p><span>Last year’s identification card will still be used for the first few months of school until new photo IDs are issued. This will usually occur about 2-3 weeks after yearbook photos are taken.<\/span><\/p>\n<h2>BIKING TO SCHOOL<\/h2>\n<p>It has been determined that currently there is a safe access point for your child to ride a bicycle to and from Maple Avenue Middle School.<\/p>\n<p>Below, please find some basic requirements (additional building-specific requirements may apply-contact the building principal for details) that must be adhered to for your child to receive permission from the building principal to ride a bicycle to and from our school.<\/p>\n<p>They are as follows:<\/p>\n<ul>\n<li>Both you and your child must review and sign the Bicycle Safety Agreement.<\/li>\n<li>You must complete a form so that your child’s bicycle is registered in the Main Office.<\/li>\n<\/ul>\n<p>Please be advised that should your child fail to adhere to the requirements contained in the Bicycle Safety Agreement, your child may lose the privilege of riding their bicycle to and from school.<\/p>\n<p>Please refer to the Board of Education Policy 5453-Biking to School and the Administration Regulation 5453-R for more information and the Bicycle Safety Agreement. All district policies are in the Policy Manual on the school website (saratogaschools.org).<\/p>\n<p><strong><em>We strongly recommend that you accompany your child whenever your child rides their bicycle to and from our school.<\/em><\/strong><\/p>\n<h2>Security Information<\/h2>\n<p><span>Events that may endanger the welfare of our students and staff are extraordinary and require a commitment to planning as well as coordinated action by our Building Emergency Response Team (BERT) to evaluate, lower the threat level and to work closely with local emergency providers once they enter school property. We have no control over when these events may occur. With this in mind, it is imperative that we implement a response system that includes the following<\/span><\/p>\n<ul>\n<li>Ensures the safety of students, staff and visitors.<\/li>\n<li>Protects district facilities, property and interests.<\/li>\n<li>Stabilizes the incident in a short period of time.<\/li>\n<li>Provides support to and works collaboratively with emergency providers.<\/li>\n<li>Communicates effectively with parents and media.<\/li>\n<\/ul>\n<p>In order to ensure that our students and staff remain safe during the school day, please adhere to the following:<\/p>\n<ul>\n<li>During each visit to our school, please be sure to report to the main office, present a photo ID, sign in and receive a visitor’s badge.<\/li>\n<li>Report directly to the location you designated on the sign-in sheet and return to the main office after leaving your designated location to sign out of the building.<\/li>\n<li>If your intended designation in the building is changed, or altered, you must report this change immediately to the main office.<\/li>\n<li>Report any suspicious and\/or unusual activity observed on school property to the building principal or building staff.<\/li>\n<\/ul>\n<h2>Gun Free Schools<\/h2>\n<p>It is important for all members of the public to understand that it is illegal for any firearm or weapon to be brought onto school property by an individual other than a peace officer or law enforcement official in the discharge of legal duties. The Saratoga Springs City School District Board of Education may grant permission for individuals that have been designated by the District to carry a firearm while performing their duties while on campus. According to the Gun Free Schools Act, starter pistols, explosives, other weapons able to expel a projectile, even portions of a workable weapon, are all covered under this legislation. This information is extremely important, not only for students who could suffer severe penalties of up to one-year removal from school, as well as mandatory referral to law enforcement or juvenile delinquency officials for prosecution, but also for parents and community members who might also face legal prosecution for violating this Act.<\/p>\n<p>The full impact of this legislation makes it illegal for someone to drive onto school property with a firearm or similarly defined weapon in their possession or in their vehicle. In accordance with a weapon being on the school grounds, this gun free school zone law applies to within 1000 ft. of the school building. Additionally, this law applies to not only “the school district property”, but this law then also applies to all school events held on or off campus. This means a parent returning from a day of hunting should not have a rifle or shotgun in their vehicle if they come to school to pick up their child or attend an evening meeting. Beyond strict compliance with the law, there is also the concern for the potential of some unintended tragedy whenever firearms are brought into close contact with large numbers of people, including children. Please use particular caution in the fall when so many citizens may be involved in hunting or target shooting activities.<\/p>\n<h2>Automated External Defibrillators<\/h2>\n<p>The Saratoga Springs City School District maintains on site, in each instructional school facility and at the district office, at least one functional automated external defibrillator (AED) for use during emergencies.  Whenever public-school facilities are used for school-sponsored or school-approved curricular or extracurricular events or activities or a school-sponsored athletic contest is held at any location, school administrators shall ensure the presence of at least one staff person who is trained in the operation and use of an AED.  Where a school-sponsored competitive athletic event is held at a site other than a public-school facility, the public-school officials must ensure that AED equipment is provided on-site.<\/p>\n<h2>Health Services<\/h2>\n<p>The health office provides preventive services, education, emergency care, and management of acute and chronic health conditions.  The office is staffed by two registered nurses and a clerk.  Their services are available to all students.  Parents are encouraged to call the school nurse at (518) 587-4551 ext. 12040 or (518) 682-2676 to discuss any student health related concerns or updates.<\/p>\n<p>New York State Education Law requires the following:<\/p>\n<ul>\n<li>Each student must have a physical examination on file upon entrance to the school district and for all 7<span><sup>th<\/sup><\/span> Parents can mail a copy of their child&#8217;s physical to the school with attention to the health office. It may also be faxed directly to (518) 583-4723.<\/li>\n<li>Students entering 6<span><sup>th<\/sup><\/span> grade must have documented proof of the Tdap vaccination and students entering 7<sup>th<\/sup> grade are required to have documented proof of the first meningococcal vaccine. Proof of vaccinations must be received within 14 days from the first day of school or the student will be excluded until the vaccination is received. If the student is coming from out of state, they will have 30 days, instead of 14.<\/li>\n<li>PLEASE NOTE: Tdap can be given at age 10 but is not required until the child turns 11. They will have 14 days from their birthday to provide documented proof, or the student will be excluded from school. <\/li>\n<li>Please refer to the district website regarding NYS Department of Health immunization requirements for students in grades 6-8.<\/li>\n<\/ul>\n<ul><\/ul>\n<p>Physical Education is a state mandated program.  Therefore, if a student has an injury and will need to miss more than one day of gym, a doctor&#8217;s note must be turned into the health office. If a student requires crutches and\/or use of an elevator, the doctor must write this along with the gym excuse.<\/p>\n<p>All medications and health needs should be addressed with the nurses prior to the start of school.  There are procedures that must be followed for the dispensing of medication.<\/p>\n<p>The nurses are not allowed to give out any medications, including cough drops and Tylenol unless a doctor’s order is provided. Each medication requires parent authorization and doctor&#8217;s order stating medicine name, diagnosis, dosage, and frequency.  Please note that all medication must be hand delivered to the nurse by a parent or guardian.  It must be in a labeled medicine container from the pharmacy.  No medications should be given to students to carry without a doctor’s order stating the student can self-carry the medication and parent permission on file.  A new doctor’s order is required each school year in September for all medications.<\/p>\n<p>Parents\/guardians must provide the school nurses with updated medical information for students with special medical needs or health concerns (i.e., diabetes, asthma, severe allergies). This will enable the health office to confidentially inform staff members of students’ needs.<\/p>\n<p>Any student involved in an interscholastic sport beginning in 7th grade is required to have a yearly physical exam on file in the health office, an interscholastic permission form and an athletic health history form completed on FamilyID in order to be cleared for a sport for each season. FamilyID can be accessed from the district website.<\/p>\n<p>When students are not feeling well, they need to be seen in the health office by a nurse. Students are not to use their cell phones or the house phone to call a parent or guardian to pick them up. Phone calls will be made through the health office.<\/p>\n<p>Students with a temperature of 100.4 or greater, vomiting, or diarrhea, will need to be picked up from school by a parent or guardian. They need to remain home for 24 hours (or longer) until they are fever free without taking antipyretics (Tylenol, ibuprofen, etc.), have not vomited or had diarrhea in 24 hours.<\/p>\n<h2>Annual Contact Verification<\/h2>\n<p>To ensure the safety and well-being of all students, it is imperative that all contact information in SchoolTool remains accurate and up to date.<\/p>\n<p>The 2025–2026 Annual Contact Verification and Parent Authorizations Form will be distributed via ParentSquare in late August. This form allows parents and guardians to review and update emergency contact details (phone numbers, addresses, names, etc.) and complete required authorizations.<\/p>\n<ul>\n<li>The submission window will remain open until mid-September.<\/li>\n<li>During this time, updates can be made directly through ParentSquare.<\/li>\n<li>After the deadline, paper copies of the Parent Authorizations Form (including   FERPA, field trips, etc.) will be available in your school&#8217;s main office.<\/li>\n<\/ul>\n<p><em>If your contact information changes at any point during the school year, please complete the Change of Information Form available on our school website.<\/em><\/p>\n<p><strong>Important<\/strong>: If your contact information is not current, the school may be unable to reach you in the event of an emergency or school closure due to inclement weather.<\/p>\n<p>All student contact information is securely maintained in the health\/main office for emergency use. If a parent or guardian cannot be reached, another designated adult listed in SchoolTool will be contacted.<\/p>\n<p><strong>For non-emergency situations, students will only be released to individuals authorized in writing by the parent or guardian. In the case of illness or injury, if a parent\/guardian cannot be reached, those listed in SchoolTool, with pick up rights, will be authorized to pick up the student.<\/strong><\/p>\n<h2>Custody<\/h2>\n<p><span>If custody of a child is limited by court order, a signed copy of that order must be on file at the school. Without a signed court order, either parent may request to see a teacher, be contacted in the event of an emergency, view school records or sign a child out of school. If custody papers are outdated, it is imperative to provide the school with a copy of the most recent court order. Parents should make sure the court papers on file are the most recent and that the rulings listed are current.<\/span><\/p>\n<h2>AFFIRMED FIRST NAME\/BIRTH GENDER CHANGE<\/h2>\n<p>In an effort to protect privacy, maintain confidentiality and create a safe and supportive environment for Transgender and Gender Nonconforming Students, the District continues to hone its practices and protocols in order to comply with the guidance that has been provided by the Office of the Attorney General (OAG), the New York State Education Department (SED) and the New York State Board of Regents. If you have any questions or would like assistance regarding an affirmed first name\/birth gender change, please contact the school principal.                      <\/p>\n<h2>Moving<\/h2>\n<p>It is particularly important for the school to have accurate records on each child. If you are moving within the District or moving out of the District, please make sure to use the following procedures:<\/p>\n<h3>Moving within the District<\/h3>\n<p>Parents\/guardians of students moving within the District are required to submit a “Change of Information” Form, which can be found on the school website to inform the school of your new address. Please allow up to five business days for the change to go into effect. Two current proofs of residence must also be provided when changing the primary address.<\/p>\n<h3>Moving out of the District<\/h3>\n<p><span>If you are moving outside the Saratoga Springs City School District, please notify the school in person. You will need to fill out and sign a “Student Discharge Form“ which can be found at your school building’s attendance office. You will receive a transfer form to present to the new school when you register your child. The new school will request records after your child has enrolled.<\/span><\/p>\n<h2>School Records\/Child&#8217;s Surname<\/h2>\n<p>Please be aware that permanent school records, (report cards, cumulative olders, etc.), must reflect the last name recorded on your child’s birth certificate.  If your child’s name has been legally changed, please bring documented legal proof of the change to the office of the School Registrar as soon as possible. <\/p>\n<h2>Pupil Services<\/h2>\n<p><strong>PSYCHOLOGICAL SERVICES<\/strong>:The school psychologist’s primary function is to assist students having learning, behavioral or adjustment difficulties. They work with students, teachers, and parents to determine the cause of the difficulty, recommending ways to assist school adjustment and the learning process. They work cooperatively with county and community agencies and act as a liaison for support services to teams and provide consultation services for teachers and parents. They also provide support to students through counseling sessions<\/p>\n<p>\n<strong>SCHOOL COUNSELORS:<\/strong> School counselors provide support to 6th, 7th, and 8th grade students and teaching teams as well as attend team meetings. They oversee the students’ educational programs and progress. They also promote personal, social and career development through various counseling sessions. They assist with issues and concerns of the 5th to 6th and 8th to 9th grade transition. They provide support and communication between home, school, and community. The counselors are also responsible for the development of student schedules.<\/p>\n<h3>The Dignity for All Students Act (DASA)<\/h3>\n<p>The Dignity for All Students Act (DASA) was enacted effective July 1, 2012. The purpose of DASA is to afford all public-school students an environment free of discrimination and harassment. DASA prohibits harassment of students by employees and fellow students.<\/p>\n<p>Bullying is defined as an intentional act of aggression based on an imbalance of power that is meant to harm a victim either physically or psychologically. This usually occurs repeatedly over time but could be a single serious event. DASA incidents may happen in school, at school events, or off campus if it involves cyberbullying or an event that affects the victim’s ability to attend school and fully take part in our academic and extracurricular programs.<\/p>\n<p>Incidents of bullying or cyberbullying may be pursued through informal intervention and mediation or through the filing of a formal complaint.  All conversations are kept confidential to the extent permitted by law.<\/p>\n<p>Students and parents\/guardians are encouraged to report bullying incidents to a staff member.  This could be a teacher, administrator, school psychologist, or school counselor.<\/p>\n<p><span><strong> <\/strong>The DASA coordinator for the building is the principal.<\/span><\/p>\n<p><span style=\"font-size: 1rem;\">The District DASA Coordinator is Dr. Joseph Greco, Director of Personnel Development. She can be reached at <a href=\"mailto:j_greco@saratogaschools.org\">j_greco@saratogaschools.org<\/a> or by phone at 518-583-4713. <\/span>You may also file an anonymous written complaint through our online Dignity for all Students Act (DASA) Bullying Reporting Form found on the school website (www. Saratogaschools.org).  Please click on the “About Us” tab at the top of the webpage and then select “Policies and Procedures” listed on the right.<\/p>\n<h2>Standardized Tests Grades 6-8<\/h2>\n<p>All Maple Avenue Middle School students in grades 6-8 will take the New York State Assessments in both English Language Arts and Math. Grade 8 students will take the New York State Science Assessment. Seventh and eighth grade students who score below the state reference points might be eligible for Academic Intervention Services (AIS).<\/p>\n<h2>Grade Reporting<\/h2>\n<p><span style=\"font-size: 1rem;\">All Maple Avenue Middle School students in grades 6-8 will take the New York State Assessments in both English Language Arts and Math. Grade 8 students will take the New York State Science Assessment. Seventh and eighth grade students who score below the state reference points might be eligible for Academic Intervention Services (AIS)..<\/span><\/p>\n<p>Incomplete grades are issued after an agreement between the student and teacher that the remaining work for the quarter will be made up in 5 weeks’ time. Communication between teacher and parent is strongly encouraged.<\/p>\n<p>Courses culminating in a Regents examination have the exam score reported alongside the course grades. The exam score itself does not count towards the final average. World Language 8th grade courses end the year with a FLACS exam. The exam score does not count towards a final average and is reported as a final exam on report cards.<\/p>\n<p>You are urged to call or visit the teacher when your child receives an unsatisfactory grade or comment. Communication between home and school will lead to a better understanding and improve the student’s performance in class. You can also contact your child’s counselor for further assistance.<\/p>\n<p><strong>Averages and the Honor Roll<\/strong>: A student with an average of 85 or better is eligible for the honor roll). A student with an incomplete mark or a failing grade is ineligible for the honor roll.<\/p>\n<p>Physical Education grades are not included in honor roll calculations. Failing Physical Education or any subject disqualifies a student from the honor roll. In addition, an average of 90 or better qualifies a student for the high honor roll. There is no rounding of averages for honor roll purposes.<\/p>\n<h2>Promotion\/Retention Policy<\/h2>\n<p>The goal is to have students placed at the best possible learning level for successful educational experiences. Retention may be required, so that a successful learning experience is reasonably assured.<\/p>\n<p>1. Students passing all subjects are promoted automatically along with students that have met the minimal standards considered appropriate for success at the next level.<\/p>\n<p>2. Students who do not meet the minimal standards are placed on a list for their need for retention, which is reviewed by the students’ teachers and administration personnel. <span>Each case is considered on an individual basis. The<\/span> <span>student may be required to repeat the grade.<\/span> Students may be given the option of attending the summer skills academy and passing the required courses to earn promotion to the next grade.<\/p>\n<h2>Speech and Language Services<\/h2>\n<p>Speech and language services at the middle school level consists of groups of students receiving remediation according to their Academic Language and Social Language needs.  Therapy in the areas of receptive and expressive language, pragmatic (social skill) language, fluency, and hearing disorders are available to students whose skill deficits interfere with their academic functioning.  The Speech Language Pathologist may also provide consultation services to assist team members in devising and implementing strategies to improve student functioning in the classroom.<\/p>\n<p>Following referral by either teacher or parent, a student is evaluated for speech and\/or language deficits using a screening instrument. If the student does not pass the screening, written parental consent is obtained to do a complete speech language evaluation. Evaluation results are presented to the district CSE and recommendations for service are discussed with the committee as well as the student’s parents. If qualified, students may receive service under the identification of speech\/language impaired, or speech-language therapy as a related service on the student’s IEP.<\/p>\n<h2>Library Services<\/h2>\n<p>The Library is a fully automated facility with an online catalog, internet, and computer access, and 24\/7 access to databases, eBooks, and audiobooks.  The Library is a source for students and staff and contains over 17,000 materials including print and digital fiction, nonfiction, and reference books.<\/p>\n<p>The Library program is integrated into the school’s instructional program across the curriculum. There is one full-time Librarian available to students and staff for reader’s advisory, book talks, reference questions, and classroom instruction.  Attached to the Library is a TV studio. Students are encouraged to come to the library during their free time to find pleasure reading and\/or an inviting atmosphere to learn, engage, and accomplish work. Maple Avenue students are encouraged to be independent and responsible borrowers and are taught respect for the Library and its materials.<\/p>\n<h2>Clubs and Activities<\/h2>\n<p>Maple Avenue Middle School’s belief is that a well-rounded education includes extracurricular activities. Research indicates that extracurricular activities provide students with a way to be part of the school community and supports their academic success. As such, we encourage students to participate each year in at least one school sponsored club. The options our teachers offer cover a variety of interest areas. Clubs are designed to increase student awareness of their world, to develop skills essential to social and academic development, and to strengthen student connections to our school community. (Please note that late buses are provided two days per week. If a club occurs on a day when late buses are not available, students will need to be picked up by an adult usually at 3:05 pm).<\/p>\n<ul>\n<li><span>A Hand-Up Club<\/span><\/li>\n<li>Adventure Gaming Club<\/li>\n<li>Artists Who Care Club<\/li>\n<li>Best Buddies<\/li>\n<li>Canteen Club<\/li>\n<li>Chamber Orchestra<\/li>\n<li>Chess\/ Games Club<\/li>\n<li>Fiddle Club<\/li>\n<li>French Club <\/li>\n<li>International Club<\/li>\n<li>Intro to Bagpiping<\/li>\n<li>Jazz Club<\/li>\n<li>Knitting Club  <\/li>\n<li>Maple Bees  <\/li>\n<li>Mapletogian <\/li>\n<li>Musical<\/li>\n<li>No Place For Hate Club<\/li>\n<li>Orchestra Performance  <\/li>\n<li>PBIS Student Activities  <\/li>\n<li>Peer Mentoring <\/li>\n<li>Pop Culture Icon Club<\/li>\n<li>Pride Club<\/li>\n<li>RC Club<\/li>\n<li>Science Club<\/li>\n<li>Ski Club<\/li>\n<li>Student Council<\/li>\n<li>TV Studio Club<\/li>\n<li>Voice Club, Grade 6<\/li>\n<li>Voice Club, Grade 7 &amp; 8<\/li>\n<li>WDC Club<\/li>\n<li>Yearbook<\/li>\n<\/ul>\n<h2>Physical Education 6-8<\/h2>\n<p>Physical Education at Maple Avenue occurs once every 3 days and is for sixty minutes. Our students are introduced to a wide variety of activities. Our activities include team sports, individual sports, and fitness training. Students are provided with a lock and locker for use during class. They are responsible for locking up all their belongings. Students are expected to have the following items in order to participate safely in class: shorts, and\/or sweatpants, shirts and a sweatshirt, socks, and sneakers with tied shoelaces. Students must wear athletic clothing for physical education classes.<\/p>\n<p>Students may participate in the following activities:<\/p>\n<ul>\n<li>Adventure Games<\/li>\n<li>Baseball<\/li>\n<li>Basketball<\/li>\n<li>Cooperative Challenges<\/li>\n<li>European Handball<\/li>\n<li>Field Hockey<\/li>\n<li>Flag Football<\/li>\n<li>Floor Hockey<\/li>\n<li>Fitness Training<\/li>\n<li>Golf<\/li>\n<li>Lacrosse<\/li>\n<li>Large Group Games<\/li>\n<li>Omnikin Ball<\/li>\n<li>Pickle Ball<\/li>\n<li>Rowing<\/li>\n<li>Soccer<\/li>\n<li>Softball<\/li>\n<li>Speed Away<\/li>\n<li>Tennis<\/li>\n<li>Track and Field<\/li>\n<li>Yoga<\/li>\n<\/ul>\n<h2>Unified Physical Education<\/h2>\n<p>Unified Physical Education provides a unique opportunity for students with and without disabilities to come together through ongoing developmentally appropriate educational and physical activities. This course is structured around state and national physical education standards and grade level outcomes, which include gaining the knowledge and skills necessary to maintain a health-enhancing level of fitness. Additionally, the class supports the development of leadership skills for all students, and the empowerment of all students to help create a more inclusive and accepting school environment for all students. Students entering grade 8 who are interested in being a partner should share their interest with Coach Coons and Coach Nizzi.<\/p>\n<h2>Health (7)<\/h2>\n<p>Seventh grade health classes meet once every three days for the entire year. The course focuses on seven life skills, including self-management, relationship management, stress management, communication, planning and goal setting, decision making and advocacy. The course also covers nine functional knowledge contents, comprised of physical activity and nutrition, HIV\/AIDS, sexual risk, alcohol and other drugs, tobacco, family life and sexual health, violence prevention, unintended injury, and other required health areas.<\/p>\n<h2>Music<\/h2>\n<p>The Music education program offers students the chance to grow in music responsiveness in various ways. Course options per grade level include:<\/p>\n<ul>\n<li>Grade 6 – Band, Chorus, General Music, Orchestra<\/li>\n<li>Grade 7 – Band, Chorus, Orchestra<\/li>\n<li>Grade 8 – Band, Chorus, General Music, Orchestra<\/li>\n<\/ul>\n<p>Students in band, orchestra and chorus also can participate in local festivals such as All County, Suburban Council, and New York State School Music Association (NYSSMA).<\/p>\n<h3>General Music 6<\/h3>\n<p>Students will experience and develop an understanding of the basic elements of music melody, rhythm, harmony, and tone color. This is done through singing, performing, playing ukulele, listening critically, and writing about music.<\/p>\n<h3>General Music 8<\/h3>\n<p>Student study is through an emphasis of hands-on activities, such as African drumming, and xylophone playing. Classroom activities incorporate the National and New York State Standards for the Arts. Our goal is to improve music skills, apply them to musical compositions and perform on a variety of instruments.<\/p>\n<h3>Band 6, 7 and 8<\/h3>\n<p>Students study the technical and interpretive use of woodwind, brass, or percussion instruments, ensemble playing, and participate in rehearsals for required performances. All music ensembles meet every three days. Students are required to take a weekly lesson either privately or in school, in addition to the band class. School lessons are offered on a rotating schedule. Teacher recommendation is a prerequisite.<\/p>\n<h3>Chorus 6, 7 and 8<\/h3>\n<p>Students study the technical and interpretive use of the voice, ensemble singing, and participate in rehearsals for required performances. Students may join chorus at any point during their middle school experience without a prerequisite.<\/p>\n<h3>Orchestra 6, 7 and 8<\/h3>\n<p>Students study the technical and interpretive use of a stringed instrument, ensemble playing, and participate in rehearsals for required performances. All students are required to take a weekly lesson either privately or in school, in addition to the orchestra class. School lessons are offered on a rotating schedule. The orchestras meet every three days. Teacher recommendation is a prerequisite.<\/p>\n<h2>Home &amp; Career Skills (FACS)<\/h2>\n<p>Throughout the academic year, eighth grade Home &amp; Career classes will convene once every three days. The curriculum will delve into various Family and Consumer Sciences (FACS) modules, focusing on key areas such as Individual Growth &amp; Life Readiness, Human Development &amp; Relationships, Apparel &amp; Textile Production &amp; Design, and Environmental Design &amp; Management. These FACS modules are integral components of the Middle Level Career and Technical Education (CTE) framework in New York State.<\/p>\n<p>Students can anticipate exploring a range of engaging topics including Interpersonal Relationships, Child Development &amp; Family, Interior Design, Financial Literacy, Sewing and Career Interest Exploration.<\/p>\n<h2>Technology: Department of Engineering Technology<\/h2>\n<h3>Mission Statement<\/h3>\n<p>The Engineering Technology Department provides middle school students with the opportunity to explore many areas of engineering.  The department is committed to developing 21<span><sup>st<\/sup><\/span> century learners, innovators, and creators as well as evolving a STEM (Science, Technology, Engineering, and Mathematics) workforce to meet the demands of a global society.<\/p>\n<h2>Grade 7<\/h2>\n<p><strong>Engineering Design &amp; Applications: ½ Year Course<\/strong><\/p>\n<p><strong>Description: <\/strong>This ½ year course introduces students to the foundations of engineering technology and essential skills trades. Students will explore how engineers and skilled tradespeople design and develop products and solutions that impact our daily lives. Students will develop critical thinking and problem-solving skills by learning and applying the iterative engineering design process to solve real-world problems. Students will gain knowledge of 3D modeling, physical prototyping, and material properties such as strength, flexibility, and conductivity by working collaboratively in teams. Students will utilize hand and power tools to design, build, and test their solutions, with a focus on basic woodworking and joining techniques.<\/p>\n<p><strong>Technical Systems &amp; Skills Trades: ½ Year Course<\/strong><\/p>\n<p><strong>Description: <\/strong> This ½ year course introduces students to various technical systems and core skills trades through project-based learning. Students will learn how technical systems and skilled trades are used in various industries and applications, and how they contribute to our infrastructure and economy. Students will design and build projects using a variety of materials and tools, with a focus on practical application of concepts.  Students will apply basic robotics concepts, with an emphasis on mechanical systems.  Students will communicate technical ideas effectively and demonstrate safe work practices.  Areas of focus include electrical circuit fundamentals, construction (e.g., building model structures), manufacturing (e.g., designing and producing simple products, introduction to assembly), communication, and transportation (e.g., building model vehicles, understanding mechanical systems) systems.<\/p>\n<h3>Grade 8<\/h3>\n<p><strong>Technical Careers: Full Year Course<\/strong><\/p>\n<p><strong>Description: <\/strong>This full-year course builds upon the knowledge and skills gained in 7<sup>th<\/sup> grade, focusing on advanced studies in design, Computer-Aided Design (CAD), and an introduction to various engineering and skills trades disciplines such as mechanical, and civil engineering, and further exploration of skills trades. Students will investigate how engineers and skilled tradespeople contribute to innovation and solve global challenges, and how they contribute to local and national infrastructure.  Students will apply advanced engineering design principles and analyze and solve complex engineering problems. Students will be exposed to emerging technologies such as 3D printing and utilize CAD software for design and modeling. Students will develop technical and critical thinking skills through hands-on applications and explore ethical considerations in engineering and the trades. Students will also begin to explore career pathways within engineering and the skilled trades.<\/p>\n<p><strong>STEM Academy (Science, Technology, Engineering, Mathematics): Full Year Course<\/strong><\/p>\n<p><span><strong>Description: <\/strong>This course is designed for students with a strong interest in engineering, science, math, and advanced technical skills. It applies math and science principles to the engineering design process and CAD.  Students will engage in challenging engineering design projects and create a portfolio showcasing their work.  This course will help prepare students for advanced technical studies in the high school Project Lead the Way program. Successful completion of this course is required to take Introduction to Engineering in 9<sup>th<\/sup> grade.<\/span><\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li><span> <\/span><span><strong>Prerequisites:<\/strong> Students are highly recommended to have an 85% or above overall average in both math and science, and a 90% or above overall average in “the 7<sup>th<\/sup> grade Technology courses”. Other considerations include demonstrated skills in CAD, tool, and creativity, problem-solving, and work ethic, as assessed by teacher recommendations.<\/span><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Art 6-8<\/h2>\n<p>The goal of the art program is to foster appreciation, knowledge and development of the visual arts.  Each year of art builds upon the student’s prior knowledge. Through the creation of their own artwork, students will learn about a variety of mediums and techniques.  Concepts and vocabulary will be introduced and developed in color theory, drawing, painting, ceramics, mixed media and 3-dimensional works.  Students will not only learn that art is a form of personal expression, but also how it has played an integral role throughout human culture.  Students will learn how to assess, judge, and improve their own artwork.  At the same time, they will be reinforcing many lifelong learning skills. <\/p>\n<p>These skills include critical thinking, creative problem solving, group interactions, cooperative learning, multi-tasking, motivation, self-reliance, and good work habits.  All art programs are in compliance with the NYS Standards for the Arts.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>The standards are:<\/strong><\/span><\/p>\n<ol>\n<li>Creating &#8211; Conceiving and developing new artistic ideas and work.<\/li>\n<li>Presenting – Interpreting and sharing artistic work.<\/li>\n<li> Responding – Understanding and evaluating how the arts convey meaning.<\/li>\n<li> Connecting – Relating artistic ideas with personal meaning and external context<\/li>\n<\/ol>\n<h2>World Languages<\/h2>\n<p>World Languages, part of the core curriculum, play a crucial role in the preparation of our students to become valued global citizens. Technology, a global society, and a global economy have brought the world’s people closer together, creating an even greater need for real communication and understanding between cultures. The first step in achieving this is to promote understanding of other cultures and languages.  Students will engage in a variety of activities including singing, dancing, cooking and tasting the foods of many countries, while doing comparison studies of cultures.  Additionally, there will be many hands-on activities that will encourage speaking and writing in the language both in class and at home. <\/p>\n<p>Students begin study of their choice of French or Spanish in 7th grade. In eighth grade, students continue in the language in which they are enrolled.  At the end of 8<sup>th<\/sup> grade, students take the World Language Proficiency Examination.<\/p>\n<p>All students are required to pass the second language courses in which they are enrolled and the exam at the end of 8<sup>th<\/sup> grade. Successful completion of the sequence of courses and the World Language Proficiency Examination awards students their first High School credit. This language credit is required for graduation from High School<strong>.<\/strong> Those who fail courses or the exam will be required to repeat a level 1 course the following year at the High School to earn the required language credit for graduation from High School.<\/p>\n<p>Students planning to get a Regents diploma with Advanced Designation complete 2 more years of a second language at the High School and must pass the Comprehensive Examination in a Second Language as a minimum requirement.<\/p>\n<h2>Computer Science &amp; App Design<\/h2>\n<p>This program offers 6<span><sup>th<\/sup><\/span> grade students the opportunity to gain valuable “life skills” and is broken into several segments that teach necessary skills to keep current in an ever-changing technological society.  The class meets every other day for one semester of the school year and helps to prepare students for computer experience encountered in various subject areas throughout their middle and high school education.<\/p>\n<p>Some of the main topics we cover are the Windows Operating System, Computer Safety and Ethics, Office 365 (OneDrive, Mail, Calendar, Teams, Forms, and Sway), Microsoft Office (PowerPoint, Word, Excel, and Publisher), Coding, App Design, and Home Row Typing.<\/p>\n<p>Using a project-based approach, most activities in class are done using one of the Microsoft Office programs.  On many projects, students will have the freedom to choose a topic based on their oven personal interests.<\/p>\n<p>With the App Design unit, students create basic apps on the computer and test them out on a tablet (provided in class).<\/p>\n<h2>English Language Arts 6-8<\/h2>\n<p><span>English Language Arts (ELA) is a full block class that meets on a 2 of every 3 days rotation. Curriculum is grounded in the Next Generation Standards for English Language Arts. Instruction focuses on the essential standards within the 4 core areas of language arts:<\/span><\/p>\n<ul>\n<li>Reading<\/li>\n<li>Writing<\/li>\n<li>Speaking and Listening<\/li>\n<li>Language<\/li>\n<\/ul>\n<p>The skills and knowledge captured in the Next Generation Standards include critical thinking skills and the ability to closely and attentively read texts, enabling students to understand and enjoy complex works. Students will be challenged to read various genres of literature as well as non-fiction texts and use logical reasoning and essential reading strategies to dissect text and build meaning. They will respond to text by answering varying levels of questions in written and discussion formats stressing higher-level thinking, problem solving, analysis, and synthesis. Teacher selected articles, poems, dramatic works, and novels are used to meet the goals of the Next Generation Standards.<\/p>\n<p>English Language Arts instruction for grade 6 students consists of Language Arts 6 and ELA Reading Skills, ELA Writing Skills, and\/or AIS ELA.<\/p>\n<h3>ELA 6 READING SKILLS AND ELA 6 WRITING SKILLS<\/h3>\n<p><span>ELA Reading Skills and ELA Writing Skills are full block classes that meet on a 1 of every 3 days rotation.  Each course is a semester course.  Sixth grade students will take ELA Reading Skills for ½ year and ELA Writing Skills for the other ½ of the year.  The focus of the Language Arts Skills classes is to develop and strengthen the reading and writing habits needed for success throughout middle and high school and ultimately outside of <\/span><span>school: in college, work, and in students’ personal lives.  The curriculum is responsive to the needs of students and addresses skills in reading, writing, speaking and listening, and language.  Instruction is designed considering the alignment between proficiency with essential skills and individual student need and interest.<\/span><\/p>\n<p><span>In Grade 6 ELA, students will be challenged to become more confident as readers and writers, to take risks, to gain independence in building meaning from challenging and engaging text, and to effectively communicate through both the spoken and written words. Students will begin to establish their personal identities as readers and writers through choice, discussion, collaboration, and presentation.  The curriculum will include daily practice with rigorous and authentic reading and writing tasks for all language arts <\/span><span>learners, from the reluctant to the proficient.  The goal of the Grade 6 ELA Program is to engage students in learning experiences that foster the development of an attitude of enjoyment, capability, and empowerment in language arts.<\/span><\/p>\n<h2>Mathematics 6-8<\/h2>\n<p>Mathematics instruction for grades 6 – 8 follows the New York State Next Generation Learning Standards. Instruction will help students develop and cultivate skills and knowledge based on mathematical practices such as problem solving, reasoning, modeling, precision, and critical thinking.  Students will be challenged to make sense of problems, persevere in solving them to build foundational skills, and make sense of real-world applications.  Each grade level math course meets for a full block twice every three days.<\/p>\n<h3>Math 6 Math Skills<\/h3>\n<p>In addition to their regular Math 6 class, all 6<sup>th<\/sup> grade students are enrolled in the Grade 6 Math Skills course which meets once every three days.   The Math Skills class provides additional time for instruction, support and guided practice with the 6<sup>th<\/sup> grade math standards.  The Math Skills teachers and the Math 6 Class teachers collaborate to ensure cohesive instruction.<\/p>\n<h3><strong>Math Acceleration<\/strong><\/h3>\n<p>The Accelerated Pathway is designed for students who consistently demonstrate advanced levels of mathematical understanding and application, as well as advanced levels of proficiency in math content.<\/p>\n<p><strong>MATH 7 ACC<\/strong> &#8211;<\/p>\n<p>Math 7 Accelerated combines 7th and 8th grade essential next generation math standards into a demanding one-year course.  Students enrolled in 7ACC are expected to maintain an average of 80% or higher to achieve success in the program.  Students are selected for accelerated math based on their performance on a placement test, the most recent I-Ready diagnostic score, Math 6 assessment scores, and teacher feedback on homework completion, math fact fluency, class participation, and work ethic. Students interested in enrolling in accelerated math must be willing and eager to extend themselves academically. Upon successful completion of the Math 7 Accelerated course, students will then be eligible to take Algebra 1, a high school Regents math course, in 8<sup>th<\/sup> grade.<\/p>\n<p><strong>ON RAMP<\/strong> – Students who perform exceptionally well in Math 7 and perform well on a separate placement test (in 7th grade) may be invited to participate in our On-Ramp Program, a rigorous after-school program targeting the essential 8th grade Next Generation standards necessary. Successful completion of this program results in enrollment in Regents Algebra I in 8th grade. Acceptance into the On Ramp program is based on the same criteria listed above.<\/p>\n<p><strong>ALGEBRA I<\/strong> – This course follows the NYS Next Generation Standards for Algebra I, a course typically offered at the high school level. The fundamental purpose of this course is to formalize and extend the mathematics that students learned in the middle grades. Because it is built on the middle grades’ standards, this is a more ambitious version of Algebra I than has generally been offered. Students enrolled in Algebra I are expected to maintain an average of 80% or higher to achieve success in the program. Students enrolling in accelerated math must be willing and eager to extend themselves academically. It is important to emphasize that performance in Algebra I and a student’s score on the Regents Exam will become part of a student’s high school transcript. A STUDENT WHO WISHES TO DROP ALGEBRA I MUST DO SO BY THE END OF THE 2nd MARKING PERIOD.<\/p>\n<p><strong>WHAT HAPPENS IF MY CHILD DOES NOT ACCELERATE IN MATH AT ALL?<\/strong> It must be emphasized that if students do not accelerate in grade 7 or 8, the opportunity to take honors level math classes and AP courses at the high school level is not closed.  These options remain a possibility throughout high school so long as aptitude and high academic performance are demonstrated, and other prerequisites are met.<\/p>\n<h2>Science 6-8<\/h2>\n<h3>Philosophy and Mission<\/h3>\n<p>Science challenges students to question, explore and assess the world around us and seek out answers.  Our science department teaches essential 21<span><sup>st<\/sup><\/span> century skills necessary in any future career.  We believe that students learn best when engaged in activities that are not simply hands-on but more importantly minds-on.  Through teacher-led demonstrations, students conduct laboratory investigations, and other problem-solving activities, we strive to engage students while helping to illustrate the often-abstract concepts of science. All science curriculum is aligned to the New York State Science Learning Standards.<\/p>\n<h3>Curriculum Overview<\/h3>\n<p><strong>SCIENCE 6<\/strong><\/p>\n<p>The Science 6 curriculum is an introduction to middle school science and engineering practices.  This includes the exploration of life science topics such as ecology, cycles in nature, the Earth’s ecosystems, cell structure, and heredity<\/p>\n<p>\n<strong>SCIENCE 7<\/strong><\/p>\n<p>The Science 7 curriculum investigates planet Earth.  Students will learn about the Earth’s internal and external structure and the reasons for many natural phenomena such as earthquakes and volcanoes.  In laboratory activities, students will learn to make accurate measurements and record data in an organized form with correct units.  Students also will learn about the underlying physics behind activities on Earth.  <span><strong> <\/strong><\/span><\/p>\n<p><strong>SCIENCE 8<\/strong><br \/>\nThe Science 8 curriculum incorporates many demonstrations and laboratory activities in chemistry and physics. Students will explore matter and its states and investigate the properties of matter at the level of an atom up through compounds and mixtures. In addition, forms of energy and the transformations between energy types are surveyed. Towards the end of the course, students will prepare for the New York State Intermediate Level Science Test (Computer Based Test).<\/p>\n<h3>Science Acceleration<\/h3>\n<p><strong>Science 7 Accelerated and Grade 8 Regents<\/strong><\/p>\n<p><span style=\"text-decoration: underline;\"><strong>About Science Acceleration<\/strong><\/span><\/p>\n<p>Science 7 Accelerated combines the major physical science concepts of 7th and 8th grade science into a demanding one-year course.  Science 7 Accelerated students will then have Regents Life Science: Biology in 8th grade. By accelerating in science, students will have one of their required science courses for graduation completed before entering high school. Students must be highly motivated and excel in science and math in order to be successful in Regents Life Science: Biology.<\/p>\n<p>Students taking this course will take the Regents Exams in June.  Regents classes require an additional lab period.<\/p>\n<p>It is highly recommended that a student accelerated in 7th grade maintain an 80 or higher average in science and math. If a student’s overall average is below an 80% after marking period 1, a parent teacher conference should be scheduled.<\/p>\n<p>Students who are not accelerated in 7th grade will continue to follow the traditional pathway and take Science 7 and Science 8.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>Selection Process<\/strong><\/span><\/p>\n<p>Grade 6 students interested in the accelerated program will have the opportunity to take a placement test that, in conjunction with other criteria, will be used to determine student eligibility. Student invitation into the accelerated program will be based on the following criteria:<\/p>\n<ul>\n<li>40% of ranking: Science Placement Test;<\/li>\n<li>35% of ranking: Math Assessment average Marking Periods 1-2;<\/li>\n<li>20% Science average Marking Periods 1-2; ·<\/li>\n<li>5% Teacher recommendation.<\/li>\n<\/ul>\n<p><span style=\"text-decoration: underline;\"><strong>What happens if my child does not accelerate in Science at all?<\/strong><\/span><\/p>\n<p>It must be emphasized that if students do not accelerate in grade 7 or 8, the opportunity to take honors science classes and AP courses is not closed. On the contrary, these options remain a possibility throughout high school so long as aptitude and high academic performance are demonstrated, and other prerequisites are met.<\/p>\n<p>If you have any questions, please email John Scrivo, the Science Department Head at<a href=\"mailto:j_scrivo@saratogaschools.org\"> j_scrivo@saratogaschools.org<\/a><\/p>\n<h2>Social Studies 6<\/h2>\n<p><span>Grade 6 is a continuation from grade 5, studying the history of the world.  The program emphasizes the interdependence of all people and their connection to the interaction of geography and economics.  Various civilizations, empires, city-states, and nation states are studied from the four perspectives of history, geography, economics, and government.  Students will participate in numerous activities that include various examples of assessment, team activities, and cooperative learning opportunities<\/span><\/p>\n<h2>Social Studies 7<\/h2>\n<p>Students will take part in the presentation of American History from pre-Columbian time through the Civil War.  This course is part of a two-year sequence in American History.  It begins in Grade 7 and is completed in grade 8.  Grade 7 accents the origin, growth, and role of New York State within the framework of the American History study.  Students will understand the origin, operation, and application of the Federal Constitution, as well as the local and New York State government.  Student-centered teaching through the use of primary sources, films, and other visual aids is emphasized<\/p>\n<h2>Social Studies 8<\/h2>\n<p>Grade 8 continues the chronological study of American History with emphasis on America’s development in the 19<span><sup>th<\/sup><\/span> and 20<span><sup>th<\/sup><\/span> centuries.  Students are involved in the historical, social, geographic, political, and economic themes as they relate to the people and events of this time period.  Student-centered teaching through the use of primary sources, films and other visual aids is emphasized.   <\/p>\n<h2>Academic Intervention Service (AIS)<\/h2>\n<p><span style=\"text-decoration: underline;\"><strong>AIS English Language Arts 6-8<\/strong><\/span><span style=\"text-decoration: underline;\"><br \/>\n<\/span><\/p>\n<p>The goal of AIS Language Arts class is to improve reading and writing skills for identified students.  The focus is placed on those skills which are required for mastery of the Essential Next Generation Standards for English Language Arts; for mastery of the New York State Assessments; and for mastery of the middle school curriculum.  To achieve this goal, strategies in reading fluency, vocabulary acquisition, comprehension, and writing are introduced, reinforced, and practiced with the use of fiction and nonfiction text from a variety of sources.<\/p>\n<p><span style=\"text-decoration: underline;\"><strong>AIS Math 6-8<br \/>\n<\/strong><\/span><\/p>\n<p>AIS stands for “Academic Intervention Services” and is required by New York State.  This class meets once every three school days.  The purpose of AIS is to provide reteaching and support of foundational skills to fill gaps for struggling learners.  The class sizes are very small, allowing the opportunity for small group instruction and more one-on-one intervention.<\/p>\n<p>Students are identified for AIS Math through NY State Assessment scores, I-Ready diagnostic scores and\/or teacher recommendation.  Some students may move into AIS Math throughout the school year, based on difficulty achieving mastery of grade level standards along with teacher recommendation.<\/p>\n<p>All Maple Avenue students participate in an I-Ready Diagnostic test three times each school year.  Student enrollment in AIS Math will be re-evaluated at the end of each quarter to ensure proper student placement.<\/p>\n<h2>PBIS: Positive Behavioral Interventions and Supports<\/h2>\n<p><strong>What is PBIS?<\/strong><\/p>\n<ul>\n<li><span>PBIS (Positive Behavior In School) is an organized, data-driven system of interventions, strategies, and supports that positively impact school-wide and individualized behavior planning.<\/span>\n<p>Using the most current best practices, strategic teams are trained to positively impact behavior at three key behavioral tiers:<br \/>\nTier 1 &#8211; Universal &#8211; Applies to the whole school<br \/>\nTier 2- Targeted -Individual or small groups of students who have difficulty making proper choices<br \/>\nTier 3 &#8211; Intensive &#8211; Students who have complex needs and behaviors<\/p>\n<p>An important part of PBIS is the clear and consistent expectations developed by the school’s PBIS team. It will be our job to teach the meaning of these expectations as they apply to each area or activity in our classrooms and school. Maple Avenue has adopted five basic expectations:<\/li>\n<li>Be Safe<\/li>\n<li>Be Respectful<\/li>\n<li>Be Responsible<\/li>\n<li>Be Kind<\/li>\n<li>Be Here<\/li>\n<\/ul>\n<p>The PBIS Team has developed school-wide behavioral expectations that include clear, identifiable behaviors (Behavior Matrix), how the behaviors will be taught (Lesson Plans), and how the behaviors will be consistently and systemically encouraged and acknowledged.   The PBIS Team has also developed a system of rewards to recognize the positive behavior of our students. <span> <\/span>Additionally, a referral form is used to help gather and analyze behavioral data.  This data will be used to target interventions and assess the effectiveness of these interventions<\/p>\n<p>\nExample from the Behavioral Matrix:<\/p>\n<p><strong>Hallway<\/p>\n<p><\/strong>Be Safe<\/p>\n<ul>\n<li>Walk to the right<\/li>\n<li>Help others in need<\/li>\n<li>Report any concerns to an adult<\/li>\n<\/ul>\n<p>Be Respectful<\/p>\n<ul>\n<li>Between classes – Hallway voice (0-2)<\/li>\n<li>During classes – Hallway voice (0-1)<\/li>\n<li>Take pride in school environment<\/li>\n<li>Be polite with your word and actions<\/li>\n<\/ul>\n<p>Be Responsible<\/p>\n<ul>\n<li>Keep clean locker clean and locked<\/li>\n<li>Plan ahead and use time wisely<\/li>\n<li>Pick up after yourself<\/li>\n<li>Return lost items<\/li>\n<li>Move directly towards destination (pass<br \/>\nrequired during class time)<\/li>\n<\/ul>\n<p>Be Kind<\/p>\n<ul>\n<li><span>Provide space for <\/span><span>others to walk<\/span><\/li>\n<li><span>Only say words<\/span><span> that are true, <\/span><span>harmless, inspiring, <\/span><span>necessary, or kind (THINK)<\/span><\/li>\n<\/ul>\n<h2>Maple Avenue Middle School Behavior Code<\/h2>\n<p>As a school we play a multi-faceted role in the lives of children. Our mission is to offer educational programs that capitalize on the unique characteristics and needs of middle level students.  We will make a cooperative effort to prepare our students intellectually, creatively, socially, emotionally, and physically to become caring and contributing members of a global society.  Also included in this mission is the task of educating adolescents to live within the rules and limits of society and develop good habits of self-discipline.<\/p>\n<p>As a societal organization, the school must establish rules and limits in order to create an environment where learning can occur. These rules must be fair, understood by students, modeled by adults, and consistently enforced. It is important for each adolescent to know we care, that we are aware of their needs, that we are enthusiastic, and appreciative of good behavior. They must understand that we will not condone or accept poor behavior.<\/p>\n<p>All students are provided with a photo ID free of charge that is to be carried with them at all times. Students will present their ID upon request from school personnel. If a student loses their ID a new one can be purchased.<\/p>\n<h2>Bus Conduct<\/h2>\n<p>Students are expected to conduct themselves appropriately in school and when riding the bus. Bus rules are designed to keep students and community members SAFE.  When bus rules are not adhered to, students face possible suspension from transportation. Students accused of violent and\/or disruptive incidents as reported to the NYS Department of Education, may face additional disciplinary action including, but not limited to suspension from school.<\/p>\n<p>Expected Behavior:<\/p>\n<ol style=\"list-style-type: lower-alpha;\">\n<li>Follow the directions of the driver<\/li>\n<li>Stay in your seat<\/li>\n<li>Keep all parts of your body and objects to yourself and inside the bus<\/li>\n<li>No foul language or rude behavior<\/li>\n<li>No eating or drinking<\/li>\n<li>No tobacco products, illegal substances, or hazardous items<\/li>\n<\/ol>\n<h2>Campus Discipline<\/h2>\n<p>When the school behavior code is not adhered to, the following disciplinary actions will be put into effect:<\/p>\n<ol>\n<li><strong>Lunch Detention:<\/strong> <span>Student will be placed in lunch detention for their lunch period. Administration will assign lunch detention for lunch and lunch flex for cafeteria infractions and other areas of persistent non-cooperation.<\/span><\/li>\n<li><strong>After School Detention (ASD):<\/strong> <span>Student will be assigned to stay after school until 3:05pm on late bus dates. During this time, a specific written assignment may be provided. Failure to comply with this may result in an In-School Suspension.<\/span><\/li>\n<li><strong>Remove from classroom: <\/strong>Teacher will contact appropriate Assistant Principal’s office to inform that the child has been removed from class.<\/li>\n<li><strong>In School Suspension (ISS): <\/strong> <span>Student will be placed in the ISS room for the duration of specified time. All class work will be provided and completed under supervision. Students may be released at dismissal if they completed all their schoolwork and have displayed exceptional behavior during the day.<\/span><\/li>\n<li><strong>Out of School Suspension (OSS): <\/strong> Student will be removed from the school for a period of time based on the frequency and severity of the rules violated. Work will be provided. Parents will be notified by phone and in writing. A building administration re-entry meeting with parents is required to return to school. Additional tutoring is available at the High School District Tutoring Center<\/li>\n<li><strong>Superintendent&#8217;s Hearing: <\/strong>Based on the severity of the incident that occurred, students may be suspended more than five days out of school. This will result in a Superintendent’s Hearing.<\/li>\n<\/ol>\n<h3>Minor Infractions<\/h3>\n<p>These infractions are typically dealt with on the team\/classroom level and will be referred to the administration for repeat offenses.<\/p>\n<ul>\n<li><strong>Food &amp; Beverages: <\/strong>Food and drink is to remain inside the cafeteria. Energy drinks are not allowed on school grounds due to their high caffeine content and potential health risks for students<\/li>\n<li><strong>Dress Code &amp; Grooming:  <\/strong>Students are expected to give proper attention to personal cleanliness. Students are also expected to dress appropriately for school and school-related functions. Students and parents have the primary responsibility for acceptable student attire and appearance. Teachers and all other district personnel should exemplify and reinforce acceptable student attire and help students develop an understanding of appropriate appearance in the school setting.<strong><br \/>\n<\/strong><br \/>\nStudent Attire:<\/p>\n<ul>\n<li>Is safe and appropriate, and does not disrupt the educational process<\/li>\n<li>Includes footwear at all times. Footwear that is a safety hazard will not be allowed<\/li>\n<li>Ensure that undergarments are completely covered with outer clothing, extremely brief garments are not permitted<\/li>\n<li>No forms of gang related garments, jewelry or other items that are symbolic with gang membership<\/li>\n<li><span>No items that are vulgar, obscene and libelous or that denigrate (put down\/insult) others on account of race, color, religion, creed, national origin, gender, sexual orientation or disability<\/span><\/li>\n<li><span>No items that promote and\/or endorse the use of alcohol, tobacco, or illegal drugs and\/or encourage other illegal or violent activities<\/span><\/li>\n<li>No garments with items that could cause injury to you or others<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<ul>\n<li><strong>Tardiness: <\/strong>Arriving late without a pass to class.<\/li>\n<li><strong>Inappropriate Language or Gestures: <\/strong>Rude or disrespectful language or gestures towards anyone in the building.<\/li>\n<li><strong>Disruptive Behavior:<\/strong>Actions that interfere with any person’s ability to learn, including the unauthorized sale and\/or distribution of non-school approved items.<\/li>\n<li><strong>Unauthorized Area of School Grounds: <\/strong>Being in an area that is not designated on that student&#8217;s schedule.<\/li>\n<li><strong>Public Display of Affection (PDA): <\/strong>Is not allowed in school, including, but not limited  to: kissing, hand holding, extended hugs, and inappropriate touching.  <\/li>\n<li><strong><strong><strong>Use of Electronic Devices: <\/strong><\/strong><\/strong>The use of unauthorized portable electronic devices during the school day is prohibited, including, but not limited to: cell phones, AirPods, iPads, and smartwatches. Students may contact home using their House Office or Main Office phone.<\/li>\n<li><strong><strong>Academic Dishonesty: <\/strong><\/strong> Cheating or assisting others to cheat and\/or copy assignments. This includes, but is not limited to cheating, copying assignments, plagiarism of another’s work, altering academic records, use of AI tools to complete school assignments unless explicitly approved by a teacher, or assisting another student in the act of academic dishonesty.<\/li>\n<\/ul>\n<h3>Major Infractions<\/h3>\n<p><span>All infractions listed below are immediately referred to administration. If warranted, a superintendent’s hearing will be scheduled and\/ or notification will be made to the appropriate local authorities. All major behavior code infractions will result in parent notification<\/span><\/p>\n<ol>\n<li><strong>Disorderly Conduct:<\/strong> Any behavior that is deemed unacceptable, inappropriate, or hazardous to the safety or well-being of individuals on school property.<\/li>\n<li><strong>Academic Dishonesty:<\/strong> : Plagiarism of another’s work, altering academic records, use of AI tools to complete school assignments unless explicitly approved by a teacher, or assisting another student in the act of academic dishonesty.<\/li>\n<li><strong>Harassment\/Bullying\/Hazing (refer to Hazing Policy):<\/strong> Behaviors, actions, words, or images in verbal, physical, written, pictorial, video, or electronic form that are threatening, disturbing, intimidating, discriminatory, illegal, derogatory, cruel, or unwanted &#8211; aimed directly or indirectly towards another person. Such behaviors, actions, words, or images-whether initiated at school or at home-that affect the educational process of the school environment and\/or the people therein, will be deemed harassment.<\/li>\n<li><strong>Smoking:<\/strong> The possession of tobacco or paraphernalia of any kind.  I.E, vapes, vape cartridges.<\/li>\n<li><strong>Vandalism:<\/strong> Destroying or mutilating objects or materials belonging to the school, personnel, or other persons.<\/li>\n<li><strong>Insubordination:<\/strong> Blatant defiance of authority.  Including, but not limited to, refusal to follow the reasonable request of an adult in the building or lying to an adult (e.g., providing a false name).<\/li>\n<li><strong>Computer Violations:<\/strong> Engaging in or assisting others to access or download unauthorized accounts, programs, or websites. Violations also include but are not limited to damage to computer hardware or software. Computer privileges may be revoked.<\/li>\n<li><strong>Verbal threat including hazing:<\/strong> Forewarning of physical\/mental harm.<\/li>\n<li><strong>Fighting:<\/strong> <span>Engaging in or threatening physical contact for purpose of inflicting harm on another person.<\/span><\/li>\n<li><strong>Extortion:<\/strong> The solicitation of money or something of value from another person in return for protection or in connection with a threat to inflict harm<\/li>\n<li><strong>Sexual Harassment:<\/strong> <span>Sexual harassment is unwelcome sexual advances, requests for sexual favors, and other verbal or physical conduct of a sexual nature.<\/span><\/li>\n<li><strong>Physical assault:<\/strong> Physical attack by one person, or a group of people, upon another person, who does not wish to engage in the conflict and who has not provoked the attack.<\/li>\n<li><strong>Theft:<\/strong> Taking or being in possession of property that does not belong to you.  Students are discouraged from bringing to school objects which have above average value or sentimental value.  The school district is not responsible for the loss of these items. Examples are expensive jewelry or watches, cell phones, I-Pads, AirPods, and calculators.<\/li>\n<li><strong>False (fire) Alarm or Bomb Threat:<\/strong> Causing alarm without justification<\/li>\n<li><strong>Weapons:<\/strong> The possession of a dangerous weapon or the use of any object, to inflict injury on another person.<\/li>\n<li><strong>Arson:<\/strong> Intentional starting of a fire.<\/li>\n<li><strong>Explosives:<\/strong> The use, possession, or sale of explosive devices.<\/li>\n<li><strong>Drugs or alcohol:<\/strong> The use, possession, or sale of drugs or alcohol.<\/li>\n<li><strong>Leaving campus:<\/strong> Unauthorized leaving of school while in session.<\/li>\n<\/ol>\n<h3>Rules for ISS, Lunch Detention, And After School Detention<\/h3>\n<ol>\n<li>There is NO talking or making noises. If you have a question, raise your hand, and wait to be called on by the teacher.<\/li>\n<li>Stay in your seat, keep your feet under your desk, and face forward.<\/li>\n<li>NO chewing gum or eating candy.<\/li>\n<li>Complete all assignments as instructed.<\/li>\n<li>If you are absent on the designated date of your detention, you will serve it when you return.<\/li>\n<li>All school rules apply here, as well as the rules for detention.<\/li>\n<\/ol>\n<ol><\/ol>\n<ol><\/ol>\n<h3>After School Detention<\/h3>\n<ol>\n<li>At dismissal, you will report directly to the detention room (or other designated room) after you go to your locker.<\/li>\n<li>Dismissal from after-school detention will be at 3:05 p.m.<\/li>\n<\/ol>\n<h3>Hazing Policy<\/h3>\n<p>Joining groups is a basic human need.  Forming a sense of identity and belonging is a major developmental task for students. In any group activity, building a spirit of team camaraderie should be an important goal.  The Saratoga Springs City School District enacts this policy to ensure and maintain a safe learning environment for students that is free from hazing. Hazing activities of any type are inconsistent with the educational goals of the school district are always prohibited.<\/p>\n<h4>Definition of Hazing<\/h4>\n<ol style=\"list-style-type: upper-alpha;\">\n<li style=\"list-style-type: none;\">\n<ol style=\"list-style-type: upper-alpha;\">\n<li>Hazing means committing an act against a student or group of students or coercing a student into committing an act that creates a risk of harm to a person, for the student to be initiated into or affiliated with a student organization, or for any other purpose. The term hazing includes, but is not limited to:\n<p>1. Any humiliating or dangerous activity expected of a student to join a group, regardless of the student’s willingness to participate (conduct has the potential to endanger the mental or physical health or safety of a student).<\/p>\n<p>2. <span>Any hurtful, aggressive, destructive, or disruptive behavior such as but not limited to striking, stripping, sleep deprivation, confinement in a restricted area, calisthenics or other activity that subjects the student to a risk of harm or that adversely affects the mental or physical health or safety of the student.<\/span><\/p>\n<p>3. Any use or abuse of tobacco, alcohol, drugs, or other substances that subjects the student to a risk of harm or that adversely affects the mental or physical health or safety of that student.<\/p>\n<p>4. Any activity that intimidates or threatens the student with ostracism,<br \/>\nsubjects a student to mental stress, embarrassment, shame or humiliation, or adversely affects the mental health or dignity of the student or group of students.<\/p>\n<p>5. Any activity that causes or requires the student to perform a task that involves violation of state or federal law or of school district policies and regulations.<\/li>\n<\/ol>\n<\/li>\n<li><span> Student organizations: means a group, club, or organization having students as its primary members or participants. It includes grade levels, classes, team activities, or school events. A student organization does not have to be an official school organization to come within the terms of this definition.<\/span><\/li>\n<\/ol>\n<h2>Reprisal<\/h2>\n<p>The school district will discipline or take appropriate action against any student, teacher, administrator, volunteer, coach, or any school employee who retaliates against a person who makes a good faith report of alleged hazing or against any person who testifies, assists, or participates in a proceeding or hearing relating to such hazing. Retaliation includes, but is not limited to, any form of intimidation, reprisal, or harassment.<\/p>\n<p>This policy will be published in the school code of conduct, included in the annual school calendar, distributed to all employees, and posted in locker rooms and gymnasiums. The policy will be reviewed by the athletic director with coaches at the pre-season meeting held in the fall, winter, and spring. Also, each coach is asked to return the signed statement to the athletic director acknowledging an awareness and commitment to uphold this policy.<\/p>\n<h2>District Code of Conduct<\/h2>\n<p>Secondary Summary Document*<\/p>\n<p>The Code of Conduct is developed in an effort to:<\/p>\n<ul>\n<li>clearly define the expectations for acceptable conduct on school property.<\/li>\n<li>identify the possible consequences of unacceptable conduct.<\/li>\n<li>ensure that discipline, when necessary, is administered promptly and fairly.<\/li>\n<li>support the Dignity for All Students Act.<\/li>\n<\/ul>\n<p><strong>DEFINITONS<\/strong><\/p>\n<p>For purposes of the code, a set of common definitions were developed. The complete list of definitions can be found in the Code of Conduct which is available at the Main Office or on our District’s website (www.saratogaschools.org):<\/p>\n<p><strong>RIGHTS AND RIGHTS AND RESPONSIBILITIES<\/strong><\/p>\n<p><span>The Code of Conduct defines the rights and responsibilities of students as members of the school community.  These rights and responsibilities relate to academic, school citizenship, school health and safety procedures, behavioral and extra-curricular activities.  No student shall be subjected to harassment or discrimination based on a person’s actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, <\/span><span>gender, or sex by school employees or students on school property or at a school sponsored function. It shall be the responsibility of students to be open to active participation in resolving conflicts through a restorative process.<\/span><\/p>\n<p><strong>ESSENTIAL PARTNERS<\/strong><\/p>\n<p><span>All members of our learning community-including students, staff, parents, and engaged service providers have a responsibility to promote behavior that enhances academic and social success thus providing a positive climate in the learning community.  Their roles and responsibilities are explained in detail in the complete document.  Parents are encouraged to be open to active participation in resolving conflicts through a restorative process.<\/span><\/p>\n<p><strong>STUDENT DRESS CODE<\/strong><\/p>\n<p><span>All students are expected to give proper attention to personal hygiene and dress appropriately for school and school functions.  Students and their parents have a primary responsibility for acceptable student dress and appearance, provided such dress and grooming issues does not disrupt the educational process of the school or endanger the health or safety of the individual student or others.  District personnel should exemplify and reinforce acceptable student dress and help students develop an understanding of appropriate appearance in the school setting.<\/span><\/p>\n<p>A student’s dress, grooming and appearance, including hairstyle\/color, jewelry, make-up, nails and accessories shall:<\/p>\n<ol>\n<li>Be safe and appropriate and not disrupt or interfere with the educational process.<\/li>\n<li>Include footwear at all times. Based on the classroom setting, footwear that is deemed “unsafe” by the building principal or designee will not be permitted.<\/li>\n<li>Ensure that undergarments are completely covered with outer clothing.<\/li>\n<li>Not include wearing garments, jewelry or other forms of symbolism associated with gangs or gang membership.<\/li>\n<li>Not include items that are vulgar, obscene, and libelous or denigrate others on account of actual or perceived race, (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, religion or religious practice, creed, national origin, gender and gender identity, sexual orientation, sex or disability.<\/li>\n<li>Not promote and\/or endorse the use of alcohol, tobacco, or drugs and\/or encourage other illicit or violent activities.<\/li>\n<li>Not cause injury to themselves or others.<\/li>\n<\/ol>\n<p>***New York State School Boards Association (NYSSBA) defines parents as “parent, guardian or person in parental relation to student<\/p>\n<h3>Prohibited Student Conduct **<\/h3>\n<p>Students may be subject to disciplinary action, up to and including suspension from school, when they engage in the following:<\/p>\n<ol style=\"list-style-type: upper-alpha;\">\n<li>Disorderly conduct<\/li>\n<li>Insubordinate behavior<\/li>\n<li>Disruptive behavior<\/li>\n<li>Violent behavior<\/li>\n<li>Endangering the safety, morale, health or welfare of others<\/li>\n<li>Transportation misconduct<\/li>\n<li>Academic misconduct<\/li>\n<li>Off-campus misconduct<\/li>\n<\/ol>\n<p>**Explained in extensive detail in the full document.<\/p>\n<h3>Reporting Violations<\/h3>\n<p><span>All students are expected to promptly report violations of the Code of Conduct, including DASA violations, to school personnel. <\/span><\/p>\n<p><span> <\/span><span>All students are expected to report incidents of other students or staff being harassed or discriminated against to school personnel.  All District staff observing or learning of possible incidents of harassment or discrimination must take immediate and appropriate action to report the incident to the administration and must take prompt and effective steps calculated to end the harassment or discrimination and to prevent the conduct from recurring. <\/span><\/p>\n<p><span> <\/span><span>Any act of retaliation against a person who reports, investigates, or participates in the review of a complaint of harassment or discrimination is strictly prohibited and is subject to disciplinary action. <\/span><\/p>\n<p>All District staff who are authorized to impose disciplinary sanctions are expected to do so in a prompt, fair and lawful manner.<\/p>\n<p>The Building Principal or his or her designee must notify the appropriate local authority of code violations that constitute a crime and substantially affect the order or security of a school as soon as practical.<\/p>\n<h3>Disciplinary Consequences, Procedures and Referrals<\/h3>\n<p><span>Disciplinary action, when necessary, will be firm, fair and consistent so as to be the most effective in changing student behavior.  As a rule, discipline will be progressive. <\/span><\/p>\n<p><span>School personnel may also utilize the District’s Positive Behavior Intervention and Supports (PBIS) program. PBIS is based on three key expectations: Be Safe, Be <\/span><span>Respectful, and Be Responsible.  Student discipline and support practices will be implemented to balance restorative practices and traditional consequences. <\/span><\/p>\n<p><span>In determining the appropriate disciplinary action, school personnel authorized to impose penalties will consider the student’s age; the nature of the offense and the circumstances which led to it; the student’s prior disciplinary record; the effectiveness of other forms of discipline; information from parents, teachers and\/or others, as appropriate; as well as other extenuating circumstances. <\/span><\/p>\n<p>Corporal punishment of any student by any District employee for the purpose of punishing that student is expressly forbidden. In unique situations, reasonable physical force may be used to:<\/p>\n<ul>\n<li>Protect oneself, or any person from physical injury<\/li>\n<li>Protect the property of the school or others<\/li>\n<li>Restrain or remove a student whose behavior interferes with safety and orderly operation of the school, if the student has refused to refrain from further disruptive acts<\/li>\n<\/ul>\n<p>Students who are found to have violated the District’s Code of Conduct may be subject to the following consequences, either alone or in combinatio<\/p>\n<h3>Potential Disciplinary Consequences<\/h3>\n<ul>\n<li>Oral and written warnings<\/li>\n<li>Written notification to parent\/guardian<\/li>\n<li>Detention (except at elementary)<\/li>\n<li>Suspension from transportation<\/li>\n<li>Suspension from social\/extra-curricular activities<\/li>\n<li>Suspension from athletic participation<\/li>\n<li>Suspension of other privileges<\/li>\n<li>In-school suspension, or similar as designated by an administrator<\/li>\n<li>Removal from class &#8211; A teacher may remove a student from the classroom due to inappropriate behavior, and follow-up with principal or designee.<\/li>\n<li>Short- or long-term suspension from school<\/li>\n<li>Permanent suspension from school<\/li>\n<\/ul>\n<h3>Discipline of Students with Disabilities<\/h3>\n<p><span>This code of conduct affords students with disabilities certain procedural protections whenever school authorities intend to impose discipline upon them.  These procedures are consistent with the safeguards required by applicable laws and regulations. <\/span><\/p>\n<h3>Student Searches and Interrogations<\/h3>\n<p><span>Any school official authorized to impose a disciplinary consequence on a student may question a student about an alleged violation of law or the District Code of Conduct.  <\/span><span>School officials are not required to contact a student&#8217;s parent before questioning the student. <\/span><\/p>\n<p><span> <\/span><span>In addition, the Board of Education authorizes the Superintendent or their designee, Building Principals or their designee, the school nurse and District security officials to <\/span><span>conduct searches of students, their vehicles, and their belongings if the authorized school official has reasonable suspicion to believe that the search will result in evidence that the student violated the law or the District Code of Conduct.  The search may include conducting a field test.<\/span><\/p>\n<h3>Visitors to the Schools<\/h3>\n<p>The building principal or their designee is responsible for all persons in the building and on the grounds. For these reasons, the following rules apply to visitors to the schools:<\/p>\n<ol style=\"list-style-type: upper-alpha;\">\n<li>Anyone who is not a regular staff member or a student at the school will be considered a visitor.<\/li>\n<li>All employees in school buildings will wear their SSCSD ID badges.<\/li>\n<li>All visitors to the school must report to the main office or designated area upon arrival at the school. All visitors must present photo identification which will be screened by our visitor management system. Each visitor will be required to sign the visitor’s register and will be issued a visitor’s identification badge, which must be worn at all times while in the school or on school grounds. The visitor must sign out at the main office or designated area before leaving the building.<\/li>\n<li>Visitors attending school functions that are open to the public, such as parent-teacher organization meetings or public gatherings, are not required to register, but are required to remain in the location of the activity.<\/li>\n<li>Parents or citizens who wish to visit a classroom while school is in session are required to arrange such visits in advance with the classroom teacher(s) and will be permitted at the discretion of the Building Principal or designee in order to keep class disruption to a minimum.<\/li>\n<li>Teachers are not expected to take class time to discuss individual matters with visitors.<\/li>\n<li> Any unauthorized person on school property will be reported to the Principal or their designee. Unauthorized persons will be asked to leave. The police may be called if the situation warrants.<\/li>\n<li>All visitors are expected to abide by the rules for public conduct on school property contained in this Code of Conduct.<\/li>\n<li>No students will leave school before the end of the school day unless signed out in the office as per school procedures.<\/li>\n<li>Administrative permission must be granted to meet with a student during the school day or at school sponsored events.<\/li>\n<li>Visitors who are volunteers must have a completed and approved application form, including contact information and references, on file in the building’s main office prior to volunteering. A volunteer shall be defined as a person willing to donate their time and skills to assist school personnel in the implementation of various programs and activities within the District.<\/li>\n<\/ol>\n<p>All persons on school property or attending a school function shall conduct themselves in a respectful and orderly manner. In addition, all persons on school property or attending a school function are expected to be properly attired. Prohibited conduct, consequences and enforcement are specified in the code of conduct document.<\/p>\n<h3>Dissemination and Review<\/h3>\n<p><em>This summary document is included in all student handbooks and the Code of Conduct Summary Document is distributed to all parents. It is reviewed and updated as necessary each year. The complete Code of Conduct, which has been approved by the Saratoga Springs City School District Board of Education, is available online and in every school building for parent and community review. Any questions or clarifications may be requested from School District and building administrators. The complete Code of Conduct can be accessed on the District website (<a href=\"http:\/\/www.saratogaschools.org\">www.saratogaschools.org<\/a>). A link to<\/em><br \/>\n<em>a translation tool is also available on our website<\/em><\/p>\n<h2>Attendance Policy<br \/>\nPlain Language Summary<\/h2>\n<p>Education law and Board of Education policy requires that every child attaining the age of six and through the age of sixteen attend school during regular school hours for a minimum of 180 days per year unless excluded by provisions of the law as described below. The attendance policy is built on the belief that regular attendance increases student achievement, reduces drop-out levels and develops positive attitudes toward school and learning.<\/p>\n<p>Parents\/guardians are required to provide a written excuse within a two-week period of the absence, indicating the reasons for any absence, tardiness, or leaving school early. Parents are asked to call the attendance office of the school whenever a child is going to be absent. Parents are contacted by the attendance office if a child is absent, and the school has not received prior notice by the parent\/guardian.<\/p>\n<p><span>Excused absences include tardiness, and early departure from class or school due to:<\/span><\/p>\n<ul>\n<li>personal illness<\/li>\n<li>serious illness or death in the family<\/li>\n<li>religious observance or education during school hours with a signed written request<\/li>\n<li>required court appearances of the student<\/li>\n<li>required medical appointments of the student<\/li>\n<li>approved college visits of the student<\/li>\n<li>military obligations of the student<\/li>\n<li>school sponsored activities<\/li>\n<\/ul>\n<p>At the discretion of the Superintendent, a student may be granted a maximum number of excused absences so that the student has the opportunity to spend time with their parent or legal guardian who is about to be deployed, returning for a mid-deployment break or being discharged from military service.<\/p>\n<p>All other absences, tardies and early dismissals are considered unexcused and illegal. Examples are:<\/p>\n<ul>\n<li>truancy<\/li>\n<li>family vacations<\/li>\n<li>babysitting<\/li>\n<li>work during school hours<\/li>\n<li>hunting, fishing, oversleeping, missing the bus, etc.<\/li>\n<li>no parent\/guardian written note for an otherwise excusable absence<\/li>\n<li>accompanying a parent\/guardian on an appointment<\/li>\n<\/ul>\n<p>When a student has a planned unexcused absence of 11 or more consecutive school days, parents must fill out and submit an Individualized Home Instruction Plan (IHIP) to the Office of Curriculum, Instruction, and Assessment.<\/p>\n<p>Administrative procedures ensure that student attendance is monitored on a regular basis; that there are systems in place to acknowledge a student’s efforts to maintain or improve school attendance: and that there are means to monitor and communicate attendance records with parents\/guardians and agencies, as appropriate.<\/p>\n<p>Students are expected to attend all scheduled classes and are held accountable for work missed due to absence, whether the absence is excused or unexcused. If a student is truant, appropriate consequences will be imposed. Attendance is taken daily in grades K-12.<\/p>\n<p>Continuous monitoring will be conducted to identify students who are absent, tardy, or leave class or school early. A student will be considered chronically absent if they miss ten percent or more of the school year. Satisfactory attendance is missing five percent or less of school over the course of the year. If a pattern of attendance concerns for an individual student is identified, a designated staff person(s) will follow-up in accordance with Policy 5100 Student Attendance.<\/p>\n<h3>Attendance Incentives, Sanctions, and Interventions<\/h3>\n<p>The district will design and implement systems to acknowledge a student’s efforts to maintain or improve school attendance. This includes, but is not limited to, the following actions:<\/p>\n<ul>\n<li>At all grade levels, improving the school climate through student feedback in order to provide a safe, supportive school environment and engage students in school.<\/li>\n<li>At all grade levels, actively engaging students, and families in school determining systematic barriers to school attendance and developing solutions to remove those barriers.<\/li>\n<\/ul>\n<h2>Harassment<\/h2>\n<p>It is the policy of the Saratoga Springs City School District that harassment and discrimination based upon actual or perceived race, color, creed, religion, national origin, sex, gender, sexual orientation, disability or other legally protected category is unacceptable conduct and will not be tolerated. This is in keeping with efforts to establish an environment in which the dignity and worth of each member of the school community is respected. The goal of the district is to provide a community in which all students and staff are accepted and judged as individuals.<\/p>\n<p><strong>Sexual harassment<\/strong> of any member of the school community by an individual is prohibited on school property or in connection with school-related activities. The Board recognizes that sexual harassment can be committed by a person of either sex against a person of either the same or opposite sex, and by peers as well as supervisors. The Board strongly condemns all forms of sexual harassment and is committed to safeguarding the right of each student to learn in an environment that is free from sexual harassment.<\/p>\n<p><strong>Harassment<\/strong> includes offensive epithets or slurs, derogatory jokes, graffiti, and other offensive verbal or non-verbal conduct related to an individual’s race, color, religion, national origin, real or perceived sexual orientation, or disability when:<\/p>\n<p>Such conduct has the purpose or effect of unreasonably interfering with an individual’s academic performance, or creating an intimidating, hostile, or offensive environment in the classroom, or other school-related forum.<\/p>\n<h3>Complaint Processing<\/h3>\n<p>In accordance with the federal No Child Left Behind Act of 2001, parents and guardians have the right to request specific information about the professional qualifications of their children&#8217;s classroom teachers. As a parent\/guardian of a student in the Saratoga Springs City School District, you have the right to request the following information:<\/p>\n<h2>Parental Right to Request and Review Information Regarding Teacher Qualifications<\/h2>\n<p>In accordance with the federal No Child Left Behind Act of 2001, parents and guardians have the right to request specific information about the professional qualifications of their children&#8217;s classroom teachers. As a parent\/guardian of a student in the Saratoga Springs City School District, you have the right to request the following information:<\/p>\n<ul>\n<li>If the teacher has met New York State qualifications and licensing criteria for the grade levels and subject areas he or she teaches.<\/li>\n<li>Whether the teacher is teaching under emergency or other provisional status through which the state qualification or licensing criteria have been waived.<\/li>\n<li>The teacher&#8217;s college major: whether the teacher has any advanced degrees and, if so, the subject of the degrees; and<\/li>\n<li>If your child is provided services by any instructional aides or similar paraprofessionals provide services to your child and, if they do, their qualifications.<\/li>\n<\/ul>\n<p>Requests for information about the qualifications of your child’s teacher(s) can be directed to the Building Principal, at 518- 587-4551, extension 12005. All requests will be honored in a timely manner. Thank you for your continued support and interest in your child&#8217;s education.<\/p>\n<h2>Student Privacy<\/h2>\n<p>The Board recognizes its responsibility to enact policies that protect student privacy, in accordance with law. This is particularly relevant in the context of the administration of surveys that collect personal information, the disclosure of personal information for marketing purposes and in conducting physical exams.<\/p>\n<p> <strong>Surveys <\/strong><\/p>\n<p>The Board of Education recognizes that student surveys are a valuable tool in determining student needs for educational services. In accordance with law and Board policy, parental consent is required for minors to take part in surveys which gather any of the following information:<\/p>\n<ol>\n<li>political affiliations or beliefs of the student or the student&#8217;s parent;<\/li>\n<li>mental or psychological problems of the student or the student&#8217;s family;<\/li>\n<li>sex behavior or attitudes;<\/li>\n<li>illegal, anti-social, self-incriminating or demeaning behavior;<\/li>\n<li>critical appraisals of other individuals with whom respondents have close family relationships;<\/li>\n<li>legally recognized privileged or analogous relationships, such as those of lawyers, physicians and ministers;<\/li>\n<li>religious practices, affiliations or beliefs of the student, the student&#8217;s parent or<\/li>\n<li>income (other than that required by law to determine eligibility for participation in a program or for receiving financial assistance under such program).<\/li>\n<\/ol>\n<p>In the event that the district plans to survey students to gather information included in the list above, the district will obtain written consent from the parent\/guardian in advance of administering the survey. The notification\/consent form will also apprise the parent\/guardian of their right to inspect the survey prior to their child’s participation.<\/p>\n<p> <strong>Marketing<\/strong><\/p>\n<p>It is the policy of the Board not to collect, disclose, or use personal information gathered from students for the purpose of marketing or selling that information or providing it to others for that purpose. This does not apply to the collection, disclosure, or use of personal information collected from students for the exclusive purpose of developing, evaluating, or providing educational products or services for, or to students or educational institutions such as:<\/p>\n<ol>\n<li>College or other postsecondary education recruitment, or military recruitment;<\/li>\n<li>Book clubs, magazines and programs providing access to low-cost literary products;<\/li>\n<li>Curriculum and instructional materials used in schools;<\/li>\n<li>Tests and assessments used to provide cognitive, evaluative, diagnostic, clinical, aptitude, or achievement information for students or to generate other statistically useful data for the purpose of securing such tests and assessments, and the subsequent analysis and public release of the aggregate data from such tests and assessments;<\/li>\n<li>Student recognition programs; and<\/li>\n<li>The sale by students of products or services to raise funds for school-related activities.<\/li>\n<\/ol>\n<p>In the event that such data is collected by the district, disclosure or use of student personal information will be protected by the district pursuant to the requirements of the Family Educational Rights and Privacy act (FERPA). [For guidance regarding the disclosure of “directory information,” rather than personal information, see policy 5500, Student Records.]<\/p>\n<p> <strong>Inspection of Instructional Material<\/strong><\/p>\n<p>Parents\/Guardians shall have the right to inspect, upon request, any instructional material used as part of the educational curriculum for students. Instructional content is defined as that information provided to a student, regardless of format, including printed or representational materials, audio-visual materials, and materials in electronic or digital formats. It does not include tests or academic assessments in advance of administration of such assessments.<\/p>\n<p>A parent\/guardian who wishes to inspect and review such instructional material shall submit a request in writing to the Building Principal. Arrangements shall be made to provide access to such material within a reasonable time after the request has been received.<\/p>\n<p><strong> Invasive Physical Examinations<\/strong><\/p>\n<p> Parents\/Guardians have the right to submit a written statement to opt their child out of participation in the administration of any non-emergency, invasive physical examination or screening that is required as a condition of attendance, administered by the school not necessary to protect the immediate health or safety of the student or other students and not otherwise permitted or required by state law. <u>Hearing, vision and scoliosis screenings are not subject to prior notification.<\/u><\/p>\n<h4>Notification<\/h4>\n<p><span>Parents\/guardians and eligible students shall be notified at least annually, at the beginning of the school year, and when enrolling students for the first time in district schools of this policy. The School District shall also notify parents\/guardians within a reasonable period after any substantive change to this policy.<\/span><\/p>\n<h3>Data Protection Policies<\/h3>\n<p>Parent\/guardians and students should also be aware that the Board of Education has specific policies concerning the care and protection of student data by the District and third-party vendors the District contracts with for services. Such policies include Information and Data Privacy Security, Breach, and Notification (Policy 8635).<\/p>\n<h2>Rights Under the Family Educational Rights and Privacy Act (FERPA)<\/h2>\n<p>This is to advise you of your rights with respect to student records pursuant to the Family Educational Rights and Privacy Act (FERPA). FERPA is a federal law designed to protect the privacy of student records. The law gives parents and students over 18 years of age (referred to in the law as “eligible students”) the following rights:<\/p>\n<ol>\n<li>\n<p>The right to inspect and review the student’s education records within 45 days of the day the district receives a request for access. Parents or eligible students should submit to the Building Principal a written request that identifies the records they wish to inspect. The Principal will make arrangements for access and notify the parent or eligible student of the time and place where the records may be inspected.<\/p>\n<p>2. The right to request the amendment of the student’s education records that the parent or eligible student believes are inaccurate or misleading. Parents or eligible students may ask the district to amend a record that they believe is inaccurate or misleading by writing the Principal, clearly identifying the part of the record they want changed and specifying why it is inaccurate or misleading. Please note that the amendment procedure may not be used to challenge a grade, an opinion, or a substantive decision made by the School District about a student.<\/p>\n<p>If the District decides not to amend the record as requested by the parent or eligible student, the district will notify the parent or eligible student of the decision and advise them of their right to a hearing regarding the request for amendment. Additional information regarding the hearing procedures will be provided to the parent or eligible student when notified of the right to a hearin<\/p>\n<p>3. The right to consent to disclosures of personally identifiable information contained in the student’s education records, except to the extent that FERPA authorizes disclosure without consent. There is an exception to FERPA’s prohibition against non-consensual disclosure of personally identifiable information from education records, pursuant to which the district may disclose personally identifiable information from education records without consent.<\/p>\n<p>One exception which permits disclosure without consent is disclosure to “school officials” with legitimate educational interests. A school official is a person employed by the district as an administrator, supervisor, instructor, or support staff member (including health or medical staff and law enforcement unit personnel); a person serving on the school board; a person or company with whom the district has contracted to perform a special task (such as an attorney, auditor, medical consultant, or therapist); or a parent or student serving on an official committee, such as a disciplinary or grievance committee, or assisting another school official in performing their tasks. With respect to what constitutes a ‘legitimate education interest’, it is generally accepted that a school official generally has a legitimate education interest if the official needs to review an education record in order to fulfill their professional responsibility.<\/p>\n<p>\nA student\/parent who believes there has been a violation of the provisions of FERPA may file a complaint with the Family Policy Compliance Office, U.S. Department of Education, 400 Maryland Avenue, S.W., Washington, DC 20202-5920. Complaints must contain specific allegations of fact giving reasonable cause to believe that a violation of FERPA has occurred. More information regarding the complaint process is available at the U.S. Department of Education’s website at <a href=\"https:\/\/studentprivacy.ed.gov\/file-a-complaint\" rel=\"nofollow noreferrer\" title=\"Link to FERPA complaint information\">https:\/\/studentprivacy.ed.gov\/file-a-complaint<\/a>.<\/li>\n<\/ol>\n<h3>Notification<\/h3>\n<p>The Federal Family Educational Rights and Privacy Act (FERPA) generally protects “student records” from disclosure. FERPA allows schools to disclose, without parental consent, certain “directory information” such as a student’s name, address, telephone number, date and place of birth, participation in athletics, honors, awards, and photographs, unless parents have advised to the contrary.<\/p>\n<p>The primary purpose of the “directory information” exception to FERPA is to allow Saratoga Springs City School District (SSCSD) to include this type of information in school publications such as newsletters, calendars, the School District website, ParentSquare and social media outlets. In addition, it allows for the publicity of student accomplishments or specific educational programs to the electronic (television) and print (newspaper) media.<\/p>\n<p>\nSSCSD has designated and historically released the following directory information:<\/p>\n<ul>\n<li>Student’s name<\/li>\n<li>Address<\/li>\n<li>Telephone listing<\/li>\n<li>Electronic mail address<\/li>\n<li>Photograph<\/li>\n<li>Date and place of birth<\/li>\n<li>Major field of study<\/li>\n<li>Dates of attendance<\/li>\n<li>Grade level<\/li>\n<li>Participation<\/li>\n<li>Weight and height of members of athletic teams<\/li>\n<li>Degrees, honors, and awards received<\/li>\n<li>The most recent educational agency or institution attendance<\/li>\n<\/ul>\n<p>Parents not wishing directory information about their child to be used in either district publications, released to the media or on the district website must fill out the FERPA online opt-out form. This form must be filed <strong>annually<\/strong> in September. <a href=\"https:\/\/forms.office.com\/r\/ZReH9NNz0D\">Click here to fill out the FERPA opt-out form<\/a>.<\/p>\n<h2>Administrative Regulation<\/h2>\n<p>School Volunteers<\/p>\n<p>The Board of Education of the Saratoga Springs City School District recognizes that community involvement is an important component of the District’s mission and essential to the success of its academic and extracurricular programs. In an effort to bring community resources into our schools, while ensuring the welfare and safety of all students, faculty staff and community members, the District has adopted this policy with regard to the volunteerism of parents\/guardians and other community members for the following purposes:<\/p>\n<ul>\n<li>To encourage community volunteerism in a manner that will increase the resources available to the District’s students.<\/li>\n<li>To expand community understandings of the District’s goals and programs.<\/li>\n<li>To establish a framework which allows the work of volunteers to be tracked,<br \/>\nmonitored and\/or appropriately supervised within the District.<\/li>\n<\/ul>\n<p><span>For further information please see the complete policy available on the District’s website and contact the main office of the building you wish to volunteer for to get further guidelines.<\/span><\/p>\n<h2>School Lunch<\/h2>\n<p><strong>Meal Prices<\/strong><\/p>\n<p>For the 2025-2026 school year, as per the Community Eligibility Provision (CEP), your first breakfast and lunch orders are free. If you order a second meal or additional milk, cafeteria prices are as follows: breakfast is $2.00 ES, $2.25 MS, $2.50 HS. Lunch is $3.00 ES, $3.25 MS, $3.50 HS, and milk is $.75 (Prices are subject to change). There will be a charge for any ala cart snacks or extra items.<\/p>\n<p>Families should complete the <strong><u>Household Income Eligibility Form<\/u><\/strong><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Delivery of Student Meals      <\/strong><\/h3>\n<p>Buildings <strong><u>will not<\/u><\/strong> be receiving student meals delivered by third party entities, including, but not limited to Door Dash, Grub Hub, etc.  The practice has become disruptive to instructional time, adds concerns about food safety, and increases concerns with building security.  Thank you for your understanding and cooperation.<strong>              <\/strong><\/p>\n<p><strong> <\/strong><strong>Policy 8505: Charging School Meals and Prohibition Against Shaming<\/strong><\/p>\n<p>All schools in the district participate in the Community Eligibility Provision, option of the USDA’s Food and Nutrition Services. This allows the district to provide free meals to all students in the district. Each student receives one meal per day per program (E.G., BREAKFAST, LUNCH). If students wish to purchase additional meals of other food items, they must pay for those items at the time of the sale. The district does not permit charging to accounts for such “a la carte” items if students do not have funds available.<\/p>\n<p>No student with unpaid charges will be prohibited from purchasing food if they have money that day. If school food authorities (SFAs) suspect that a student may be abusing this policy, written notice will be provided to the parent\/guardian.<\/p>\n<p>Students who cannot pay for a meal or who have unpaid meal debt shall not be publicly identified or stigmatized (including wristbands or hand stamps), required to do chores or work to pay for meals, or have meals thrown away after they have been served. District staff shall not discuss a student&#8217;s unpaid meal debt in front of other students. The district shall not take any action directed at a student to collect unpaid school meal fees.<\/p>\n<p>The district&#8217;s payment system allows for automatic replenishment when a balance reaches a certain amount set by the parent\/guardian, The district shall encourage parents\/guardians to utilize this option.<\/p>\n<p>Parents\/guardians shall be discreetly notified of student account balances regularly. This notification will continue regularly until the account is replenished, Parents\/guardians must repay all unpaid charges remaining at the end of the year or before their child leaves the district, whichever occurs first.<\/p>\n<p>The school district shall notify all parents\/guardians in writing on an annual basis at the start of the school year and to families transferring during the year, outlining the requirements of this policy. The policy shall also be published in appropriate school and district publications.  All staff involved in implementing and enforcing this policy shall also be notified of these requirements and their responsibilities.<\/p>\n<p>Unpaid meal charges are a financial burden to the district and taxpayers and can negatively affect the school program. Unpaid meal charges shall be considered &#8220;delinquent&#8221; as per the district&#8217;s accounting practices. The district shall attempt to recover unpaid meal charges before the end of the school year but may continue efforts into the next school year. The district shall notify parents\/guardians of unpaid meal charges at regular intervals, and may engage in collection activities by district staff, which do not involve debt collectors as defined in federal law (15 USC {1692a) and may not charge fees or interest or file a lawsuit against students&#8217; parents or guardians. The district shall offer repayment plans and may take other actions that do not result in harm or shame to the child, until unpaid charges are paid.<\/p>\n<p>The remaining funds may be carried over to the next school year. When students leave the district or graduate, the district will attempt to contact the parent\/guardian to return the remaining funds. Parents\/guardians may request that funds be transferred to other students<\/p>\n<p>(e.g., siblings, unpaid accounts). All transfer requests must be in writing. Unclaimed funds remaining after 6 years shall be absorbed by the school meal account.<\/p>\n<p>Building Principals, working with the head of food services, shall ensure that all district and food service staff with responsibilities under this policy will be trained on the provisions of this policy and the requirements of Education Law section 908. Staff members are allowed to purchase food from the district&#8217;s food services. However, all purchases must be paid for at the point of sale, cash, payment account.<\/p>\n<p>Staff members are not allowed to charge meals to be repaid later.<\/p>\n<p>Please refer to the Board of Education Policy 8520: Free and Reduced-Price Meal Services and Policy 5405: Student Wellness for more information. All District Policies are located in the <strong><u>Policy Manual.<\/u><\/strong><strong>                                 <\/strong><\/p>\n<h3><strong>Summary of BOE Policy 5405: Student Wellness<\/strong><\/h3>\n<p>This policy establishes a comprehensive framework to promote student health and wellness through nutrition, physical activity, and education within the school environment. It aims to support lifelong healthy habits and reduce childhood obesity by setting standards for food offerings, physical education, and wellness activities.<\/p>\n<ul>\n<li><strong> Nutrition standards for school foods<\/strong>: All foods and beverages sold or provided during the school day must meet or exceed federal nutrition guidelines, emphasizing fruits, vegetables, whole grains, and low-fat options while ensuring reasonable portion sizes. The district encourages local sourcing and provides free drinking water where meals are served.<\/li>\n<li><strong>Meal scheduling and environment<\/strong>: Lunchtimes are scheduled within normal hours with adequate time allowed for eating to support healthy eating habits.<\/li>\n<li><strong>Regulation of competitive foods and fundraisers<\/strong>: Foods sold outside of meals, including vending and fundraisers, must comply with nutrition standards. Non-food fundraisersand activities are promoted, and off-campus fundraisers are encouraged to follow these guidelines.<\/li>\n<\/ul>\n<ul>\n<li><strong>Guidelines for celebrations and marketing<\/strong>: School celebrations involving food should promote healthy options and non-food activities, while marketing of foods on school grounds during the school day must meet federal nutrition standards. This applies to all school property and promotional materials.<\/li>\n<li><strong>Physical education requirements<\/strong>: Students engage in physical education according to state mandates, incorporating enjoyable activities that can be sustained lifelong. Physical activity cannot be withheld as punishment.<\/li>\n<li><strong>Recess and classroom activity<\/strong>: Elementary students receive daily recess, which is not used as reward or punishment, preferably held outdoors. Physical activity is also integrated into classroom instruction to enhance learning and meet physical education requirements.<\/li>\n<li><strong>Extracurricular physical activities<\/strong>: The district promotes a variety of physical activity clubs and encourages safe walking or biking to school. Eligibility requirements for activities do not restrict access to physical activity opportunities.<\/li>\n<li><strong> Monitoring, review, and community involvement<\/strong>: The Food Service Director oversees policy implementation and reports every three years. The district conducts periodic assessments of nutrition, physical activity, and wellness education, involving parents, staff, and students through advisory committees and public communications to ensure ongoing improvement.<\/li>\n<\/ul>\n<h3><strong>STUDENTS AND PERSONAL ELECTRONIC DEVICES<\/strong><\/h3>\n<p>BOE Policy 5695 prohibits student use of internet-enabled devices during the school day (including all classes, homeroom periods, lunch, recess, study halls, and passing time) on school grounds (any building, structure, athletic playing field, playground, or land contained within the boundary of a school or district or BOCES facility), unless under an exception (e.g., IEP\/Section 504).<\/p>\n<p>Such devices include “internet-enabled devices” defined as: any smartphone, tablet, smartwatch. or other device capable of connecting to the internet and enabling the user to access content on the internet, including social media applications, but do not include any such device suppled by the district for educational purposes. Other personal electronic devices includes devices which are capable of connecting to the internet, either directly or indirectly, and access content on the internet, fitness trackers, wired or wireless headphones and earbuds, e-readers, voice recorders, cameras and music devices.<\/p>\n<ul>\n<li>At the elementary level, students are discouraged from bringing devices to school. Any device that is brought to school must be silenced and kept in their assigned personal cubby.<\/li>\n<li>At the middle and high school level, student devices must be silenced and stored in their assigned student locker.<\/li>\n<li>Parents\/guardians may contact their children by calling their child’s assigned administrator’s office. Students may contact their parents\/guardians by requesting to use the nearest administrator’s office phone.<\/li>\n<li>The district is not responsible for lost, stolen, or damaged personal electronic devices brought to school.<\/li>\n<li>Enforcement of this policy is the responsibility of building administrative staff; however, all employees will participate in enforcement. Students will be reminded of this policy regularly and consistently, especially at the start of the school year and after returning from breaks.<\/li>\n<li>For students out of compliance with this policy, the adult who sees the device will confiscate it and the device will be held in the school office until the end of the school day.<\/li>\n<\/ul>\n<ul><\/ul>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>The first time this happens, the student may retrieve the device, and the parent will be notified. &#8211; For subsequent instances, the parent must retrieve the device.<\/li>\n<li>Further instances will result in the device being held in the school office daily for longer periods of time. The district will exercise reasonable care to maintain the security of devices that are held by the district but cannot guarantee the devices will be secure.<\/li>\n<li>For students with exceptions under this policy, the district will examine alternative ways to achieve the purpose of the exception, including different storage or access provisions<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<ol><\/ol>\n<ul>\n<li>Reference BOE Policy 5695 for more information.<\/li>\n<\/ul>\n<h2>Saratoga Springs City School District Transportation Mission Statement and Procedures<\/h2>\n<h3>Transportation Purpose and Objective<\/h3>\n<p>Pupil transportation is a necessary service and an integral part of the total educational program. The major objectives of the pupil transportation program are to provide safe transportation, operate an efficient and economical transportation system, adapt transportation to the requirements of the instructional program, and maintain conditions on the buses which are conducive to the best interest of students.<\/p>\n<h3>Philosophy<\/h3>\n<p><span>The school bus is considered an extension of the school; therefore, the safety and welfare of all pupils riding school buses is a major responsibility of the School District. Bus discipline, in order to be effective, must be a cooperative effort involving the transportation department, administrators, parents and pupils.<\/span><\/p>\n<h3>Roles\/Responsibilities<\/h3>\n<ul>\n<li>Transportation personnel will receive orientation on a regularly scheduled basis regarding general discipline, pupil behavior, pupil rights, bus rules and disciplinary procedures.<\/li>\n<li>Bus drivers, teachers and administrators will be responsible for orienting pupils on a regularly scheduled basis regarding bus behavior.<\/li>\n<li>Pupils will be under the authority and supervision of the bus driver while on the bus and will be expected to adhere to directions at all times.<\/li>\n<li>Bus expectations will be published and distributed to parents\/guardians, pupils and bus drivers, and they will be posted on every bus.<\/li>\n<li>Pupils who are disorderly and insubordinate will be subject to disciplinary actions.<\/li>\n<li>Disciplinary action for misbehavior will be the responsibility of building administrators in collaboration with the Director of Transportation (or their designee).<\/li>\n<li>Disciplinary action will be reasonable and administered in a progressive manner with pupil’s rights to due process guaranteed.<\/li>\n<li>The principal or Director of Transportation (or their designee) will be responsible for notifying parents\/guardians of disciplinary action resulting from bus referrals in order to obtain their support and cooperation.<\/li>\n<\/ul>\n<h3>Unauthorized Entry on School Buses<\/h3>\n<p>For safety and security reasons, unauthorized persons are not allowed to board or ride a school bus at any time, unless prior approval has been received from the transportation department. This includes parents\/guardians, daycare providers, siblings and underage children.<\/p>\n<h3>Student RFID (Radio-frequency identification) Cards<\/h3>\n<p><span>Students are issued RFID Cards that are used for attendance and accountability purposes on school buses. When the student boards and leaves the school bus, they are required to scan their card on the card reader in the bus. This will verify that the student has boarded or left the school bus, as well as display on the driver’s Mobile Data Terminal and at the transportation dispatch office. The following pertains to the use of RFID Cards:<\/span><\/p>\n<ol>\n<li>Students are required to use their RFID Card when boarding and leaving the bus each day. The bus driver will remind students of this requirement if they fail to use their card.<\/li>\n<li> If a student repetitively fails to scan their card when entering\/exiting the bus, or consistently loses their card, drivers may submit written discipline referrals.<\/li>\n<li>3. If a student has not received an RFID Card, they should let their building principal know immediately so they can order one for the student. All initial cards are free of charge. For lost or missing RFID cards, parents and\/or students will need to order a replacement card on the district’s website by going to “Family Links &amp; Resources” and then scrolling down to “Student ID Replacement.<\/li>\n<\/ol>\n<h3>Reporting School Bus Incidents\/Concerns<\/h3>\n<ol>\n<li>If the incident\/concern specifically relates to the bus driver or bus driver assistant, please call the Transportation Department at (518) 587-4545 (inform receptionist).<\/li>\n<li>If the incident\/concern is student discipline related and on the school bus:\n<ol>\n<li>The first step is to inform the driver, who will take the appropriate steps<br \/>\nto address the concern.<\/li>\n<li>If this does not resolve the problem, inform your building team.<\/li>\n<\/ol>\n<\/li>\n<li>If the concern involves bus routing or bus stops, please email the Transportation Routing Office at <a href=\"mailto:routing@saratogaschools.org\">routing@saratogaschools.org<\/a><\/li>\n<li>Any other bus concerns may be directed to the Bus Dispatch Office at (518) 693-1316.<\/li>\n<\/ol>\n<h3>Bus Behavior Expectations<\/h3>\n<p>Students should always conduct themselves in a manner consistent with established standards for classroom behavior in accordance with the Code of Conduct.<\/p>\n<p>Inappropriate student behavior can cause the driver to become distracted, which can increase the chances of the bus being involved in an accident.<\/p>\n<p>The following “Bus Behavior Expectations” are posted in each school bus:<\/p>\n<ul>\n<li>Be Safe, Be Respectful, Be Responsible<\/li>\n<li>Follow driver instructions the first time<\/li>\n<li>Remain seated in your assigned seat at all times<\/li>\n<li>Keep aisle, windows &amp; emergency exits clear<\/li>\n<li>Use an inside voice at all times. (Level 1-2)<\/li>\n<li>Keep body parts\/objects to yourself<\/li>\n<li>Treat others with respect at all times<\/li>\n<li>No tobacco products or illegal substances<\/li>\n<li>No eating\/drinking &amp; keep your bus clean<\/li>\n<li>No hazardous items or fragrances allowed<\/li>\n<li>No profanity or rude behavior<\/li>\n<li>No photos, videos or laser pointers allowed<\/li>\n<\/ul>\n<p>Violations of the rules above may result in the following consequences:<\/p>\n<ul>\n<li>Warning<\/li>\n<li>Assigned seat<\/li>\n<li>Parent phone call<\/li>\n<li>Discipline Referrals<\/li>\n<li>Bus Suspension<\/li>\n<li>Restitution for damages to the school bus<\/li>\n<\/ul>\n<p>Parents\/guardians may request a transportation conference if a bus suspension is assigned. Transportation conferences may also be utilized for students accumulating 10 bus referrals and 20 days of bus suspension during a school year.<\/p>\n<h3>Transportation Changes<\/h3>\n<p><span>Student transportation is scheduled to and from the student&#8217;s primary residence. If transportation is needed to a different location on a regular basis for daycare or joint custody purposes, the parent\/guardian must complete a Transportation Change Form.<\/span><\/p>\n<ol>\n<li>Transportation Change Forms must be renewed on a yearly basis by June 1st for the following school year. Forms received after August 15th will not be processed until after the first week of school. For changes during the school year, submit as soon as possible.<\/li>\n<li>Only students in grades K – 8 are eligible for transportation changes for daycare purposes.<\/li>\n<li>Transportation is available to accredited daycare centers within the School District boundaries. If your elementary school children will be attending private or homebased daycare, that location must be within the boundaries of the elementary school in which they attend.<\/li>\n<li>Requests will be approved on an annual basis as long as seating is available on<br \/>\nestablished bus routes. Additional buses will not be added to accommodate transportation change requests.<\/li>\n<li>Students are not allowed to ride a different bus for social functions, jobs (including babysitting), scouting, religious activities or any other non-approved activity as determined by the building principal.<\/li>\n<li>Students who are not eligible for transportation are not permitted to ride home with a friend for an afterschool activity.<\/li>\n<li>In the event of an emergency and your child needs to ride a different bus or get off at a different stop on the same bus, please send a note to the school with your child. The note must then be approved by the school office. If an emergency occurs during the day, please contact your child’s school office as soon as possible to arrange for alternate transportation.<\/li>\n<li><span> <\/span><span>Transportation Change Requests: Parent\/guardian completes and submits the electronic “Transportation Change Request” form on the school district website.  Assistance with this process can also be found at the Transportation Department, the Registrar’s office or each of the District’s six elementary school offices.  Upon receiving an approval\/denial from the Transportation Department, the Transportation Department notifies the parent\/guardian of the decision.  Elementary Schools are also notified by the Transportation Department and are provided updated bus schedule information.  Requests received after August 15th may not be honored until after school begins. <\/span><\/li>\n<\/ol>\n<h3>Bus Schedule Information<\/h3>\n<p><span>The Traversa My Ride K-12 mobile app and website provides secure access to “real time” student transportation information, student ID card scans, current bus location <\/span><span>and estimated arrival time at the bus stop.  Instructions to access Traversa MY Ride K-12 can be found on the Transportation Webpage on the district website.<\/span><\/p>\n<p>Students should be at their bus stop 5 minutes before the bus is scheduled to arrive in the morning.<\/p>\n<p>If you have bus routing questions, please email the routing office at:<br \/>\n<a href=\"mailto:routing@saratogaschools.org\">routing@saratogaschools.org<\/a>.<\/p>\n<h3>Assigned Seating on School Buses<\/h3>\n<p>The School District reserves the right to assign student seating on school buses for safety, efficiency and disciplinary reasons. In addition, assigned seating is required on all middle school and elementary buses and may be assigned on middle and high school buses if needed for behavioral issues. Drivers should have assigned seats in place by early October after considering grade level, compatibility, behaviors, siblings, friends etc. Assigned seats are also subject to change at any time during the school year.<\/p>\n<h3>Dangerous Substances<\/h3>\n<p>D.O.T. regulations prohibit aerosol cans, glass containers and flammable substances inside the passenger compartment of school buses. Therefore, students shall not carry these items on school buses at any time. Perfumes and colognes shall not be discharged on school buses because they can cause an adverse allergic reaction with some individuals.<\/p>\n<h3>Food and Beverages on School Buses<\/h3>\n<p>New York State Education Department regulations prohibit eating or drinking on the bus. The reason for this regulation is due to the danger of a child choking when eating on a school bus and due to students, who have food allergies. So, please remember, no eating or drinking on the bus at any time.<\/p>\n<h3>Transporting Large Items on School Buses<\/h3>\n<p>For the safety of all occupants being transported on district school buses, the following guidelines have been established to provide information on the size of items that students may transport on school buses.<\/p>\n<ul>\n<li>Objects smaller than 36 inches (length) by 12 inches (width) by 8 inches (depth) can be transported on school buses. These items must be kept on the student&#8217;s lap or on the floor between their legs. They must not obstruct the center aisle of the bus or be placed in a seat alongside a student, especially if another student needs to sit there.<\/li>\n<li>Objects that can obstruct or impair the vision of the driver are prohibited.<\/li>\n<li>Hockey and lacrosse sticks are allowed to be transported on the bus but must be stored behind the driver&#8217;s seat.<\/li>\n<li>Any items that are larger than the sizes listed above must be transported by other means, or arrangements may be made to store the items in the school. This includes large athletic equipment bags, skis, ski poles, sleds, skateboards, bicycles and fishing poles.<\/li>\n<\/ul>\n<p>This policy is designed to provide the safest environment for all occupants riding on our school buses. If you have questions regarding this policy, please contact the Transportation Department at (518) 587-4545.<\/p>\n<h3>Use of Personal Electronic Devices on School Buses<\/h3>\n<p>Improper use of electronics on the school bus can cause a distraction to the driver and may be detrimental to the safety and well-being of other students and bus drivers. Therefore, the following guidelines are provided in accordance with the district&#8217;s Code of Conduct policy.<\/p>\n<ol>\n<li>Cell phones and other electronic communication devices shall not be used to bully, discriminate, threaten, harass or denigrate other students or school personnel.<\/li>\n<li>Devices may not be used while boarding\/discharging or crossing, and during emergency situations or school bus safety drills unless authorized by the driver.<\/li>\n<li>Video\/audio recordings and pictures are not allowed to be taken by students riding District buses.<\/li>\n<li>Laser pointers and other objects that can obstruct or impair the vision of the driver are not allowed to be used on school buses at any time.<\/li>\n<li>iPods, tablets or other similar electronic devices may be used on school buses only if equipped with headphones and the volume is maintained at a level that does not disrupt the driver or other students.<\/li>\n<li>Headphones must be used when listening to music, playing games or viewing content on devices. For student safety reasons headphones must be removed when entering\/exiting the bus or crossing at bus stops.<\/li>\n<li>Any devices that are being used inappropriately may be confiscated by bus drivers and returned to the students when they depart the bus. If a student continues to use their device inappropriately, a discipline referral may be submitted, and the device may be confiscated and returned only to a parent\/guardian.<\/li>\n<li>The School District will not be held responsible for the loss or theft of any personal electronic device.<\/li>\n<\/ol>\n<p>Failure to follow these and any bus rules may result in disciplinary action in accordance with the Code of Conduct.<\/p>\n<h3>Late Buses<\/h3>\n<p><span>Late buses operate from the High School and Middle School on a schedule set by each school.  The following are the guidelines for late runs: <\/span><span> <\/span><\/p>\n<ul>\n<li><span>Students are required to submit a late run pass to the bus driver as well as scan their school provided ID card upon boarding the bus. The pass must be signed by a teacher and approved by the school’s office. <\/span><\/li>\n<li><span>Late run route zone maps are available on the School District’s website. <\/span><\/li>\n<li><span> <\/span><span>As there are only a limited number of buses for each school, ride times will vary depending on the number of students riding on a given day. The drivers adjust their routing daily in order to minimize ride times; however, ride times will be longer on days when there are many students riding.  You may contact the transportation dispatch office at (518)693-1316 after the departure time of the late runs for an approximate arrival time for your student. <\/span><\/li>\n<li><span> <\/span><span>Students will be dropped off as close as possible to their regularly assigned bus stops only and are not allowed to be dropped off at places of employment, social events or other activities. <\/span><\/li>\n<li><span> <\/span><span>Students will not be allowed to ride to the YMCA unless they are enrolled in a <\/span>YMCA sanctioned after-school program.<\/li>\n<\/ul>\n<h2>Pathways<\/h2>\n<p>“To prepare today’s learners for future success.”<\/p>\n<h3>Vision Statement<\/h3>\n<p>The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future.<\/p>\n<p>Our vision is rooted in the following four core beliefs:<\/p>\n<h4>Equity of Opportunity<\/h4>\n<p>Overcoming barriers to equity, all learners will have the support they need intellectually, creatively, and socially.<\/p>\n<p>District targets:<\/p>\n<ol>\n<li>Champion efforts to foster and facilitate growth in becoming a culturally competent school district with respect for all.<\/li>\n<li>Promote access and opportunity for all students, exemplified by parity in student participation and performance across all subgroups.<\/li>\n<\/ol>\n<h4>Collaboration<\/h4>\n<p>Working cooperatively, our culture of learning will motivate all to be innovative, productive, creative and inquisitive.<\/p>\n<p>District targets:<\/p>\n<ol>\n<li>Cultivate shared leadership through purposeful interactions, data-driven decisions, and a focus on improved student learning within Professional Learning Communities.<\/li>\n<li>Expand project-based learning, multi-disciplinary programming, and technology across K-12 learning environments.<\/li>\n<\/ol>\n<h4>Community<\/h4>\n<p>Providing opportunities at all schools for families, community, and business to be active partners in supporting learner success.<\/p>\n<p>District targets:<\/p>\n<ol>\n<li>Strengthen the SSCSD community through family outreach and community partnerships.<\/li>\n<li>Utilize proactive communications strategies with all stakeholders.<\/li>\n<\/ol>\n<h4>Personalization<\/h4>\n<p>Teaching and learning will meet the individual needs of all learners, developing meaningful connections to support personal growth.<\/p>\n<p>District targets:<\/p>\n<ol>\n<li>Develop student ownership of their learning, personal goal setting, and career exploration.<\/li>\n<li>Engage learners in relevant, flexible and innovative learning experiences that adapt to meet individual needs.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>Vision The vision of Maple Avenue Middle School is that students are confident, dynamic citizens capable of collaboration in our ever-changing world.  Our students approach new experiences with kindness, curiosity, and open minds.  They effectively express their unique ideas, demonstrate their skills and engage others with empathy and respect, forging their paths to joy and &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Maple Avenue Student Handbook&#8221;<\/span><\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":100,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-1123","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Maple Avenue Student Handbook - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Maple Avenue Student Handbook - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Vision The vision of Maple Avenue Middle School is that students are confident, dynamic citizens capable of collaboration in our ever-changing world.  Our students approach new experiences with kindness, curiosity, and open minds.  They effectively express their unique ideas, demonstrate their skills and engage others with empathy and respect, forging their paths to joy and &hellip; Continue reading &quot;Maple Avenue Student Handbook&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-08-21T18:12:28+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"91 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\",\"url\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\",\"name\":\"Maple Avenue Student Handbook - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-02-28T18:50:23+00:00\",\"dateModified\":\"2025-08-21T18:12:28+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Maple Avenue Middle School\",\"item\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"About the Middle School\",\"item\":\"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Maple Avenue Student Handbook\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Maple Avenue Student Handbook - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/","og_locale":"en_US","og_type":"article","og_title":"Maple Avenue Student Handbook - Saratoga City School District","og_description":"Vision The vision of Maple Avenue Middle School is that students are confident, dynamic citizens capable of collaboration in our ever-changing world.  Our students approach new experiences with kindness, curiosity, and open minds.  They effectively express their unique ideas, demonstrate their skills and engage others with empathy and respect, forging their paths to joy and &hellip; Continue reading \"Maple Avenue Student Handbook\"","og_url":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-08-21T18:12:28+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"91 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/","url":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/","name":"Maple Avenue Student Handbook - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-02-28T18:50:23+00:00","dateModified":"2025-08-21T18:12:28+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/student-handbook\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Maple Avenue Middle School","item":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/"},{"@type":"ListItem","position":3,"name":"About the Middle School","item":"https:\/\/www.saratogaschools.org\/maple-avenue-middle-school\/about-the-middle-school\/"},{"@type":"ListItem","position":4,"name":"Maple Avenue Student Handbook"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/1123","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=1123"}],"version-history":[{"count":23,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/1123\/revisions"}],"predecessor-version":[{"id":11076,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/1123\/revisions\/11076"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/100"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=1123"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}