{"id":34,"date":"2021-09-23T12:39:44","date_gmt":"2021-09-23T16:39:44","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=34"},"modified":"2024-10-30T10:32:56","modified_gmt":"2024-10-30T14:32:56","slug":"athletics-code-of-conduct","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/","title":{"rendered":"Athletics Code of Conduct"},"content":{"rendered":"<p><a id=\"top-page\"><\/a><a href=\"#Overview\">Overview<\/a> | <a href=\"#ConductRules\">Conduct Rules and Violations<\/a> | <a href=\"#TrainRules\">Training Rules and Violations<\/a> | <a href=\"#NYSPHSAA\">NYSPHSAA Section II Policy for Spectators and Athletes<\/a> | <a href=\"#Suburban\">Suburban Scholastic Council: Sportsmanship Code<\/a> | <a href=\"#Interscholastic\">Interscholastic Health and Safety Information<\/a> | <a href=\"#Modified\">Modified Program<\/a> | <a href=\"#APP\">Athletic Placement Process<\/a> | <a href=\"#ScheduleGalaxy\">About ScheduleGalaxy<\/a><\/p>\n<h2><a id=\"Overview\"><\/a>Overview<\/h2>\n<p>Student-athletes represent themselves, their teams and the Saratoga Springs School District at all times – whether on the field, in the classroom, in the  community or away at events. As such, student-athletes should always project a positive image which the community and school district would be proud of. All student-athletes are bound by the Athletic Code of Conduct, which will earn them the honor and respect that participation and competition in interscholastic athletics affords. Participation in extracurricular activities, including sports, is a privilege and not a right. Any unsportsmanlike and\/or inappropriate conduct which reflects unfavorably on the school, the team or the student-athlete will not be tolerated.<\/p>\n<p>The Athletic Code of Conduct is in addition to, and does not replace, the Student Code of Conduct. Any discipline imposed under the Athletic Code of Conduct does not preclude additional discipline or consequences under the Student Code of Conduct.<\/p>\n<p><strong>To the Parent\/Guardian:<\/strong> This material is presented to you because your child has indicated a desire to participate in the interscholastic athletic program at Saratoga Springs High School. While participation in interscholastic athletics provides a wealth of opportunities and experiences which assist students in personal development, it must be recognized that involvement in interscholastic athletics is a privilege and not a right. All student-athletes who elect to participate are voluntarily making a choice of self-discipline and commitment. The health, safety and welfare of your son or daughter is the District’s first priority and guides the conditions that the Athletic Code of Conduct requires. <\/p>\n<p><strong>To the Student-Athlete:<\/strong> As a participant in the interscholastic athletic program at Saratoga Springs High School, you are expected to act responsibly and to follow established rules. By participating in interscholastic athletics to the best of your ability, you make a positive contribution to the reputation of the District and the community.<\/p>\n<p>Your health and safety, including your mental and physical well-being, is the school’s first priority. To ensure that, it is important that all student-athletes adhere to the established rules found in the Athletic Code of Conduct. The District expects the help and co-operation of all student-athletes in upholding the standards of appropriate behavior set forth in the Athletic Code of Conduct. Therefore, the District asks all student-athletes to be an active part of the solution, not to be part of a problem. Your active support and participation in following the rules set forth in the Athletic Code of Conduct throughout your time at Saratoga Springs High School will benefit the experience you will have.<\/p>\n<p><strong>Full Year Policy:<\/strong> The rules governing the Athletic Code of Conduct apply to all student-athletes in the Saratoga Springs City School District throughout the entire calendar year, at school-sponsored and non-school-sponsored activities, whether on or off school grounds, on and off the field, in and out of uniform and whether or not the student-athlete’s particular sport or activity is in season. The District is entrusted to educate and teach our students and to maintain clear and consistent boundaries for them. Out of season violations reported will be investigated and consequences for violations will be faced prior to future interscholastic athletic involvement. Rules are in effect all year.<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h2><a id=\"ConductRules\"><\/a>Conduct Rules for our Student-Athletes<\/h2>\n<p><strong>On the Field:<\/strong> In the area of athletic competition, a student- athlete should not use profanity or illegal tactics, and should understand that losing is part of the game and that a student-athlete should be gracious in defeat and modest in victory. It is always courteous to congratulate the opponent on a well-played game after the contest, whether in defeat or victory. Winning or losing is not as important as your reaction to winning or losing. Your reaction is what people will remember &#8211; not the score. Disrespectful comments, the use of foul language, or insubordination by a student-athlete directed toward any other person, including but not limited to game officials, coaches, advisors, teammates, athletes or members of opposing teams or schools, fans or spectators, or any other persons will subject the student-athlete to appropriate consequences.<\/p>\n<p><strong>Suspensions from school:<\/strong> When a student-athlete is suspended out of school for any reason they cannot attend practice, tryouts, a school function\/or contest or be a spectator at a contest. If the suspension occurs during the tryout period, the student-athlete may be given an opportunity to tryout upon their return to school from the suspension. Depending on the seriousness and the circumstances of the behavior resulting in the external suspension, a more severe penalty up to and including removal from all interscholastic competitions may be imposed.<\/p>\n<p><strong>Off campus\/community:<\/strong> A student-athlete of Saratoga Springs High School represents our school at all times. The student-athletes involvement in inappropriate behavior both previously defined or implied, when not in school, would necessitate an investigation.<\/p>\n<p><strong>In School\/On Campus:<\/strong> In the academic area, a student-athlete becomes a good student. A student-athlete must plan their schedule so that sufficient time and energy is devoted to their studies to insure acceptable grades. In addition, student-athletes must carry, at a minimum, a full academic schedule as determined by the District and the New York State Public High School Athletic Association (NYSPHSAA). A “full academic schedule” means at least three (3) subjects as well as meeting the physical education requirement. A student-athlete must maintain a passing average in physical education at all times.<\/p>\n<p><b><span data-contrast=\"none\">High School Student-Athlete Academic Eligibility Requirements:<\/span><\/b><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">To participate in interscholastic athletics a student-athlete must meet the following requirements:<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">A student must attend school to be eligible to participate. All student-athletes must be in school by 10:45am with a legal excuse to be eligible to participate in interscholastic athletics that afternoon. After 10:45am, regardless of the excuse the student is ineligible to participate in interscholastic athletics.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">A student must be passing all courses, including physical education classes, (incompletes are not passing grades). Students must maintain a full academic schedule as determined by the District and the New York State Public High School Athletic Association.   <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">A student intending to graduate within the current school year must be passing all courses necessary for graduation. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">A passing grade is 65% or better.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><b><span data-contrast=\"none\">Penalties<\/span><\/b><span data-contrast=\"none\">:<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">A student who does not meet the eligibility requirements is on academic probation:<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<ol>\n<li><span data-contrast=\"none\">A. If a student is failing one (1) class, that student may practice with his\/her team but cannot participate in any scrimmage or athletic <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"><\/span><\/li>\n<li><span data-contrast=\"none\"> If a student is failing two (2+) or more classes, that student may not practice or compete in any scrimmages or athletic contest.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"><\/span><\/li>\n<li><span data-contrast=\"none\"> Students could also lose senior privileges such as late arrival, early dismissal, and parking privileges. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"><\/span><\/li>\n<\/ol>\n<p><span data-contrast=\"none\">Students will have two weeks to attend after-school extra help sessions with their teachers.  It is the student&#8217;s responsibility to arrange for extra help during extra support time or flex time.  The student must have their <\/span><a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/s\/SSCSD-Website-Files\/Ee6dYiA8XzFKnh61gjr-U8sB4X-PR2GPwIUPJOka2qxjAA?e=jDoyCe\"><span data-contrast=\"none\">academic progress report<\/span><\/a><span data-contrast=\"none\"> signed by their teacher confirming their attendance at the extra help sessions.  Without the academic progress report, the student will not be allowed to practice or play that day. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">Once the student has achieved a 65% or better for each course, they will be removed from academic probation.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><span data-contrast=\"none\">If a student is placed on probation and is still failing one class but his\/her grades do not improve after the two-week intervention. Then the student continues to be ineligible and cannot attend practices or contests until his\/her grades improve to 65% or higher.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/p>\n<p><a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/s\/SSCSD-Website-Files\/Ee6dYiA8XzFKnh61gjr-U8sB4X-PR2GPwIUPJOka2qxjAA?e=jDoyCe\"><span data-contrast=\"none\">Student-Athlete Academic Progress Report<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;335559738&quot;:0,&quot;335559739&quot;:270}\"> <\/span><\/a><\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h3>Conduct Rule Violations<\/h3>\n<p>Acts of unacceptable conduct, such as, but not limited to theft, vandalism, disrespect, or violations of law, tarnish the reputation of everyone associated with the program and will not be tolerated. In the event that a student-athlete is arrested for a criminal offense, the student-athlete may be suspended from participation in interscholastic athletics both in practice and\/or competition. Depending on the seriousness and the circumstances resulting in the arrest, a more severe penalty up to and including removal from all interscholastic competitions may be imposed.<\/p>\n<p><strong>Hazing:<\/strong> Hazing is strictly prohibited. No hazing activities will be tolerated under any circumstances. Members of the School District community will not participate or be involved in hazing activities. Any member of the School District community confirmed to have been involved in such activity will be subject to disciplinary action for violation of this policy.<\/p>\n<p>The term “hazing”, as used in this Code of Conduct, means any conduct or methods of initiation into any student organization, whether on public or private property, before, during or after school hours, which willfully or recklessly endangers the physical or mental health of any student or other person, or which is reasonably likely to cause harassment, intimidation, physical, emotional or psychological harm, including embarrassment or loss of human dignity, to another person.<\/p>\n<p>Such conduct shall include, but not be limited to the following:<\/p>\n<ul>\n<li>Any humiliating or dangerous activity expected of a student to join a group, regardless of the student’s willingness to participate (conduct has the potential to endanger the mental or physical health or safety of a student.) Any hurtful, aggressive, destructive or disruptive behavior such as, but not limited to, striking, stripping, sleep deprivation, confinement in a restricted area, calisthenics or other activity that subjects the student to risk of harm or that adversely affects the mental or physical health or safety of the student.<\/li>\n<li>Any use or abuse of tobacco, alcohol, drugs or other substances that subjects the student to a risk of harm or that adversely affects the mental or physical health or safety of that student.<\/li>\n<li>Any activity that intimidates or threatens the student with ostracism; subjects a student to mental stress, embarrassment, shame or humiliation; or adversely affects the mental health or dignity of the student or group of students.<\/li>\n<li>Any activity that causes or requires the student to perform a task that involves violation of state or federal law or of school district policies and regulations.<\/li>\n<\/ul>\n<p>Consent of the victim of hazing will not be available as a defense to any prosecution of hazing under this Code of Conduct. Whoever knows that another person is the victim of hazing and is at the scene of such hazing shall, to the extent that the person can do so without danger or peril to himself\/herself or others, report such activity to an appropriate official as soon as reasonably possible. Any person who knowingly and unreasonably fails to report hazing activity shall be guilty as an accomplice in such activity. Employees who fail to report an incident of hazing may be subject to disciplinary action.<\/p>\n<p><strong>Bullying\/Harassment:<\/strong> Acts of harassment and bullying are strictly prohibited. No bullying\/harassment activities will be tolerated under any circumstances. Members of the School District community will not participate or be involved in bullying\/harassment activities. Any member of the School District community confirmed to have been involved in such activity will be subject to disciplinary action for violation of this policy.<\/p>\n<p>The term “Bullying”, as used in this Code of Conduct, means the creation of a hostile environment by conduct or by threats, intimidation or abuse, including cyberbullying (as defined below), that (a) has or would have the effect of unreasonably and substantially interfering with a student&#8217;s educational performance, opportunities or benefits, or mental, emotional or physical well-being; or (b) reasonably causes or would reasonably be expected to cause a student to fear for his or her physical safety; or (c) reasonably causes or would reasonably be expected to cause physical injury or emotional harm to a student; or (d) occurs off school property and creates or would foreseeably create a risk of substantial disruption within the school environment, where it is foreseeable that the conduct, threats, intimidation or abuse might reach school property, or impact, or reasonably be expected to impact the student’s attendance and\/or participation in school activities.<\/p>\n<p>The term “Harassment”, as used in this Code of Conduct, means the creation of a hostile environment by conduct or by verbal threats, intimidation or abuse that has or would have the effect of unreasonably and substantially interfering with a student’s educational performance, opportunities or benefits, or mental, emotional or physical well-being; or conduct, verbal threats, intimidation or abuse that reasonably causes or would reasonably be expected to cause a student to fear for his or her physical safety.<\/p>\n<p>Acts of harassment and bullying may include, but not be limited to conduct, verbal threats, intimidation or abuse based on a person&#8217;s actual or perceived race, color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, gender or sex. For the purposes of this definition the term “threats, intimidation or abuse” shall include verbal and non-verbal actions.<\/p>\n<p><strong>Cyberbullying:<\/strong> Harassment or bullying (of students and\/or staff) as defined above, where such harassment or bullying occurs through any form of electronic communication.<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h3><a id=\"Violations\"><\/a>Consequences for Conduct Rule Violations<\/h3>\n<p>Conduct rule violations may vary from suspension, benching, probation, appropriate intervention, to removal from team. The Athletic Director will impose a penalty to reflect the seriousness and circumstances of the offense. A review of the student’s record of athletic conduct and\/or training rules violations will be considered when establishing a penalty. These penalties will be served in addition to any penalties assessed under the District’s Student Code of Conduct.<\/p>\n<h2><a id=\"TrainRules\"><\/a>Training Rules for our Student-Athletes<\/h2>\n<p>First and foremost, Persons under the age of 21 years may not consume, possess, or be under the influence of alcohol. The use of alcohol by anyone under the age of 21 years of age is against the law.<\/p>\n<p>A person under the age of 21 violates the New York State Penal Law, if that person attempts to purchase, or is found in possession of alcohol.<\/p>\n<p>Marijuana is an illegal drug, punishable by criminal arrest and prosecution.<\/p>\n<p>The message to all student-athletes is loud and clear and should be understood by all stakeholders – “NO USE!”<\/p>\n<ul>\n<li>No hosting or attending of underage parties where consumption of alcohol,<br \/>\ndrugs and\/or controlled substances are used<\/li>\n<li>No consumption or possession of tobacco including but not limited to<br \/>\ncigarettes, cigars, and chewing tobacco.<\/li>\n<li>No consumption or possession of electronic cigarettes or vapor products.<\/li>\n<li>No consumption or possession of alcoholic beverages<\/li>\n<li>No consumption or possession of illegal drugs or mood altering substances<\/li>\n<li>No consumption or possession of performance enhancing drugs<\/li>\n<\/ul>\n<p>Rules are in effect all year.<\/p>\n<p><strong>Hosting of drinking\/drug parties:<\/strong> It is unacceptable behavior for any student-athlete to host an underage party that involves the consumption of any alcohol, drugs, and\/or other controlled substances. The student-athlete will be subject to an investigation. If such investigation finds a violation to have occurred disciplinary action will be taken, including suspension or expulsion from interscholastic athletic activities for up to one calendar year.<\/p>\n<p><strong>Parties\/presence at parties with drugs\/alcohol:<\/strong> If a student-athlete attends a party where alcohol or drugs are being illegally dispensed, the student-athlete must IMMEDIATELY leave the party and report his or her attendance to a coach or administrator within twenty four hours (leaving a detailed voice mail or e-mail is considered a report). Following these procedures exactly exonerates the innocent student-athlete assuming that the student-athlete is not frequently showing up at these parties or that there is no corroborative information to indicate otherwise. However, a student-athlete failing to report attendance will be judged to have been in possession or guilty by presence. It is the attendance at such gatherings which is prohibited by this rule. Actual consumption of alcohol or use of drugs is not a prerequisite to establish a violation of this rule. Any student-athlete who is found to have voluntarily remained in the vicinity of a gathering prohibited by this section will be guilty of a violation of this rule<\/p>\n<p><strong>Use of Tobacco\/Nicotine\/Smoking:<\/strong> The possession and\/or use of tobacco or tobacco related products by a student-athlete at any time is strictly prohibited. Tobacco and\/or tobacco related products are defined as any cigarette, cigar, pipe, bidi, clove cigarette, and any other smoking product, as well as spit tobacco, dip, chew, and snuff, and any other spit tobacco  product in any form. This policy also prohibits a student from coming to school or an extra-curricular or an interscholastic event or other school sponsored activities, on or off campus, after the student has smoked a tobacco related product or used  a spit tobacco related product or is in possession of tobacco related product or a spit tobacco related product. This policy is in effect throughout the calendar year, whether school is in session or not, and whether the sport in which the athlete takes part is in season or not regardless of age.<\/p>\n<p><strong>Use of Electronic Cigarettes\/Vapor Products:<\/strong> The possession and\/or use of electronic cigarettes or vapor products by a student-athlete at any time is strictly prohibited. This policy also prohibits a student from coming to school or an extra-curricular and interscholastic event or other school sponsored  activities, on or off campus, after the student has smoked electronic cigarettes or vapor products or is in possession of electronic cigarettes or vapor products. This policy is in effect throughout the calendar year, whether school is in session or not, and whether the sport in which the athlete takes part is in season or not regardless of age.<\/p>\n<p><strong>Use of Alcoholic Beverages:<\/strong> The possession and\/or use of alcoholic beverages by anyone under the age of 21 years of age is against the law. Therefore, the possession and\/or use of alcoholic beverages at any time by a  student-athlete is strictly prohibited. This policy also prohibits a student from coming to school or an extra-curricular or an interscholastic event or other school sponsored activities, on or off campus, after the student has consumed an alcoholic beverage or is in possession of an alcoholic beverage. If a student-athlete is found to be in possession of an alcoholic beverage at school or a at a school related event, the student-athlete will be disciplined under the District’s Student Code of Conduct, as well as disciplined under the District’s Athletic Code of Conduct, which will include suspension or expulsion from interscholastic athletic activities. This policy is in effect throughout the calendar year, whether school is in session or not, and whether the sport in which the athlete takes part is in season or not.<\/p>\n<p><strong>Use of Illegal Drugs:<\/strong> The possession and\/or use of illegal drugs is against the law. Therefore, the possession and\/or use of illegal drugs at any time by a student-athlete is strictly prohibited. This policy also prohibits a student from coming to school or an extra-curricular or an interscholastic event or other school sponsored activities, on or off campus, after the student has used an illegal drug or is in possession of an illegal drug. If a student-athlete is found to be in possession of illegal drugs at school or a school related event, the police will be called and the student-athlete will be subject to arrest, disciplined under the District’s Student Code of Conduct, as well as disciplined under the District’s Athletic Code of Conduct, which will include suspension or expulsion from interscholastic athletic activities. This policy is in effect throughout the calendar year, whether school is in session or not, and whether the sport in which the athlete takes part is in season or not.<\/p>\n<p><strong>Performance Enhancing Drugs\/Supplements:<\/strong> A nutritional ergogenic aid is defined as any foodstuff or dietary procedure that either improves or is thought to improve physical performance. Although these compounds are easily available, they are unregulated and many either pose potential health compromising threats or dangers. The use of suspected or advertised ergogenic aids, including but not limited to Creatine or other nutritional supplements may be detrimental to a student-athlete’s health. Due to the serious and potentially fatal effects of anabolic\/androgenic steroids and their related compounds, including hormone pre-cursors, the use of these products is strictly prohibited. It is also illegal to possess or distribute these products without medical documentation.<\/p>\n<p>The use of all anabolic steroids, diuretics and peptide hormones and analogues (HCG, ACTH and HGH) is to be avoided. The use of these drugs without a doctor approved prescription and unsupervised administration represents a great risk to the student-athlete’s health and welfare. Possession of many of these drugs is a felony and holds the same legal penalties as possession of cocaine. In addition to the illegal use of these controlled substances, student-athletes should be aware  that the use of the many “Pro-hormones” and Hormone Pre-Cursors that are legal and available without a prescription may also have significant health consequences and may cause the users to test positive for anabolic steroids. The heath related effects of such substances can be lethal or permanently debilitating.<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h3>Consequences for Training Rule Violations<\/h3>\n<p>Consequences for training rule violations follow a three tiered consequence framework with the understanding that the severity of the consequences may be increased by the Athletic Director. The following penalties should not be construed as a promise or guarantee of any particular form of discipline, as the District retains the right to impose discipline under this policy which it deems appropriate under the individual circumstances of each case. These penalties will be served in addition to any penalties assessed under the District’s Student Code of Conduct.<\/p>\n<p><strong>The primary goals of these options are to:<\/strong><\/p>\n<ul>\n<li>place ownership of these violations with the student-athlete;<\/li>\n<li>offer a process for change in behavior;<\/li>\n<li>attempt to draw in the parents to participate in this process, and<\/li>\n<li>give the student-athlete every possible opportunity to rectify such behaviors.<\/li>\n<\/ul>\n<p><strong>First Offense:<\/strong> When a student-athlete violates a training rule they will receive a suspension from games based upon the game suspension formula (to be determined by season or the duration of the activity). The student-athlete must meet with our Student Advocate\/School Psychologist on at least 2 separate occasions addressing the issues which have resulted in said consequences. Any recommendations or referrals by the Student Advocate\/School Psychologist must be pursued by the student-athlete. Student-athletes must meet with their coaches prior to resumption of participation in contests, competitions or evaluations. During this time, the student may practice but may not dress or compete in any contests.<\/p>\n<p>It is further understood that any training rule code violation that occurs during post-season competition will result in the student-athlete being declared ineligible from competition for the remainder of the season. Consequences may be carried forward to your next season, if your season concludes before serving your entire suspension. If an offense is established while an activity is inactive, the consequence will apply when the activity resumes.<\/p>\n<p><strong>Second Offense:<\/strong> The student-athlete shall receive a one year suspension from all interscholastic athletic activities and a mandatory assessment by the Student Advocate\/School Psychologist as described under first offense. The student-athlete must meet with their coaches and re-sign the Athletic Code of Conduct prior to resumption of participation in competition. During this one year suspension, at the Athletic Director’s discretion the student may practice but will not be allowed to compete in any games or scrimmages.<\/p>\n<p><strong>Third Offense:<\/strong> The third offense triggers full expulsion from interscholastic athletic activities for the rest of the students’ high school career. The student-athlete will be referred for a substance abuse evaluation or counseling to a specific, qualified agency.<\/p>\n<h3>Game Suspension Formula for Training Rule Violations<\/h3>\n<p>The following formula has been developed to define a “game suspension formula” based upon the number of games in a sports season:<\/p>\n<p><strong>Total Games Count by Season\/Length of Suspension<\/strong><\/p>\n<ul>\n<li>0 to 9 games in season = 2 game suspension<\/li>\n<li>10 to 14 games in season = 3 game suspension<\/li>\n<li>15 to 20 games in season = 4 game suspension<\/li>\n<\/ul>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h3>Information that Applies to both Conduct Rules and Training Rules<\/h3>\n<p>Circumstances that require immediate severe consequences: Certain circumstances may require immediate action in determining consequences for an apparent violation. In certain circumstances, the penalties for the code violation may be much more severe and may be applied immediately by the Athletic Director. The violation of the Athletic Code of Conduct is a serious action, but it may be amplified if the violation takes place in certain environments and would tend to support the necessity for an increased severity of penalties and lessening the chances for remedies, even for a first offense. The following situations constitute some but not all of such circumstances: <\/p>\n<ul>\n<li>The use of an illegal substance or alcohol by a student-athlete at school or school events, or during travel to an interscholastic athletic activity or contest. This includes not only school functions at Saratoga Springs High School or Maple Avenue Middle School, but any function the student-athlete attends at other schools as well.<\/li>\n<li>The use of an illegal substance or alcohol by a student-athlete, during training session (even out of season training) in the weight room or other training facilities at Saratoga Springs High School or Maple Avenue Middle School.<\/li>\n<\/ul>\n<p>The final determination of consequences will be made after the investigative process has concluded.<\/p>\n<p><strong>Reporting:<\/strong> Anyone may choose to report a violation of the Athletic Code of Conduct orally or in writing to any of the following individuals:<\/p>\n<ul>\n<li>Building Principal<\/li>\n<li>Assistant Principals<\/li>\n<li>Athletic Director<\/li>\n<li>Teachers<\/li>\n<li>Activity Advisor<\/li>\n<li>Coach<\/li>\n<li>Counselors<\/li>\n<li>Nurses<\/li>\n<\/ul>\n<p>Any District employee who receives a report of a violation must report it to the Principal or the Athletic Director within twenty four hours. An investigation will be initiated to determine the facts surrounding the allegation(s).<\/p>\n<p>Anonymous complaints lacking independent corroboration will generally not form the basis of an investigation.<\/p>\n<p>Appropriate disciplinary action will be taken against any team member, volunteer or coach who retaliates against a person who makes a good faith report of alleged misconduct by a student-athlete.<\/p>\n<p><strong>Self referral:<\/strong> A student-athlete may make a self-referral for a violation of the Athletic Code of Conduct. This self-referral must be made prior to any investigation or reported allegations to the school authorities. Self-referrals should be made to the Principal or Athletic Director.<\/p>\n<p><strong>Investigative process:<\/strong> Suspected violations of the Athletic Code of Conduct will be investigated in accordance with the following general procedures:<\/p>\n<ul>\n<li>The principal, athletic director or coach will interview the student-athlete as to the reason(s) for suspected violations in an effort to confirm or refute the allegation.<\/li>\n<li>The principal, athletic director or coach will notify the parent\/legal guardian of the student-athlete if the interview with the student-athlete confirms or exonerates them of the suspected violation.<\/li>\n<li>The principal or athletic director will further investigate through interviews with those who may be aware of violations first-hand, those who may have limited knowledge of the violations, or those who may be involved with such violations.<\/li>\n<li>Appropriate consequences for the type of violation will be applied and enforced.<\/li>\n<\/ul>\n<p>Cooperation during investigation: In the event that a student-athlete comes under investigation for a possible violation(s) of the Athletic Code of Conduct, it is expected that the student will be truthful, forthcoming with information and cooperative. During the investigation of any alleged student-athlete code violations the student-athlete must be truthful and forthcoming with information or the Principal\/Athletic Director has the authority to impose a greater level of consequence if it is determined that the student-athlete has lied, been deceptive or untruthful prior to or after the determination of guilt and or consequences.<\/p>\n<p><strong>What constitutes confirmation?<\/strong> Confirmation of a violation of the Athletic Code of Conduct may be provided by, but not limited to, any one of the following:<\/p>\n<ul>\n<li>Admission of a code violation by the offending student-athlete.<\/li>\n<li>An abundance of circumstantial evidence with eyewitness support.<\/li>\n<li>An assessment by an advisor, coach, teacher, administrator, school nurse and\/or other school district personnel of signs, symptoms and\/or actions demonstrated by the student-athlete that would support the reasonable conclusion of a code violation with the support of other circumstantial evidence or any eyewitness support.<\/li>\n<li>A credible eyewitness account.<\/li>\n<li>Cyber image evidence<\/li>\n<\/ul>\n<p><strong>Confirmation of violations:<\/strong> Once confirmation of a code violation has been obtained, the student-athlete will be subject to, but not limited by disciplinary actions and consequences. These actions are not intended to replace or affect any additional disciplinary measures of a head coach or advisor. All team rules and consequences which are established by the coach must be in writing and explained prior to the season.<\/p>\n<p><strong>Cyber image evidence:<\/strong> Any identifiable image, photo, video, or posted online conversation which implicates a student-athlete to have been in violation of this Athletic Code of Conduct (including being in possession or in the presence of illegal drugs, illegal alcohol use, performance enhancing drugs, or tobacco use; out of character behavior or crime) shall be confirmation of a violation of the Athletic Code of Conduct. Student-athletes should not put themselves in, or stay in, a situation or environment where they might be accused of violating the Athletic Code of Conduct. Student-athletes should be aware that there may be persons who would attempt to implicate them, by taking such images or placing them in a situation where they might be in violation of this standard.<\/p>\n<p><strong>What constitutes exoneration?<\/strong> Exoneration of a suspected violation of the Athletic Code of Conduct may be provided by, but not limited to, all or any one of the following:<\/p>\n<ul>\n<li>A negative reading for the in-question substance on a medically conducted drug screening or test.<\/li>\n<li>The absence of any credible evidence, either circumstantial or eyewitness accounts, that support the allegation.<\/li>\n<\/ul>\n<p><strong>Appeals process:<\/strong> If it is determined by the Athletic Director that a suspension from interscholastic athletic activities is warranted, the parent\/guardian of the student-athlete and\/or the student-athlete may request a meeting with the Athletic Director to discuss the findings of the investigation. The student-athlete may appeal the decision of the Athletic Director to the Athletic Disciplinary Review Committee. The appeal must be in writing and must be made within twenty four hours of the date of the Athletic Director’s decision. A parent may attend the hearing of the Athletic Disciplinary Review Committee. The Committee will determine the outcome of the case.<\/p>\n<p><strong>Athletic Disciplinary Review Committee:<\/strong> The Athletic Disciplinary Review Committee consists of the following:<\/p>\n<ul>\n<li>Director of Physical Education\/Athletics<\/li>\n<li>High School Principal or designee<\/li>\n<li>Grade Level Assistant Principal where appropriate<\/li>\n<li>Coach involved<\/li>\n<li>School Psychologist\/Student Advocate (optional)<\/li>\n<\/ul>\n<p>The student-athlete may appeal the decision of the Athletic Disciplinary Review Committee to the Superintendent in writing within one calendar week of receipt of the Athletic Disciplinary Review Committee’s determination. During the appeal process, the student-athlete’s suspension will remain in effect. The decision of the Superintendent regarding the appeal will be final.<\/p>\n<p>&#8220;Participation in the Saratoga Springs High School athletic program is a privilege which should elicit great pride in both the student-athlete and the parent\/guardian. Standards of behavior and training are high and a willingness to live up to them is a part of being a member of the team. For this reason each student-athlete must sign this agreement as a personal commitment to their team as well as their teammates, school and community and a willingness to set a positive example and follow proper training practices. Please note that the conditions set forth in this document will be enforced with or without signatures.&#8221;<\/p>\n<p>Adopted by Board of Education 6\/28\/2012<br \/>\nReviewed by Committee 7\/2015<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h2>NYSPHSAA &#8211; Section II Code of Behavior for Spectators<\/h2>\n<ul>\n<li>Spectators are an important part of the games and are encouraged to conform to accepted standards of good sportsmanship and behavior.<\/li>\n<li>Spectators should at all times respect officials, visiting coaches, players, and cheerleaders as guests in the community and extend all courtesies to them.<\/li>\n<li>Enthusiastic cheering for one&#8217;s own team is encouraged.<\/li>\n<li>Booing, whistling, stamping of the feet and disrespectful remarks shall be avoided.<\/li>\n<li>There will be no ringing of bells, sounding of horns, or other noisemakers at indoor contests during play. Anyone who does not abide by this rule will be asked to leave the premises.<\/li>\n<li>Pep bands or school bands, under the supervision of school personnel, may play during time outs, between periods, or at halftime. Bands must coordinate their play so as not to interfere with a cheerleading squad on the floor or field.<\/li>\n<li>The throwing of debris, confetti, or other objects from the stands is prohibited. Offending individuals will be asked to leave the premises.<\/li>\n<li>During a free throw in basketball, all courtesies should be extended.<\/li>\n<li>Spectators should encourage each other to observe courteous behavior. Improper behavior should be reported to the school authorities.<\/li>\n<li>Spectators will observe the rules of the local school concerning smoking, food and drink consumption, littering, and parking procedures.<\/li>\n<li>Spectators will respect and obey all school officials and supervisors at athletic contest.<\/li>\n<\/ul>\n<p>Any inappropriate spectator behavior directed at the coaches, players, spectators and officials will result in disciplinary action including permanent suspension from athletic events.<\/p>\n<h3><a id=\"NYSPHSAA\"><\/a>NYSPHSAA &#8211; Section II Sportsmanship Policy for Athletes<\/h3>\n<ul>\n<li>Learn and understand the rules of your sport. Play hard, play to win, but play fairly within these rules.<\/li>\n<li>Do not allow your temper to distract you from the fundamentals of good sportsmanship. Maintain self-control.<\/li>\n<li>Respect your opponent. Never taunt. Congratulate him or her at game&#8217;s end. Acknowledge good play.<\/li>\n<li>Respect the integrity and judgment of officials. Never question the decision of an official.<\/li>\n<li>Be an example for your school, teammates and opponents.<\/li>\n<\/ul>\n<p>A player who is disqualified from a contest for unsportsmanlike behavior by an official is prohibited from playing in the next regularly scheduled contest.<\/p>\n<p>A player who strikes or otherwise physically assaults an official will be subject to an extended suspension from athletic competition. A physical confrontation with an official is any incident in which a player either strikes, bumps, or otherwise physically intimidates an official prior to, during or after a contest or game.<\/p>\n<h2><a id=\"Suburban\"><\/a>Suburban Scholastic Council: Sportsmanship Code<\/h2>\n<p>In the belief that good sportsmanship on the part of spectators at high school athletic contests is as important as good sportsmanship on the part of athletes, the following guides for conduct are suggested as a means of continuing and strengthening the ties that exist between competing schools.<\/p>\n<p><strong>Basic Philosophy:<\/strong> Visiting team members, students and adult spectators are guests to be accorded all the courtesy and consideration that a friendly, well mannered and well intentioned host would normally give. The visitors, in turn, are to act as invited guests, using the home school&#8217;s facilities with care and respecting the rules and customs of the home school.<\/p>\n<p><strong>It is expected that all spectators and participants will follow this code:<\/strong><\/p>\n<ul>\n<li>Athletic opponents and officials are guests and should be treated as such.<\/li>\n<li>Spectators should watch the game from those areas designated by each school as spectator areas.<\/li>\n<li>Verbal abuse of opposing athletes or officials by team members or spectators shall be considered unsportsmanlike conduct.<\/li>\n<li>It shall be the responsibility of authorized school personnel attending games, either at home or away, to make sure students from their school conduct themselves appropriately.<\/li>\n<li>Officials are the proper authorities to make decisions regarding rules and their interpretation; these decisions should be accepted.<\/li>\n<li>Cheering should be in support of either team and should not be directed toward creating unfriendly rivalries among athletes or fans.<\/li>\n<li>Any spectator who evidences poor sportsmanship will be requested to leave and may be denied admission to future contests.<\/li>\n<li>Spectators, athletes and coaches must recognize that their conduct plays an important role in establishing the reputation of their schools and that their positive actions can relate directly to the success of their teams.<\/li>\n<\/ul>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h2><a id=\"Interscholastic\"><\/a>Interscholastic Athletics: Health and Safety Information<\/h2>\n<p>\n<strong>Interscholastic Permission Form:<\/strong> All Modified, Freshmen, JV and Varsity athletes must fill out and have their parents sign an &#8220;Interscholastic Permission&#8221; Form. It must be reviewed by our School Nurse before they can be approved. They should be completed and returned with all the necessary signatures, to the Nurse&#8217;s Office at the high school in a timely fashion. (Please note that any incomplete forms will have to be returned to the athlete for proper information, thus delaying a student&#8217;s approval for sports by the School Nurse.)<\/p>\n<p>Under no circumstance will a student without a physical examination and interscholastic permission form be permitted to participate in a tryout or practice.<\/p>\n<p><strong>Sports Physicals:<\/strong> Sports physicals will be given and approved by our School Doctor before a student is allowed to begin practice or participate in a game. The sports physical is in force for one calendar year; however, after 30 days a sport physical update form needs to be filled out by the parent and turned in to the nurse for each team you join each season.<\/p>\n<p><strong>Risk Factor in Sports:<\/strong> Participation in sports involves a certain degree of risk for injury. Before going out for the team, we want you to be aware of the risk so you will be better able to reduce your chances for injury. Pre-season conditioning, learning the skills and techniques, and knowledge of rules and safety factors will enable you to have a healthy season.<\/p>\n<p><strong>Injuries:<\/strong> It is extremely important to report any injury to your coach immediately. Medical expenses resulting from any injury must first be submitted to your own insurance carrier and then any remaining balance can be submitted to the School Accident insurance carrier.<\/p>\n<p>Any injured athlete who has seen a doctor, or received treatment at the emergency room, must be released (signed statement) by that doctor in order to resume participation with their team. This medical release must then be submitted to the School Nurse. Student-Athletes may not return to practice until the Athletic Trainer has received such clearance from the School Nurse. This clearance is then submitted to the Athletic Office and coach by the Athletic Trainer.<\/p>\n<p><strong>Note:<\/strong> The school accident insurance provides only excess coverage according to a fee schedule.<\/p>\n<p><strong>Concussion Guidelines and Procedures:<\/strong> Concussions are defined as mild traumatic brain injuries which occur as a result of trauma to the head, jaw or from a violent snapping of the neck. Recovery from concussions is unpredictable and will vary greatly between individuals. Physical and mental rest along with a properly supervised return to play protocols, are necessary to ensure complete recovery.<\/p>\n<p>Any student demonstrating signs and symptoms of a concussion while participating in a school sponsored class, extracurricular activity or interscholastic athletic event shall be removed from the event or activity and be evaluated by the school physician, athletic trainer or school nurse, if possible. In the event that a school health care provider is not available, the district will refer any concussed student to their primary care physician or emergency room, if necessary. Any student returning to school following a concussion diagnosis must have a proper medical release from a physician. However, the chief school physician only will make the final decision with regards to any return to interscholastic athletic activity. Any student who continues to exhibit concussion related signs or symptoms upon return to activity must be removed from participation and re-evaluated by their primary care physician or chief school physician.<\/p>\n<p><strong>Neurocognitive Baseline Testing (Impact):<\/strong> Students who participate in interscholastic athletics may, depending upon the sport, be subject to neurocognitive baseline testing (Impact) prior to the start of their sport season. In the event that a student sustains a concussion, they will be tested again post injury to help determine their cognitive recovery. Post injury testing will only occur after a student’s symptoms have completely resolved and before any return to physical activity is permitted.<\/p>\n<p>Baseline and post injury testing is conducted at the high school by the school’s certified athletic trainer. Baseline testing for certain sports will occur typically during a student’s freshman and junior years’. Interpretation of the test results is done by the Chief\/Associate school physician. Only those students, who demonstrate satisfactory results as determined by the Chief\/Associate school physician, will be allowed to begin the return to play protocol.<\/p>\n<p><strong>Return to Physical Activities:<\/strong> A gradual return to physical activity typically is done by progressing a student through levels of activity that increase in duration and\/or intensity. Gradual return to activity should occur with the introduction of new activity level every 24 hours. If any post-concussion symptoms return, the student should stop the activity and drop back to the previous level of activity. Current research suggests that some level of symptoms with activity is acceptable. Students will be monitored by district staff daily following each progressive level of physical activity, for any return of signs and symptoms of concussion. A gradual progression should be followed based on private healthcare provider’s or other specialist’s orders and recommendations.<\/p>\n<p>After a brief period of initial rest (24–48 hours), symptom-limited activity can be begun while staying below a cognitive and physical exacerbation threshold (stage 1). Once concussion-related symptoms have resolved, the athlete should continue to proceed to the next level if he\/she meets all the criteria (e.g., activity, heart rate, duration of exercise, etc.) without a recurrence of concussion-related symptoms. Generally, each step should take 24 hours, so that athletes would take a minimum of 1 week to proceed through the full rehabilitation protocol once they are asymptomatic at rest. However, the time frame for RTS may vary with player age, history, level of sport, etc., and management must be individualized.<\/p>\n<p>In athletes who experience prolonged symptoms and resultant inactivity, each step may take longer than 24 hours simply because of limitations in physical conditioning and recovery strategies outlined above. This specific issue of the role of symptom limited exercise prescription in the setting of prolonged recovery is discussed in an accompanying systematic review. If any concussion-related symptoms occur during the stepwise approach, the athlete should drop back to the previous asymptomatic level and attempt to progress again after being free of concussion-related symptoms for a further 24-hour period at the lower level.<\/p>\n<p><strong>Graduated Return to Sport Strategy: <\/strong><\/p>\n<ul>\n<li><strong>Step 1:<\/strong> Symptom-limited activity includes daily activities that do not provoke symptoms. Gradual reintroduction of work\/school activities.<\/li>\n<li><strong>Step 2:<\/strong> Light aerobic exercise includes walking or stationary cycling at slow to medium pace. No resistance training. Activities should increase heart rate.<\/li>\n<li><strong>Step 3:<\/strong> Sport-specific exercise which could include running or skating drills. No head impact activities. Add movement.<\/li>\n<li><strong>Step 4:<\/strong> Non-contact training drills which include harder training drills, e.g., passing drills. May start progressive resistance training. Exercise, coordination and increased thinking.<\/li>\n<li><strong>Step 5:<\/strong> Full contact practice. Following medical clearance, participate in normal training activities Restore confidence and assess functional skills by coaching staff<\/li>\n<li><strong>Step 6:<\/strong> Return to sport Normal game play<\/li>\n<\/ul>\n<p><strong>Note:<\/strong> An initial period of 24–48 hours of both relative physical rest and cognitive rest is recommended before beginning the RTS progression. There should be at least 24 hours (or longer) for each step of the progression. If any symptoms worsen during exercise, the athlete should go back to the previous step. Resistance training should be added only in the later stages (stage 3 or 4 at the earliest). If symptoms are persistent (e.g., more than 10–14 days in adults or more than 1 month in children) the athlete should be referred to a health care professional who is an expert in the management of concussions.<\/p>\n<p>If our district personnel have concerns or questions about the private healthcare provider’s orders, the district medical director or his\/her designee should contact that provider to discuss and clarify. The district medical director may develop a return to physical activity protocol for students with concussions whose provider does not provide direction on limitations or needed accommodations. Additionally, the district medical director has the final authority to clear students to participate in or return to extra-class activities (interscholastic athletics or intramurals) in accordance with 8NYCRR 135.4(c)(7)(i).<\/p>\n<p>Students may feel upset about having to limit activities, or having difficulties keeping up in school. Students should be reassured that the situation is most likely temporary, that the goal is to help the student get back to full activity as soon as it is safe, and to avoid activities which will delay their recovery. Students should be informed that the concussion will resolve more quickly when they follow their healthcare provider’s orders as supported by numerous studies. Students will need encouragement and support at home and school until symptoms fully resolve.<\/p>\n<p>When returning to Athletic Activities (interscholastic sports), once the district receives the written clearance from a physician the student will need to be approved to return to Athletic Activities (interscholastic sports) by the medical director, regardless of whether the medical director is a physician or a nurse practitioner.<\/p>\n<p>Vitamins, Pills, Aspirins, Medication: Saratoga interscholastic coaches do not distribute or permit athletes to take vitamins, over the counter medication, prescriptions, aspirins, or others, or the use of such modalities as oxygen, dextrose tablets and &#8220;pep&#8221; pills for the purpose of stimulating students towards greater physical efforts. It will be clearly defined by the coach to the athletes that these types of vitamins\/medications, etc. will be referred to the nurse\/doctor\/parent. Nothing will be taken at practices or games\/meets\/contests.<\/p>\n<p><strong>Note:<\/strong> If a student\/athlete must carry an inhalant (something as a medicine to inhale) at practice\/game(s) he\/she must have a signed note from the doctor and parent to do so. This note\/form must FIRST be presented to the School Nurse in their building. The nurse will notify the coach in writing.<\/p>\n<p><strong>Smoking Policy:<\/strong> Due to the health hazard associated with smoking, and in accordance with federal and state law, the Board of Education prohibits smoking in all areas of the school district property. No person shall use tobacco products of any kind on school grounds, in school building, or where students\/ athletes are playing\/ practicing a contest (i.e., East\/West Side Recreation Field, Ice Rink, Skidmore College, etc.).<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h3>Additional Information Related to Interscholastic Athletics<\/h3>\n<p><strong>Attendance Policy:<\/strong> All student-athletes must adhere to the Saratoga Springs High School Attendance Policy outlined in their Student Handbook, which is issued to all High School students annually. Additionally, student-athletes who have been absent from school for an entire day may not participate in after-school activities. Extenuating circumstances will be given special consideration by the Athletic Director. A student athlete must be in attendance and participate in class for a minimum of two (2) class blocks @ the High School or four (4) periods @ Maple Avenue on the day of a game or practice in order to participate. Repeated tardiness to school may result in the Student-Athlete not participating in after-school or weekend interscholastic sports programs. If a student leaves school ill, that student may be declared ineligible to practice and\/or play in the athletic contest that day. Each individual team has its own regulations concerning daily attendance at practices and the minimum number of practices before being eligible for competition. Your coach will inform you of these rules.<\/p>\n<p><strong>Athletic Transportation:<\/strong> Student-athletes shall be transported to and from all away contests (games and\/or scrimmages) by school authorized vehicles only. There may be times when it becomes necessary for a parent to pick up their son\/daughter after a game. In such cases, parents\/guardians must see the coach at the conclusion of the contest to sign their son\/daughter out on the appropriate Saratoga Springs City School District Transportation Waiver Release Form. In addition, there may be extenuating circumstances when a parent\/guardian requests to have their son\/daughter transported by another adult (non-student) of their choosing. In such cases, the request must be made in writing in advance to the Athletic Director. If approved, the written request will be signed by the Athletic Director and forwarded to the appropriate coach. At no time may students transport themselves or other student-athletes to or from away athletic contests (games and\/or scrimmages).<\/p>\n<p>All team members are expected to conduct themselves in a fashion that will ensure the safety of all passengers. All safety rules must be followed. All regulations are in effect during charter trips<\/p>\n<p><strong>Changing Sports:<\/strong> No student may quit one sport and then participate in another once the teams have been selected. If he\/she has been cut from one team, it is legitimate to try-out for another. All legitimate requests for changing sports must be made through the Athletic Director.<\/p>\n<p><strong>Duration of Competition:<\/strong> A pupil shall be eligible for senior high school athletic competition in a sport during each of four consecutive seasons of such sport commencing with the pupil&#8217;s entry into the ninth grade and prior to graduation. A pupil reaching the age of 19, before July 1, may not participate during that school year.<\/p>\n<p><strong>Issuing of School Clothing and Equipment:<\/strong> It is the responsibility of the athlete to turn back to the coach all clothing and equipment issued. Failure to do this will result in the athlete paying for the missing articles. Athletes not paying for the missing articles will forfeit their right to receive any school equipment or clothing in the next sport season or be eligible for any certificate, pin, or letter. A list of all violators will be sent to the Director of Physical Education&#8217;s office and forwarded to the building principal involved.<\/p>\n<p><strong>Outside Team Rule:<\/strong> The New York State Public High School Athletic Association allows outside competition. Saratoga athletes must understand that commitment to the school team comes first, and outside participation should not be detrimental to an individual or to a Saratoga team. There will be many circumstances where a student should not participate in an outside activity due to the possible effect on the team. Do not participate until you check with the individual coach involved with the school team<\/p>\n<p><strong>NCAA INFORMATION:<\/strong> Any senior student-athlete planning to enroll in college as a freshman and who wants to participate in Division I or Division II athletics, must be certified by the NCAA Eligibility Center. Applications may be obtained in the guidance office. The NCAA Eligibility Center website can be found at: <a href=\"http:\/\/www.eligibilitycenter.org\" rel=\"nofollow noreferrer\">www.eligibilitycenter.org<\/a><\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h2><a id=\"Modified\"><\/a>Modified Program: Philosophy<strong><br \/>\n<\/strong><\/h2>\n<p>This program is available to all students in the 7-9 between the ages of 12 to 15. A student reaching age 16 during a sports season may complete that season and must play freshman, junior varsity, or varsity the next sports season. Sport activities offered are determined by the existence of leagues, student interest, and the relationship to the high school program. At this level, the focus is on learning athletic skills and game rules, fundamentals of team play, socio-emotional growth, physiologically appropriate demands on the adolescent body, and healthy competition.<\/p>\n<p>The modified program is designed to offer students the opportunity to engage in a more highly organized competitive experience than what is found in intramural\/extramural programs but not as involved as those found in varsity and junior varsity interscholastic competition.<\/p>\n<h2><a id=\"APP\"><\/a>Athletic Placement Process <strong><\/p>\n<p><\/strong><\/h2>\n<p>The Saratoga Springs City School District participates in the New York State Education Department (NYSED) approved program called the Athletic Placement Process (APP) that permits physically and emotionally appropriate 7th and 8th grade students to try out for a Varsity, Junior Varsity or Freshmen level team. Formerly known as the Selective Classification Process, this program has been designed for the exceptional few student-athletes who would be better served by playing on a higher level team than age and grade might indicate. It is expected that there will be very few student-athletes participating under this NYSED approved program. Information must be collected and evaluated by the Director of Physical Education and Athletics before a student may tryout for a team. This evaluation is a comprehensive evaluation of your child’s emotional and physical maturity (including height and weight); as well as athletic abilities, physical fitness, and sport-specific athletic skill in relationship to other student athletes at that level.<\/p>\n<p>If your child successfully meets the requirements of the APP, he\/she will be allowed to try out for competitive high school athletics during 7th and\/or 8th grade(s), or compete at the modified level if in grades 9-12. Under normal circumstances, a student is eligible for senior high school athletic competition in a sport for only four consecutive seasons, beginning with the student’s entry into the ninth grade. However, by meeting the Athletic Placement Process requirements established by NYSED, your child’s eligibility can be extended to permit:<\/p>\n<ol style=\"list-style-type: lower-alpha;\">\n<li>Participation during five consecutive seasons in the approved sport after entry into the 8th grade; or<\/li>\n<li>Participation during six consecutive seasons in the approved sport after entry into the 7th grade.<\/li>\n<\/ol>\n<p>It is important for you and your child to understand that, once the requirements are met and if he\/she is accepted as a member of the team, he\/she cannot return to a lower-level team (modified) in that sport in that season. Remember, at the higher level of play your child will be exposed to the social atmosphere that is common among older students in a high school environment. Therefore, it is important to take into account your child’s ability to handle the additional demands.<\/p>\n<p>The steps involved in completing the APP Process can be found on the District Website at www.saratogaschools.org – scroll on Athletics, click on Athletic Forms, then click on Athletic Placement Process.<\/p>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n<h2><a id=\"ScheduleGalaxy\"><\/a>ScheduleGalaxy: Game Schedules and Notifications<\/h2>\n<p>ScheduleGalaxy is now the provider for the Saratoga Springs City School District for their athletics program web-based scheduling system. ScheduleGalaxy enhances both the scheduling process and public access to contest information.<\/p>\n<p><strong>ScheduleGalaxy provides:<\/strong><\/p>\n<ul>\n<li>Quick public access to team schedules, free from commercial advertisement<\/li>\n<li>Ability to receive email alerts for any schedule changes<\/li>\n<li>Directions to contests from your current location to the exact game location via Google maps<\/li>\n<li>View schedules, directions and schedule changes from either your computer<br \/>\nor from the ScheduleGalaxy App<\/li>\n<\/ul>\n<h3>How to Access ScheduleGalaxy<\/h3>\n<ul>\n<li>Go to www.saratogaschools.org and click on the Athletics tab.<\/li>\n<li>Click on “Sports Schedules” a link to ScheduleGalaxy has been established.<\/li>\n<li>Click on “Register” at the top right of the page and register to subscribe to individual team schedules on the site or the App.<\/li>\n<li>To get game details, directions to the contest, and ability to get to the team<br \/>\nschedule, click on the desired game on the calendar.<\/li>\n<li>Or use the Quick Toggle in the upper left-hand corner and choose the team you’re looking for by entering the sport and level and click on the desired game on the schedule.<\/li>\n<li>Clicking on the game on the calendar or the schedule will give you an overview of the details of the game, a map view of the location of the game and the ability to get directions to the game site by clicking on the Get Directions icon in the lower left-hand corner below the map.<\/li>\n<li>This will bring up Google Maps which will already contain the end point (school site) of where the game is being held. All you do is enter your starting point.<\/li>\n<li>To sign up for email alerts to game changes, click on the Back to Team Page icon or again use the Quick Toggle to choose your desired team.<\/li>\n<li>At the top right-hand corner above the team schedule you will see the Subscribe to Schedule icon. Do this for every team for which you want to subscribe.<\/li>\n<li>You will see the schedules you’ve subscribed to on the left hand side of the<br \/>\nhomepage on the computer and you will see them on the App.<\/li>\n<\/ul>\n<p><a href=\"#top-page\">Top of Page<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Overview | Conduct Rules and Violations | Training Rules and Violations | NYSPHSAA Section II Policy for Spectators and Athletes | Suburban Scholastic Council: Sportsmanship Code | Interscholastic Health and Safety Information | Modified Program | Athletic Placement Process | About ScheduleGalaxy Overview Student-athletes represent themselves, their teams and the Saratoga Springs School District at &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Athletics Code of Conduct&#8221;<\/span><\/a><\/p>\n","protected":false},"author":4,"featured_media":0,"parent":18,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-34","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Athletics Code of Conduct - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Athletics Code of Conduct - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Overview | Conduct Rules and Violations | Training Rules and Violations | NYSPHSAA Section II Policy for Spectators and Athletes | Suburban Scholastic Council: Sportsmanship Code | Interscholastic Health and Safety Information | Modified Program | Athletic Placement Process | About ScheduleGalaxy Overview Student-athletes represent themselves, their teams and the Saratoga Springs School District at &hellip; Continue reading &quot;Athletics Code of Conduct&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-10-30T14:32:56+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"41 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\",\"url\":\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\",\"name\":\"Athletics Code of Conduct - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2021-09-23T16:39:44+00:00\",\"dateModified\":\"2024-10-30T14:32:56+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Athletics\",\"item\":\"https:\/\/www.saratogaschools.org\/athletics\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Athletics Code of Conduct\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Athletics Code of Conduct - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/","og_locale":"en_US","og_type":"article","og_title":"Athletics Code of Conduct - Saratoga City School District","og_description":"Overview | Conduct Rules and Violations | Training Rules and Violations | NYSPHSAA Section II Policy for Spectators and Athletes | Suburban Scholastic Council: Sportsmanship Code | Interscholastic Health and Safety Information | Modified Program | Athletic Placement Process | About ScheduleGalaxy Overview Student-athletes represent themselves, their teams and the Saratoga Springs School District at &hellip; Continue reading \"Athletics Code of Conduct\"","og_url":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-10-30T14:32:56+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"41 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/","url":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/","name":"Athletics Code of Conduct - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2021-09-23T16:39:44+00:00","dateModified":"2024-10-30T14:32:56+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/athletics\/athletics-code-of-conduct\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Athletics","item":"https:\/\/www.saratogaschools.org\/athletics\/"},{"@type":"ListItem","position":3,"name":"Athletics Code of Conduct"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/34","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=34"}],"version-history":[{"count":32,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/34\/revisions"}],"predecessor-version":[{"id":9306,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/34\/revisions\/9306"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/18"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=34"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}