{"id":4136,"date":"2022-12-06T11:15:58","date_gmt":"2022-12-06T16:15:58","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4136"},"modified":"2024-12-20T10:57:15","modified_gmt":"2024-12-20T15:57:15","slug":"art-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/","title":{"rendered":"Art Department Courses"},"content":{"rendered":"<p><span>The art program offers numerous discipline<\/span><span>-based courses <\/span><span>aimed at expanding students’ skill development and <\/span><span>conceptual <\/span><span>understanding in art production, aesthetic <\/span><span>judgment, art criticism and art history. The purpose of this <\/span><span>program of study is to enrich students’ lives through their <\/span><span>engagement in the many functions and forms of authentic <\/span><span>arts<\/span><span>-based learning.<\/span><\/p>\n<p><strong>Art Department Head:<\/strong> Dawn Talley (ext. 33320)<\/p>\n<p><a href=\"http:\/\/www.sshsartdept.org\">Art Department Website<\/a><\/p>\n<h3><strong>Graduation Requirements<\/strong><\/h3>\n<p>New York State requires all students to successfully achieve one credit of Fine Arts for graduation. An introductory foundation course, Foundations in Art, is designed to address the New York Standards for Art Education at the commencement level while providing an overview of the major areas of concentration in visual and fine arts.<\/p>\n<h3><strong>Recommendations for Art Majors <\/strong><\/h3>\n<p>Students planning to major in Art should have at least four or more Art credits. The sequence begins in the 9<sup>th<\/sup> grade with Foundations in Art. A progression to Portfolio Development 2 and\/or AP Studio Art courses are recommended for a student to prepare a portfolio of artwork needed for college or Art school admissions.<\/p>\n<h3><strong>Fine Art as a Sequence of Study<\/strong><\/h3>\n<p>Students may pursue a five-unit sequence for a Regents Diploma with Advanced Designation by taking a combination of Art, Music, Technology, and Family and Consumer Science courses in lieu of a three-unit sequence in World Language. <\/p>\n<h3><span>Art Progressions<\/span><\/h3>\n<p><span>(These progressions are sample progressions; however, <\/span><span>students may customize their progression at any time<\/span><span>) <\/span><\/p>\n<p><span><strong>GRADE 9<\/strong>: Foundations in Art<\/span><\/p>\n<p><span><strong>GRADE 10<\/strong>: Creative Design, Portfolio Dev 1, Computer Graphics 1, Digital Video, Mixed Media 1 &amp; 2, or Ceramics 1 &amp; 2<\/span><\/p>\n<p><strong>GRADE 11: <\/strong>Drawing 1, Advanced Painting, Portfolio Dev. 2, Comp. Graphics 2, or <span>Digital Photography<\/span><\/p>\n<p><strong>GRADE 12: <\/strong><span>Portfolio Dev. 2<\/span><span>, <\/span><span>AP <\/span><span>Studio <\/span><span>Art, o<\/span><span>r a<\/span><span>ny art <\/span><span>elective, <\/span><span>providing the <\/span><span>prerequ<\/span><span>isite is <\/span><span>met.<\/span><\/p>\n<h4>FOUNDATIONS IN ART<\/h4>\n<p>0430        Full Year                  1 credit                             Grades 9-12<\/p>\n<p>This course is the comprehensive “foundation” for all secondary school art. Foundations in Art is a prerequisite to most high school art courses.  In this course, students will have a brief exposure to two- and three-dimensional art, with a variety of artists, techniques, and media.  Exposure to these areas in the excitement of a studio atmosphere will encourage the development of concepts and skills in the visual arts.  Participation in class critiques is expected.<\/p>\n<p><em>Meets Fine Arts Requirement for graduation. Prerequisite for other Art electives.<\/em><\/p>\n<h4>CREATIVE DESIGN<\/h4>\n<p>0433       Full Year        1 credit                                       Grades 9-12<\/p>\n<p>Do you enjoy making different kinds of Art?  In this class, students learn the basic elements and principles of design using line, color, value, shape, form, and texture to create both two-dimensional and three-dimensional Art.  Students will develop creativity, problem-solving, and technical skills by exploring a variety of tools and materials (including but not limited to painting, collage, and sculpture).  Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Foundations in Art<\/em><\/p>\n<h4>PORTFOLIO DEVELOPMENT 1<\/h4>\n<p>0427        Full Year         1 credit                                       Grades 9-12<\/p>\n<p>This course is designed for students whose primary interest in Art lies in two-dimensional expression and\/or students who wish to attend a college that requires a portfolio showing observational drawing skills. Areas of study that may require such a portfolio include fine arts, architecture, interior design, fashion, photography and more.  Students will understand portfolio presentation choices based on their specific area of study.  Along with observational drawing, this class will also include studying light\/shade, line, texture, and other various combinations.  The course emphasizes the use of color and color theory in several media, including acrylic paint, watercolor, charcoal, pastel and conte.  Students will be expected to have an 11 x 14-inch sketchbook and complete assignments outside of class.  Participation in class critiques are expected.<\/p>\n<p><em>Prerequisite: Successful completion of Foundations in Art (85% or better).  Teacher recommendation is required for 9<sup>th<\/sup> grade students.<\/em><\/p>\n<h4>DRAWING 1 CHS<\/h4>\n<p>0409        Full Year        1 Credit                                     Grades 11-12<\/p>\n<p>An introductory level studio course covering the practice, history, and theory of drawing.  Students will use a variety of media and techniques to study subjects that may include still-life, landscape, and the human form. Students will inquire into the purpose of drawing and analyze the historical and contemporary uses of media.  Emphasis will be placed on the creative application of the media.  Participation in class critiques is required. <\/p>\n<p>College Credits through SUNY Adirondack may be received upon completion of this course for a fee.<\/p>\n<p>Projected to be offered in 2025 – 2026<\/p>\n<p><em>Pre<\/em><em>requisite:  Portfolio Development 1<\/em><\/p>\n<h4>ADVANCED PAINTING<\/h4>\n<p>0415        Full Year       1 Credit                                     Grades 10-12<\/p>\n<p>Advanced Painting will introduce students to classical painting techniques and concepts. Students will paint in acrylic, tempera, and watercolor media. Students will be introduced to the work of master painters, advanced techniques, and the history of painting.  Participation in class critiques is expected.<\/p>\n<p>Projected to be offered in 2026 &#8211; 2027.<\/p>\n<p><em>Pre<\/em><em>requisite: Portfolio Development 1<\/em><\/p>\n<h4>PORTFOLIO DEVELOPMENT 2<\/h4>\n<p>0428      Full Year          1 Credit                                     Grades 10-12<\/p>\n<p>This course is for students who are considering an Art major in college. All design, architecture, graphic art and drawing or painting majors need a college entrance portfolio. Students will continue to build an understanding of portfolio presentation choices based on their specific area of study. Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Portfolio Development 1<\/em><\/p>\n<h4>AP STUDIO ART<\/h4>\n<p>0400         Full Year        1 Credit                                            Grade 12<\/p>\n<p>This AP course is designed for the Art student who can make a serious commitment to personal expression through the visual arts in terms of both time and effort. AP credit is not granted based upon a written exam, but rather as the result of an evaluation of an extensive portfolio submitted by the student. The sophisticated application of artistic knowledge and skills will be represented in the portfolio with works of art and written statements for each. It is recommended that students take the AP Studio Art examination.<\/p>\n<p><em>Prerequisite: A sequence of three Art courses (and\/or department permission) is required.  Courses in the sequence must include Foundations of Art, Portfolio Development 1, Drawing 1, Advanced Painting, or Portfolio Development 2. <\/em><\/p>\n<h4>DARKROOM PHOTOGRAPHY<\/h4>\n<p>0406       1 Semester            .5 Credit                              Grades 11-12<\/p>\n<p>This course is an introduction to 35mm black and white photography and the use of photographic materials and processes as an art medium.  The content covered includes 35mm camera operation, film and print processing, traditional darkroom techniques, and other specialized techniques. Emphasis will be placed on seeing with imagination and creativity and organizing what is seen into a well-designed photograph. <\/p>\n<p><em>Prerequisite: 35mm camera required<\/em><\/p>\n<h3><strong>Electronic\/Digital Media Art Courses<\/strong><\/h3>\n<h4>COMPUTER GRAPHICS 1<\/h4>\n<p>0417        Full Year            1 Credit                                     Grades 9-12<\/p>\n<p>Students will be introduced to the fundamentals of graphic design through the creative process of combining art and technology to communicate ideas.  It is intended for students who are interested in learning about visual communication through typography, product design, cartooning, advertising, and logo design.  Students will learn to create on the computer using Adobe Illustrator and Photoshop.  Participation in class critiques is expected.<\/p>\n<p><em>Pre<\/em><em>requisite: Foundations in Art Or Introduction to Engineering, Or Design and Drawing for Production and<\/em><em> a four gigabyte (minimum) flash drive <\/em><\/p>\n<h4>COMPUTER GRAPHICS 2<\/h4>\n<p>0419        Full Year            1 Credit                                   Grades 10-12<\/p>\n<p>Just can’t get enough computer graphics?  Interested in learning about advertising and the visual elements behind creating a successful ad campaign? Want to design your own advertisements and explore exciting new programs like Corel Painter &amp; In Design?  Come learn advanced Photoshop and Illustrator techniques used by professional artists and designers across the globe. Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Computer Graphics I <\/em><em>and a four gigabyte (minimum) flash drive<\/em><\/p>\n<h4>DIGITAL PHOTOGRAPHY<\/h4>\n<p>0418       1 Semester          .5 Credit                              Grades 10-12<\/p>\n<p>Do you enjoy taking pictures?  If so, this is the class for you!  Through a combination of lectures, demonstrations, assignments and critiques, students will learn to visually communicate with a digital camera.  You will explore basic tools, techniques, and aesthetics of digital photography.  There will be an emphasis on the creative use of camera controls, exposure, digital imaging software (Adobe Photoshop), and an awareness of the impact digital photography has on our contemporary society. Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Digital camera or cellphone is required.<\/em><\/p>\n<h4>DIGITAL VIDEO<\/h4>\n<p>0403     Full Year          1 Credit                                         Grades 9-12<\/p>\n<p>This media art course introduces basic film and video techniques. In this course you’ll learn the basics of the digital video camera, its use and operation. Come explore film history as well as the fundamentals of storytelling and visual communication. Each student will also use video and sound editing software packages, Final Cut Pro and Garage band, to create their own videos. Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: <\/em><em>Camera with video capability or cellphone is required.<\/em><\/p>\n<h3>3-D Art Courses<\/h3>\n<h4>CERAMICS 1<\/h4>\n<p>0425    1 Semester             .5 Credit                               Grades 10-12<\/p>\n<p>Students will be immersed in hands-on exploration of the many processes and techniques of working with clay through exploring ceramic art, artists, and cultures throughout history to the present day. Hand building skills, the use of the potter’s wheel, and glazing and firing techniques will be taught. Several pieces will be created, both functional and non-functional.  Participation in class critiques is expected.<\/p>\n<h4>CERAMICS II<\/h4>\n<p>0426     1 Semester               .5 Credit                             Grades 10-12<\/p>\n<p>Students will continue their hands-on journey, as they build upon their existing skills in clay pottery and ceramic sculpture through the exploration of ceramic art, artists, and cultures throughout history to the present day. The ceramic art of combining both hand built and thrown pieces will be taught along with ceramic sculpture. New possibilities with glazes and firing techniques will continue to be explored. Several pieces will be created, both functional and sculptural. Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Ceramics I<\/em><\/p>\n<h4>MIXED MEDIA 1<\/h4>\n<p>0420     1 Semester              .5 Credit                               Grades 9-12<\/p>\n<p>Mixed Media is the use of more than one medium in an individual piece of art. Students will explore the creative process of making both two-dimensional and three-dimensional art. Assignments encourage independent thinking in an art studio atmosphere.  Students will create several unique pieces of art using assemblage, collage, drawing, painting, and\/or sculpture.  Traditional and non-traditional materials will be used. Mixed media techniques will be taught.  In addition to class projects, students will be responsible for two visual journal assignments each month.  Participation in class critiques is expected. <\/p>\n<p><em>Prerequisite: Foundations in Art<\/em><\/p>\n<h4>MIXED MEDIA 2<\/h4>\n<p>0421     1 Semester              .5 Credit                                Grades 9-12<\/p>\n<p>Students interested in continuing their creative journey from Mixed Media I should sign up for Mixed Media II.  Students will expand on the process and techniques of making both two-dimensional and three-dimensional art.  Several unique pieces of art will be created with a variety of materials.  Students will have more independence and will continue to work in assemblage, collage, drawing, painting and\/or sculpture throughout the semester.  In addition to class projects, students will also be responsible for a visual journal assignment each month.  Participation in class critiques is expected.<\/p>\n<p><em>Prerequisite: Mixed Media I or teacher approval<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The art program offers numerous discipline-based courses aimed at expanding students’ skill development and conceptual understanding in art production, aesthetic judgment, art criticism and art history. The purpose of this program of study is to enrich students’ lives through their engagement in the many functions and forms of authentic arts-based learning. Art Department Head: Dawn &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Art Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4136","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Art Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Art Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The art program offers numerous discipline-based courses aimed at expanding students’ skill development and conceptual understanding in art production, aesthetic judgment, art criticism and art history. The purpose of this program of study is to enrich students’ lives through their engagement in the many functions and forms of authentic arts-based learning. Art Department Head: Dawn &hellip; Continue reading &quot;Art Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-20T15:57:15+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\",\"name\":\"Art Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:15:58+00:00\",\"dateModified\":\"2024-12-20T15:57:15+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Art Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Art Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Art Department Courses - Saratoga City School District","og_description":"The art program offers numerous discipline-based courses aimed at expanding students’ skill development and conceptual understanding in art production, aesthetic judgment, art criticism and art history. The purpose of this program of study is to enrich students’ lives through their engagement in the many functions and forms of authentic arts-based learning. Art Department Head: Dawn &hellip; Continue reading \"Art Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-20T15:57:15+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/","name":"Art Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:15:58+00:00","dateModified":"2024-12-20T15:57:15+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/art-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Art Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4136","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4136"}],"version-history":[{"count":14,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4136\/revisions"}],"predecessor-version":[{"id":9683,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4136\/revisions\/9683"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4136"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}