{"id":4139,"date":"2022-12-06T11:20:08","date_gmt":"2022-12-06T16:20:08","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4139"},"modified":"2024-12-20T14:00:12","modified_gmt":"2024-12-20T19:00:12","slug":"business-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/","title":{"rendered":"Business Department Courses"},"content":{"rendered":"<p>The Business Department at Saratoga Springs High School provides a foundation to pursue programs such as business administration, accounting, marketing\/management, law, and finance.  The course offerings include a variety of learning experiences that will give students the basic skills and knowledge to be a successful participant in society today as a consumer, a citizen and an employee.  <em>All business courses may be used for CTE or CDOS credential hours. (Full year = 108 hours, ½ year = 54 hours)<\/em><\/p>\n<p><strong>Business Department Head:<\/strong> Tim McGuiggan   (ext. 33317)<\/p>\n<h3>Business Progressions <em>(Sample)<\/em><\/h3>\n<p><span><strong>GRADE 9<\/strong>: Career &amp; Finance Mgmt. and American Entrepreneurship<\/span>, Accounting, Principles of Marketing, or Business, Consumer &amp; Personal Law, <\/p>\n<p><span><strong>GRADE 10<\/strong>: American Entrepreneurship, Accounting, Principles of Marketing, or Business, Consumer &amp; Personal Law, <\/span><\/p>\n<p><strong>GRADE 11:  <\/strong>College Business Law, College Principles of Marketing, College Principles of Management, or College Accounting<\/p>\n<p><strong>GRADE 12:   <\/strong>College Business Law, College Principles of Marketing, College Principles of Management, College Accounting, Sports Marketing, or <span>CEIP<\/span><\/p>\n<h4>DIGITAL COMMUNICATIONS\/PRESENTATIONS<\/h4>\n<p>0521    1 Semester          .5 Credit                                     Grades 9-12<\/p>\n<p>This half-year, project-based course provides you with a non-threatening environment to conquer public speaking. Students will acquire and polish their current preparation and presentation skills to have a competitive advantage in both the academic and business settings. Key topics include time management, script writing, reaching your audience, poise, researching, introduction\/conclusion execution, and more. Presentations include introduction, biographical, demonstration, persuasive, motivational, current events, and podcasting.<\/p>\n<h4>ACCOUNTING<\/h4>\n<p>0512       Full Year            1 Credit                                      Grades 9-12<\/p>\n<p><span>This one-year course develops an understanding of the basic elements of financial accounting and the role of accounting in society. The principles covered include the accounting cycle, financial statements, and payroll systems. Students will learn two important software applications that will benefit them in the business world: QuickBooks and Microsoft Excel.  QuickBooks, a software for accounting, will let the student understand the accounting cycle.  Excel, a prominent business platform that most businesses use, will prepare them for college and the workforce. Accounting is a suggested course for all students pursuing a background in entrepreneurship, finance, marketing, and management<\/span><\/p>\n<h4>COLLEGE ACCOUNTING CHS<\/h4>\n<p>0502       Full Year         1 Credit                                      Grades 11-12<\/p>\n<p><span>This is a one-year course offering students the opportunity to earn four college credits through SUNY Adirondack. This course introduces the fundamental concepts that comprise financial accounting and accepted accounting principles and provides a solid foundation in basic accounting principles. Students will prepare and analyze classified financial statements, understand the importance of internal controls, value inventory and calculating depreciation. This balanced inside\/reporter and outside\/user perspective will help you whether you become a manager who makes business decisions, an accountant who reports financial results of these decisions, or an investor or lender who evaluates the reported financial results.<\/span><\/p>\n<p><span><em>College credit: SUNY Adirondack. Fee required for college<\/em><\/span><span><em> <\/em><\/span><span><em>credit. Students may opt to take the course for only high school credit.<\/em><\/span><\/p>\n<h4>CAREER\/FINANCIAL MANAGEMENT<\/h4>\n<p>0519      1 Semester             .5 Credit                                Grades 9 (required)<\/p>\n<p>This is a half-year mandatory course that focuses on personal finance and career-based skills.  Students will be introduced to concepts that will prepare them to be career and financially successful.   Financial literacy is stressed as students learn subject areas needed to manage their economic future including financial planning, banking, managing credit, and investment planning. Students will explore career options and steps needed to prepare for a career.  Students will develop a portfolio that includes personality profiles, interest and value assessments, and career pathway research. <\/p>\n<h4>PRINCIPLES OF MARKETING<\/h4>\n<p>0525         Full Year           1 Credit                                     Grades 9-12<\/p>\n<p>This one-year course is designed to promote an understanding of the principles of marketing including market research, target marketing, product development and packaging, pricing, advertising and promotion, and merchandising. Projects are hands-on and practical for anyone interested in the psychology behind why customers buy certain products over the competition.<\/p>\n<h4>PRINCIPLES OF MARKETING CHS<\/h4>\n<p>0501        Full Year                 1 Credit                              Grades 11-12<\/p>\n<p>This is a one-year course offering students the opportunity to earn three college credits through SUNY Adirondack.  The course covers key principles of marketing, including strategic and product planning, promotion, pricing, distribution, marketing research, logistics, branding, and social media marketing.  Students will learn these principles through lecture, hands-on activities, case studies, and discussion. College Principles of Marketing is an essential course for anyone interested in pursuing a major or career in business and marketing.  <\/p>\n<p><span><em>College credit: SUNY Adirondack. Fee required for college<\/em><\/span><span><em> <\/em><\/span><span><em>credit.  Students may opt to take the course for only high school credit.<\/em><\/span><\/p>\n<h4>BUSINESS LAW I CHS<\/h4>\n<p>0504       Full Year              1 Credit                                  Grades 11-12<\/p>\n<p>This course focuses on legal concepts, principles and rules of law pertaining to the legal environment of business. Subject areas include identification and application of sources of American law to determine the outcome of legal issues, review of constitutionally protected rights under the Bill of Rights, alternative methods of resolving legal disputes, the federal and state court system, civil litigation process and procedure, the law of torts, criminal law, cyber-crimes, intellectual property law, and the law of contracts and e-commerce. Ethical concerns and considerations will be stressed in each subject area.<\/p>\n<p><em>College credit: SUNY Adirondack. Fee required for college credit.  Students may opt to take the course for high school credit only.<\/em><\/p>\n<h4>BUSINESS, CONSUMER &amp; PERSONAL LAW<\/h4>\n<p>0513      Full Year           1 Credit                                         Grades 9-12<\/p>\n<p>This full-year course offers an opportunity to learn about the practical applications of laws and how they affect society. Key topics include: the constitution, court systems, criminal system, civil system, contracts and more. This course is a hands-on approach to applying every day legal situations. Students will participate in mock trials and case debates for a practical approach to many of today’s trending legal issues.<\/p>\n<h4>PRINCIPLES OF MANAGEMENT CHS<\/h4>\n<p>&nbsp;<\/p>\n<p>0500      Full Year           1 Credit                Grades 11-12 <em><\/em><\/p>\n<p>Explore the diverse world of business and earn three college credits. This course develops both the content and process issues of management and defines the functional activities of planning, organizing, staffing, directing, and controlling,<\/p>\n<p>while stressing the areas of communications, decision making, group dynamics, conflict resolution, motivation, leadership, and individual self-improvement. The art of delegation is explored in the issues of authority, accountability, and responsibility. This course presents an introduction to the major disciplines of business management, marketing, finance, and human resource management. Case studies, current event news articles, and guest speakers are used to bring the world of business into the classroom.<\/p>\n<p><em>College credit: SUNY Adirondack. Fee required for college credit.  Students may opt to take the course for only high school credit.<\/em><\/p>\n<h4>AMERICAN ENTREPRENEURSHIP<\/h4>\n<p>0505      Full Year               1 Credit                                    Grades 9-12<\/p>\n<p>American Entrepreneurship is a one-year course designed to help students gain an understanding of how to start and successfully run a small business and develop the skills needed to be an entrepreneur. The topics covered include entrepreneurship, management, advertising, market research, financial planning, and the legal aspects of starting a small business. Guest speakers from area businesses are invited into the classroom. A study of entrepreneurs past and present, hands-on activities, group projects, and various projects will support the learning process. <\/p>\n<h4>SPORTS MARKETING<\/h4>\n<p>0510       1 Semester            .5 Credit                                      Grade 12<\/p>\n<p>Sports Marketing is only available for seniors. It is a half-year project-based course that focuses on the effects of the sports industry. The course is designed to take a hands-on approach to examine the needs and wants of the sports consumer. Projects are based on potential problems someone would need to solve during their career within a sports organization.<\/p>\n<h4>CAREER EXPLORATION INTERNSHIP PROGRAM (CEIP)<\/h4>\n<p>0507        1 Semester            .5 Credit                        Grade 12<\/p>\n<p>What is it like to be an accountant, financial planner, graphic artist, or physical therapist? Why not find out before going off to college or starting a career? The Career Exploration Internship Program (CEIP) is a non-paid internship experience that provides a link between school and career options. CEIP provides valuable hands-on experiences in a variety of career choices.    Working alongside their mentors, students discover the varying aspects of a prospective career, while learning what specific skills and education are needed for success.  Career related topics such as resume writing, interviewing, teamwork, time-management and health and safety in the workplace are introduced during the classroom component of the program. <\/p>\n<p>Students who plan to enroll in CEIP must meet the following criteria:<\/p>\n<ul>\n<li>Submit an application with recommendations for approval into the program. (Attendance, discipline, and recommendations are all considered.)<\/li>\n<li>Sign a contract with their parent\/guardian documenting their understanding of the course expectations.<\/li>\n<li>Complete a minimum of 54 hours at their internship placement (required by NY State)<\/li>\n<li>Complete an equivalent of 27 hours of coursework through classroom experience (required by NY State).<\/li>\n<li>Need to know that dropping out of CEIP on or after the start of school will result in a Withdraw Fail (WF) on the student’s transcript.<\/li>\n<li>Provide their own transportation to internship assignments.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The Business Department at Saratoga Springs High School provides a foundation to pursue programs such as business administration, accounting, marketing\/management, law, and finance.  The course offerings include a variety of learning experiences that will give students the basic skills and knowledge to be a successful participant in society today as a consumer, a citizen and &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Business Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4139","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Business Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Business Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The Business Department at Saratoga Springs High School provides a foundation to pursue programs such as business administration, accounting, marketing\/management, law, and finance.  The course offerings include a variety of learning experiences that will give students the basic skills and knowledge to be a successful participant in society today as a consumer, a citizen and &hellip; Continue reading &quot;Business Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-20T19:00:12+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"7 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\",\"name\":\"Business Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:20:08+00:00\",\"dateModified\":\"2024-12-20T19:00:12+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Business Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Business Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Business Department Courses - Saratoga City School District","og_description":"The Business Department at Saratoga Springs High School provides a foundation to pursue programs such as business administration, accounting, marketing\/management, law, and finance.  The course offerings include a variety of learning experiences that will give students the basic skills and knowledge to be a successful participant in society today as a consumer, a citizen and &hellip; Continue reading \"Business Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-20T19:00:12+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/","name":"Business Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:20:08+00:00","dateModified":"2024-12-20T19:00:12+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/business-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Business Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4139","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4139"}],"version-history":[{"count":12,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4139\/revisions"}],"predecessor-version":[{"id":9694,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4139\/revisions\/9694"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4139"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}