{"id":4144,"date":"2022-12-06T11:22:28","date_gmt":"2022-12-06T16:22:28","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4144"},"modified":"2025-01-06T12:38:18","modified_gmt":"2025-01-06T17:38:18","slug":"english-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/","title":{"rendered":"English Department Courses"},"content":{"rendered":"<p><strong>English Department Head:<\/strong> Brigette Gallagher (ext. 33319)<\/p>\n<h3><span>Progressions and Thematic Strands<\/span><\/h3>\n<p><strong>For graduation, students must have 4 years of English credit: <\/strong><\/p>\n<ul>\n<li>In grades 10-12, there are honors\/AP options<\/li>\n<li>In grades 9-11, students can take English courses as electives<\/li>\n<li>Students MUST be enrolled in a full year of English 12 either with two semester courses or one full year course.<\/li>\n<\/ul>\n<p><em><u>Required 4 year English strand <\/u><\/em><\/p>\n<ul>\n<li>English 9<\/li>\n<li>English 10<\/li>\n<li>English 11<\/li>\n<\/ul>\n<p><em><u>Honors Programming strand 10-12 <\/u><\/em><\/p>\n<ul>\n<li>English 10 Pre-AP<\/li>\n<li>English 11 AP Language<\/li>\n<li>English 12 AP Literature<\/li>\n<\/ul>\n<p><strong>Thematic Strands: <\/strong>With many electives available in our English program, it’s possible for students to pursue specific strands which have a specific concentration of English Language Arts education at Saratoga.<\/p>\n<p><strong><u>Creative Communications &amp; Media Studies <\/u><\/strong><\/p>\n<ul>\n<li>Student Seminar (grades 9-10)<\/li>\n<li>Creative Writing (grades 9-12)<\/li>\n<li>Public Speaking (grades 9-12)<\/li>\n<li>Journalism (grades 9-12)<\/li>\n<li>Sports Rhetoric &amp; Writing (grade 12 only) *<\/li>\n<li>College Composition (grade 12 only) *<\/li>\n<li>Film as Literature (grade 12 only)<\/li>\n<\/ul>\n<p><strong><u>Deep Literature Study <\/u><\/strong><\/p>\n<ul>\n<li>Crime Fiction (grades 9-12)<\/li>\n<li>Contemporary Women in Poetry, Prose, and Pop Culture (grades 9-12)<\/li>\n<li>Reading Shakespeare (grades 9-12)<\/li>\n<li>Pop Culture and the Modern Hero (grades 9-12)<\/li>\n<li>The American Experience\/Multicultural Literature (grades 11-12)<\/li>\n<li>Exploring Science Fiction and Fantasy (grade 12 only) *<\/li>\n<li>The Short Story (grade 12 only)<\/li>\n<\/ul>\n<p><em>*College credit- College in the high school<\/em><\/p>\n<ul><\/ul>\n<h4>ENGLISH 9<\/h4>\n<p>0051          Full Year              1 Credit                                          Grade 9<\/p>\n<p>In this class, students will read both classic and contemporary texts that include dramas, novels, short stories, and nonfiction pieces, developing their skills in annotating for comprehension and literary analysis, and discussing themes of identity, heroism, and empathy. Throughout the year, students will work on teamwork and communication through group work activities. A focus on argument-based writing will prepare students for their future Regents work as well as subsequent English <span>course<\/span>s. Students will also begin to build their foundational knowledge in the research process and gain experience using our library databases and citation tools. Additionally, students will spark their love of literature through independently reading novels of their choice.<\/p>\n<h4>ENGLISH 10<\/h4>\n<p>0041           Full Year              1 Credit                                     Grade 10<\/p>\n<p>Students will explore literary selections representing various cultures and traditions. Students will engage in such classic fiction works like Golding’s novel, <em>Lord of the Flies<\/em> and nonfiction works like Wiesel’s memoir, <u>Night<\/u>. Research skills will be an intricate component of the curriculum. Students will closely read and annotate texts of multiple forms. Students will write literary essays and informal responses. Students will also have testing situations that are designed to prepare them for the English Regents Examination. Students will also be engaged in various activities designed to meet Next Generation State Standards.<\/p>\n<h4>ENGLISH 10 (PRE-AP)<\/h4>\n<p>0039        Full Year                    1 Credit                                 Grade 10<\/p>\n<p>English 10 Pre-AP is designed to prepare sophomores for success in AP English Language and Composition as juniors and in AP English Literature and Composition as seniors. The curriculum provides a comprehensive introduction to western literary traditions with a focus on the epic hero, rhetoric and argument, classical Greek drama, the origins of the English language, Renaissance poetry and drama, Enlightenment philosophy, the British novel, and independent research. Students will be challenged to read critically and analytically and write with sophistication and an awareness of audience and purpose. A student who is academically motivated, intellectually curious, reads avidly and independently, and exhibits a notable mastery of written expression is a suitable candidate for this course.<\/p>\n<p><em>Recommended preparation: Exemplary completion of English 9. Students are expected to be adept independent readers and writers and active participants in class.<\/em><\/p>\n<h4>ENGLISH 11<\/h4>\n<p>0031        Full Year             1 Credit                                         Grade 11<\/p>\n<p>Extensive student writing and an in-depth exploration of American literature are the foundations of this course. Students will engage in close reading various mediums with a focus on understanding arguments and purpose. They will participate in sustained collaborative communities and project-based learning. Students will gain independence in the research process through an annotated bibliography. They also will refine their digital, written, and verbal communication skills. This course addresses Next Generation Standards, and the curriculum aligns to the Saratoga Springs City School District’s Mission and Vision Statement.<\/p>\n<p><em>Students will take the Regents examination in English in January for this course<\/em>.<\/p>\n<h4>ENGLISH 11: AP LANGUAGE AND COMPOSITION<\/h4>\n<p>0004        Full Year          1 Credit                                            Grade 11<\/p>\n<p>This course is designed for juniors who would like to focus on the close reading of nonfiction and understand the way the rules of formal rhetoric work in reading and writing. In this course, students write in both informal and formal contexts to gain authority and learn to take risks in writing. As well as engaging in varied writing tasks, students become acquainted with a wide variety of prose styles from many disciplines and historical periods and gain understanding of the connections between writing and interpretive skill in reading. In addition, the informed use of research materials and the ability to synthesize varied sources (to evaluate, use and cite sources) are integral parts of the AP English Language and Composition course.  It is recommended that students take the AP Language and Composition examination.<\/p>\n<p><em>Recommended preparation: Completion of English 10 Pre-AP.  Required: Completion of summer assignment <\/em><\/p>\n<h4>ENGLISH 12: AP LITERATURE AND COMPOSITION<\/h4>\n<p>0001       Full Year                1 Credit                                 Grade 12<\/p>\n<p>This course is designed for highly motivated seniors with strong skills in critical reading, literary analysis, and formal composition. Success in this course may allow students to earn college credit or advanced standing in undergraduate programs. The curriculum presents a rich variety of major and minor works dating from the English Renaissance to the present, including classic and contemporary poetry, a sampling of short stories, Victorian and Modern novels, and a Shakespearean tragedy. A formal research paper on Literary Criticism is required. It is recommended that students take the AP Literature and Composition examination.<\/p>\n<p><em>Recommended preparation: Completion of AP Language and Composition.<\/em><\/p>\n<p><em>Required: Completion of a summer assignment <\/em><\/p>\n<h3><strong>Elective Courses<\/strong><\/h3>\n<p>*Elective courses are for elective credit in the specified grade levels. Most electives can be used for English credit in grade 12.<\/p>\n<h4><span data-olk-copy-source=\"MessageBody\">LITERATURE AND IDENTITY (AMERICAN EXP.\/MULTI)<\/span><\/h4>\n<p>0020       1 Semester            .5 Credit                         Grades 11- 12<\/p>\n<p><span data-olk-copy-source=\"MessageBody\">This course encourages students to think critically about the American experience. This course uses fiction, poetry, and prose (with supplemental materials such as art, film, television, and podcasts) to think about the way that America and the American experience has been constructed, marketed, reimagined, and experienced by various peoples across time with particular emphasis on issues of race and gender. This course will connect how our history impacts us today, from 1619 to Black Lives Matter.  That model of connecting history to today will then be used for other American experiences.<\/span> We will explore questions such as:<\/p>\n<ul>\n<li>How do the stories we hear shape our experiences?<\/li>\n<li>If America is a story, what are the themes?<\/li>\n<li>If America is a story, who are the authors?<\/li>\n<li>If America is a story, what chapters are missing?<\/li>\n<\/ul>\n<p>Course objectives include the development of students’ abilities to identify important texts and figures within a specific literary\/historical context and to analyze key themes.  In addition, students will complete an annotated bibliography and give a presentation. <\/p>\n<h4>STUDENT SEMINAR<\/h4>\n<p>0022<em>       <\/em>1 Semester           .5 Credit                             Grades 9-10<\/p>\n<p>Student Seminar is designed to cover the myriads of topics that a new high school student needs to know for social and academic success. Lessons range from stressing the importance of school spirit, to learning effective note taking and study skills, to having a good relationship with others, to time management, critical thinking and much more. Students of all levels need a course specific to social emotional learning, coping, establishing healthy relationships, managing stress, conflict resolution, in addition to goal setting, and self-advocacy. There will be heavy emphasis on mindful behavior to approach life’s difficulties. <\/p>\n<p>This course is designed for incoming first-year students or new to SSHS students to help prepare them for their Saratoga Springs High School experience. They will engage in activities that familiarize them with the new environment and people who will be part of their daily lives for the next four years. This course will include several guest speakers from the SSHS staff, including but not limited to, administrators, school counselors, school social workers and school resource officer. Students will also have several hands-on and immersive experiences.<\/p>\n<h4><strong> <\/strong>JOURNALISM: UNDERSTANDING MEDIA COMMUNICATION  <\/h4>\n<p>0008        1 Full Year       1 Credit                                     Grades 9-12<\/p>\n<p>This course incorporates interdisciplinary elements from social studies, science, art, technology, and business with storytelling, critical thought and problem solving. At its core, the course requires intensive writing and reading as students train to become hyperlocal reporters. As students examine their lives and community through the lens of journalism, they actively and meaningfully explore social issues and the significance of adult citizenship. Hands-on learning activities demand consistent attendance.<\/p>\n<h4>CONTEMPORARY WOMEN IN POETRY, PROSE, AND POP CULTURE<\/h4>\n<p>0023<em>       <\/em>1 Semester           .5 Credit                            Grades 9-12<\/p>\n<p>How has the female persona changed in the stories we read? How is the pop music of today influenced by the poetry of the past? In this deep study of literature and media written by women, we will examine classic and contemporary short fiction, poetry, music, and film to ask questions about a female’s role in society in modern day. This elective course aims to delve into the rich and diverse landscape of literature written by women, exploring the powerful narratives, perspectives, and voices that have emerged throughout history. Students will engage with a range of literary works, spanning different genres and time periods, to develop a nuanced understanding of classic and contemporary women&#8217;s thought and expression. Students will read about, write about, critique, and formally and informally discuss how art created by women is influenced by societal norms. Through informal research, class discussion, creative expression, novel study, and community projects, students will answer their own questions about a female’s role in contemporary society.<\/p>\n<p>This course includes the review of well-known films, albums, short fiction, and poetry but it also requires students to trace back all eras of women to some of the trailblazers of the past. Students will have a chance to pursue a final project of their own incorporating visual art, pop culture, history, politics, and\/or written media created by women today.<\/p>\n<h4>CREATIVE WRITING<\/h4>\n<p>0017        1 Semester            .5 Credit                             Grade 9- 12<\/p>\n<p>Creative Writing is a course for a student hoping to discover the role creative writing plays in their life. Through their own writing projects, students will develop creativity and self-expression and a body of work including narrative, poetry, personal essays, flash fiction, emulations, and short stories. From the stance of authors, students will close-read literature, examine techniques, and apply them to their own writing. Students will read essays by writers to determine their own definition of what makes good writing. They will explore writing practice through writing essays, discussions, Socratic Seminar, and other media. Students delve into conventions, challenges, and possibilities afforded by playing with structure, form, character, plot, and narration.  Participation in group writing projects, peer reviews, writing workshops, self-reflection, and receiving teacher feedback will provide opportunities for individually paced growth. Students will be encouraged to read their work aloud and often the class visits Caffe Lena at the end of the semester to share work with the public (encouraged but not required!). Students will reflect on their growth as a writer and produce a full-length short story as a capstone of the course. Students will work together to produce a semester literary magazine and experiment with submitting their work for publication. <\/p>\n<p>Students who want to take Creative Writing should also consider joining Shades of Blue Creative Writing Club for more writing opportunities. <\/p>\n<h4>CRIME FICTION<\/h4>\n<p>0024        1 Semester            .5 Credit                            Grades 9 -12<\/p>\n<p>Crime Fiction is a semester course that covers subgenres including crime, mystery, suspense, and more. Daily tasks include reading a crime-related book of their choice, and writing about and discussing prompts related to crime. Students will read various short stories by authors such as Agatha Christie, Edgar Allan Poe, O. Henry, and others. Some class activities include an Agatha Christie scavenger hunt, murder mystery party, escape rooms, and other hands-on lessons that accompany the short stories read in class. In the crime in media unit, students will watch drama, comedy, and animated shows to analyze how crime is treated and represented in this medium. In addition, students will write a pilot episode for a tv series of their own original creation.<\/p>\n<h4>POP CULTURE AND THE MODERN HERO<\/h4>\n<p>0025        1 Semester            .5 Credit                            Grades 9-12<\/p>\n<p>This half-year course critically examines the myth of the hero and how it has been adapted for the 21<sup>st<\/sup> century.  Students will consume texts (articles, novels, movies, television shows) that portray heroes in modern culture and then analyze how the archetype of a hero has evolved in society.  We will examine diversity and inclusivity in the world of heroes and explore how fandom and social media have impacted the landscape of fictional heroes.  Students will participate in class discussions, conduct research, analyze popular heroes through various lenses and present their analysis to their peers in several formats, including but not limited to presentations and analytical writings.<\/p>\n<h4>PUBLIC SPEAKING<\/h4>\n<p>0027        1 Semester            .5 Credit                             Grades 9 &#8211; 12<\/p>\n<p>Public Speaking is a semester course designed to help students prepare, research, deliver, and evaluate informative, persuasive, and special occasion\/entertainment speeches. This course will guide students through topic selection, organization, language use, and effective delivery techniques.  Students will work both independently and with peers to build confidence while improving their public speaking skills. Assessments include both formal and informal informative, persuasive, and special occasion\/entertainment speeches. Since students are required to give several speeches and provide peer feedback, consistent attendance and regular presentations are necessary for success in this course.<\/p>\n<h3><strong>Senior Only Electives<\/strong><\/h3>\n<h4>ENGLISH 12: LITERATURE AND FILM<\/h4>\n<p>0021       1 Semester         .5 Credit                            Grade 12 Only<\/p>\n<p>Through the study of literature and film, both classic and contemporary, students will use critical thinking skills to analyze and examine various social concepts, issues, and conflicts across multiple media. By exploring timeless themes, such as coming of age and film genres, such as film noir, students will gain insight into their own character and their surrounding environment. This course involves reading and analytical writing assignments and a variety of individual and group projects.  As class discussions are held frequently, engaged participation is a key component to this course.<\/p>\n<h4>ENGLISH 12:  EXPLORING SCIENCE FICTION AND FANTASY LITERATURE CHS<\/h4>\n<p>0013       1 Semester            .5 Credit                       Grade 12 Only<\/p>\n<p>Exploring Science Fiction and Fantasy Literature is a reading and writing intensive course that examines science fiction and fantasy across multiple media, including literature, film, television, comics, and games. Students will survey the history of science fiction and trace the way each creator has responded to changing social conditions. Students are expected to read and respond critically to a variety of texts to deepen their understanding of these genres and their broad cultural impact. Students can also expect a variety of engaging class discussions and writing activities. Titles include Ray Bradbury’s <em>Fahrenheit 451<\/em>, selections from J.K. Rowling’s Harry Potter series, Tolkien’s <em>The Hobbit<\/em>, H.G. Wells’ <em>War of the Worlds<\/em>, and Douglas Adams’ <em>Hitchhiker’s Guide to the Galaxy<\/em>. Successful completion of this course makes students eligible for credit from SCCC’s College in the High School (CHS) program.<\/p>\n<p><em>Fee required for college credit.  Students may opt to take the course for high school credit only.<\/em><\/p>\n<h4>ENGLISH 12: THE SHORT STORY<\/h4>\n<p>0026<em>       <\/em>1 Semester           .5 Credit                       Grade 12 Only<\/p>\n<p>This course aims to introduce students to the art of short fiction while exploring a selection of classic and contemporary short stories. Through close reading, critical analysis, class discussions, and creative activities, students will develop an understanding of the elements that make short stories effective and impactful.<\/p>\n<h4>ENGLISH 12:  SPORTS RHETORIC AND WRITING CHS<\/h4>\n<p>0029       1 Semester            .5 credit                       Grade 12 Only<\/p>\n<p>This course will delve deeply into the many ways that sports, and more specifically how we approach and consume the media surrounding sports, have influenced the modern literary and cultural landscape.  This course is not only for students who love to participate in sports themselves, but for those who are interested in unpacking the effect sports can have on a local, national, and global level.  So much of sports extends beyond the fields, courts, and scoreboards; this course will examine the stories that sports can tell us about each other and ourselves.<\/p>\n<p><em>Fee required for college credit.  Students may opt to take the course for high school credit only.<\/em><\/p>\n<h4>ENGLISH 12:  COLLEGE COMPOSITION CHS<\/h4>\n<p>0014       1 Semester            .5 Credit                       Grade 12 Only<\/p>\n<p>This course challenges students to sharpen their writing skills for college level writing tasks. It includes conferencing, revision, and editing to improve writing. Students are responsible for selecting topics, participating in peer editing, selecting pieces for evaluation, seeking strategies for editing, setting goals for writing, etc.  Students will read articles, essays, and fictional pieces to study craft to write more effectively.  Successful completion of this course makes students eligible for credit from SUNY Adirondack’s College in the High School (CHS) program for ENG 101.<\/p>\n<p><em>Fee required for college credit.  Students may opt to take the course for high school credit only<\/em>. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>English Department Head: Brigette Gallagher (ext. 33319) Progressions and Thematic Strands For graduation, students must have 4 years of English credit:  In grades 10-12, there are honors\/AP options In grades 9-11, students can take English courses as electives Students MUST be enrolled in a full year of English 12 either with two semester courses or &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;English Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4144","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>English Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"English Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"English Department Head: Brigette Gallagher (ext. 33319) Progressions and Thematic Strands For graduation, students must have 4 years of English credit:  In grades 10-12, there are honors\/AP options In grades 9-11, students can take English courses as electives Students MUST be enrolled in a full year of English 12 either with two semester courses or &hellip; Continue reading &quot;English Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-01-06T17:38:18+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\",\"name\":\"English Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:22:28+00:00\",\"dateModified\":\"2025-01-06T17:38:18+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"English Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"English Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"English Department Courses - Saratoga City School District","og_description":"English Department Head: Brigette Gallagher (ext. 33319) Progressions and Thematic Strands For graduation, students must have 4 years of English credit:  In grades 10-12, there are honors\/AP options In grades 9-11, students can take English courses as electives Students MUST be enrolled in a full year of English 12 either with two semester courses or &hellip; Continue reading \"English Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-01-06T17:38:18+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/","name":"English Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:22:28+00:00","dateModified":"2025-01-06T17:38:18+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/english-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"English Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4144","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4144"}],"version-history":[{"count":8,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4144\/revisions"}],"predecessor-version":[{"id":9746,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4144\/revisions\/9746"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4144"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}