{"id":4149,"date":"2022-12-06T11:25:17","date_gmt":"2022-12-06T16:25:17","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4149"},"modified":"2024-12-20T13:34:25","modified_gmt":"2024-12-20T18:34:25","slug":"mathematics-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/","title":{"rendered":"Mathematics Department Courses"},"content":{"rendered":"<p>The Mathematics Department offers preparation in the concepts and skills necessary for competence in mathematics and for further study.  All courses in mathematics increase understanding of the basic concepts of mathematics and problem solving.<\/p>\n<p><strong>Math Department Head:<\/strong> Robin Chudy  (ext. 33318)<\/p>\n<p><strong>Graduation Requirements<\/strong><\/p>\n<p>All students are required to earn three credits in high school mathematics to graduate. Students must meet the New York State requirement by passing the Algebra 1 Regents examination. Students must be enrolled in a math course from grades 9-11.  No student may drop a math course altogether (without enrolling in another) unless they have successfully completed the minimum graduation requirement of three years\/three credits.<\/p>\n<h3>Mathematics Progressions<\/h3>\n<table style=\"height: 114px; width: 100%; border-collapse: collapse;\" border=\"1\">\n<tbody>\n<tr style=\"height: 26px;\">\n<td style=\"width: 21.2069%; height: 26px;\"><strong>Program<\/strong><\/td>\n<td style=\"width: 18.7931%; height: 26px;\"><strong>Grade 9 <\/strong><\/td>\n<td style=\"width: 20%; height: 26px;\"><strong>Grade 10 <\/strong><\/td>\n<td style=\"width: 20%; height: 26px;\"><strong>Grade 11<\/strong><\/td>\n<td style=\"width: 20%; height: 26px;\"><strong>Grade 12<\/strong><\/td>\n<\/tr>\n<tr style=\"height: 10px;\">\n<td style=\"width: 21.2069%; height: 10px;\"><strong>Regents Math<\/strong><\/td>\n<td style=\"width: 18.7931%; height: 10px;\">Algebra 1<\/td>\n<td style=\"width: 20%; height: 10px;\">Geometry<\/td>\n<td style=\"width: 20%; height: 10px;\">Algebra 2<\/td>\n<td style=\"width: 20%; height: 10px;\">\n<p>PCAT Or<\/p>\n<p>Pre-Calc Honors Or<\/p>\n<p>College Stats Or<\/p>\n<p>AP Stats<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 26px;\">\n<td style=\"width: 21.2069%; height: 26px;\"><strong>Regents Math<\/strong><\/td>\n<td style=\"width: 18.7931%; height: 26px;\">Algebra 1 w\/lab<\/td>\n<td style=\"width: 20%; height: 26px;\">Geometry w\/lab<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>Topics in Algebra 2 Or<\/p>\n<p>Financial Algebra<\/p>\n<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>Financial Algebra Or<\/p>\n<p>College Stats  Or<\/p>\n<p>AP Stats<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 26px;\">\n<td style=\"width: 21.2069%; height: 26px;\"><strong>Regents Math<\/strong><\/td>\n<td style=\"width: 18.7931%; height: 26px;\">Algebra 1 w\/lab<\/td>\n<td style=\"width: 20%; height: 26px;\">Geometry w\/lab<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>Topics in Algebra 2 Or<\/p>\n<p>Financial Algebra<\/p>\n<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>Financial Algebra Or<\/p>\n<p>College Stats  Or<\/p>\n<p>AP Stats<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 26px;\">\n<td style=\"width: 21.2069%; height: 26px;\"><strong>Honors Math<\/strong><\/td>\n<td style=\"width: 18.7931%; height: 26px;\">Geometry Honors<\/td>\n<td style=\"width: 20%; height: 26px;\">Algebra 2 Honors<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>Pre-Calc. Honors Or<\/p>\n<p>College Stats Or<\/p>\n<p>AP Stats<\/p>\n<\/td>\n<td style=\"width: 20%; height: 26px;\">\n<p>AP Calc BC Or<\/p>\n<p>AP Calc AB Or<\/p>\n<p>Calculus  Or<\/p>\n<p>College Stats Or<\/p>\n<p>AP Stats<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h4>MATH ACADEMIC INTERVENTION SERVICES (AIS)<\/h4>\n<p>0756        Full Year                No Credit                               Grade 9-11<\/p>\n<p>This course is designed to assist those students who have not passed or are in danger of not passing the Algebra 1 Regents exam. This mandated course analyzes the strengths and weaknesses of each student and remediates them with the goal of passing the Algebra 1 Regents exam which is a graduation requirement.<\/p>\n<h4>ALGEBRA 1<\/h4>\n<p>0230n        Full Year                 1 Credit                                       Grade 9<\/p>\n<p>This course addresses the curriculum outlined by the Next Gen State Standards. Topics that are emphasized include performing arithmetic operations on polynomials, creating equations that describe numbers or relationships, solving equations and inequalities in one variable, solving, and representing equations and inequalities graphically, functions and function notation, and interpreting functions that arise in applications A graphing calculator is required and the TI-84+C Silver Edition is the preferred model. Students will sit for the Algebra 1 Regents exam in June.<\/p>\n<h4>ALGEBRA 1 WITH LAB<\/h4>\n<p>0231nl        Full Year                1 Credit                                Grade 9-10<\/p>\n<p>This course is designed to cover the Algebra 1 Next Gen curriculum with extra time built into the schedule to allow for further practice, activities, and the strengthening of math skills. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. Students will sit for the Algebra 1 Regents exam in June.<\/p>\n<h4>GEOMETRY<\/h4>\n<p>0225n        Full Year                1 Credit                                       Grade 10<\/p>\n<p>This course addresses the curriculum outlined by the Next Gen State Standards. Topics that are emphasized include proving geometric theorems, congruency, similarity, trigonometric ratios and solving problems involving right triangles, coordinate geometry, and applying geometric concepts in modeling situations. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition.  Students will sit for the Geometry Regents exam in June.<\/p>\n<p><em>Recommended preparation: Algebra 1 or Algebra 1 with Lab<\/em><\/p>\n<h4>GEOMETRY WITH LAB<\/h4>\n<p>0226nl       Full Year                1 Credit                                       Grade 10<\/p>\n<p>This course is designed to cover the Geometry Next Gen curriculum with extra time built into the schedule to allow for further practice, activities, and strengthening math skills. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. Students will sit for the Geometry Regents in June.<\/p>\n<p><em>Recommended preparation: Algebra 1 or Algebra 1 with Lab<\/em><\/p>\n<h4><em> <\/em>GEOMETRY HONORS<\/h4>\n<p>0224nh        Full Year             1 Credit                                    Grades 9- 10<\/p>\n<p>The course of study outlined in Geometry will be enriched to include more extensive\/rigorous proof and applications. This course is for students who excel in math and science, and who plan to pursue further study in math, science, and\/or technology. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. Students will sit for the Geometry Regents exam in June.<\/p>\n<p><em>Recommended preparation: Algebra 1 with a 90+ average<\/em><\/p>\n<h4>PRE-CALCULUS AND ADVANCED TOPICS (PCAT)<\/h4>\n<p>0256        Full Year          1 Credit                                      Grades 11-12<\/p>\n<p><em>This course follows our Algebra 2 curriculum and is designed to give students an introduction to a variety of Pre-Calculus topics.  This course will give students who may struggle with the rigor of a true pre-calculus course an algebra option, giving seniors who enroll an advantage as they enter college.  Topics include polynomials, rational functions, exponential and logarithmic equations, and trigonometry.  A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. <\/em><\/p>\n<p><em> Recommended preparation: Algebra 2 or Topics in Algebra 2<\/em><\/p>\n<h4>FINANCIAL ALGEBRA<\/h4>\n<p>0250        Full Year            1 Credit                                    Grades 11-12<\/p>\n<p>Each course lesson is aligned to at least one Common Core State Standard in mathematics. Sample topics of study include the stock market, business math, banking services, consumer credit and automobile and home ownership. Algebra 1 skills are reinforced throughout the curriculum. This course includes projects and various applications that are relevant to the curriculum.  There is a local final exam or project.<\/p>\n<p><em>Recommended preparation: Two credits of high school math<\/em><\/p>\n<h4>TOPICS IN ALGEBRA 2<\/h4>\n<p>0208        Full Year             1 Credit                                   Grades 11-12<\/p>\n<p>This course satisfies the required third year of mathematics and is recommended for those students who have experienced difficulties in Geometry and\/or Algebra 1. Topics include the studying of quadratic functions, imaginary and complex numbers, rational exponents, rational equations, regression analysis, along with polynomial, exponential, logarithmic, absolute value, and radical functions.<\/p>\n<p><em>Recommended preparation: Geometry or Geometry with Lab<\/em><\/p>\n<p><em>This course does not culminate in the Algebra 2 Regents Exam<\/em><\/p>\n<h4>ALGEBRA 2<\/h4>\n<p>0214n        Full Year              1 Credit                                   Grade 10-12<\/p>\n<p>This is the capstone course in the three-year sequence towards the Regents Diploma with Advanced Designation. This course expands on many of the topics and themes covered in Algebra 1 and Geometry. Topics include extending the study of linear, quadratic, and exponential functions while honing the ability to model situations. This course also extends the solving of equations to include solving quadratic equations over the set of complex numbers and solving exponential equations using the properties of logarithms. Students will also build on their previous work in trigonometry to build fluency with trigonometric ratios and to model using trigonometric functions. The course will also focus on statistics and analysis. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. Students will sit for the Algebra 2 Regents Exam.<\/p>\n<p><em>Recommended preparation: Geometry.<\/em><\/p>\n<h4>ALGEBRA 2 HONORS<\/h4>\n<p>0213nh        Full Year            1 Credit                                    Grades 10-11<\/p>\n<p>This course is more challenging than Algebra 2 and is designed for students who excel in math and science, and who plan to pursue further study in math, science, and\/or technology. Topics include those of Algebra 2 but will be enriched to include more extensive study and applications. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition.  Students will sit for the Algebra 2 Regents Exam.<\/p>\n<p><em>Recommended preparation: Geometry Honors with an 85+ average.<\/em><\/p>\n<h4>PRE-CALCULUS HONORS<\/h4>\n<p>0206        Full Year           1 Credit                                       Grade 11-12<\/p>\n<p>This course is designed to prepare students for AP Calculus AB or AP Calculus BC. It is recommended for college bound students who are considering studying engineering, science, computer science, and\/or mathematics. Topics of study include polynomial, rational, exponential, logarithmic, and trigonometric functions, conics, limits, polar and parametric equations.  A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. <em>Recommended preparation: Algebra 2 Honors<\/em><\/p>\n<h4>AP CALCULUS AB<\/h4>\n<p>0201        Full Year           1 Credit                                             Grade 12<\/p>\n<p>AP Calculus AB is a college-level calculus course. Students cultivate their understanding of differential and integral calculus through engaging with real-world problems represented graphically, numerically, analytically, and verbally and using definitions and theorems to build arguments and justify conclusions as they explore concepts like change, limits, and the analysis of functions.  It is recommended that students take the AP Calculus AB examination. The TI-84+C Silver Edition graphing calculator is required.<\/p>\n<p><em>Recommended preparation: Pre-Calculus Honors. AP Calculus placement should be made with input from your current math teacher.<\/em><\/p>\n<h4>AP CALCULUS BC<\/h4>\n<p>0200        Full Year         1 Credit                                               Grade 12<\/p>\n<p>AP Calculus BC is more extensive than AP Calculus AB. Topics include differentiation, applications of the derivatives, the definite integral, transcendental functions, techniques of integration, applications of a definite integral, geometry in the plane, sequences and series and elementary differential equations. Success in this course requires advanced mathematics skills and extra preparation. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. There will be a local final exam.   It is recommended that students take the AP Calculus BC examination.<\/p>\n<p><em>Recommended preparation: Pre-Calculus Honors. AP Calculus Placement should be made with input from your current math teacher. <\/em><\/p>\n<h4>CALCULUS<\/h4>\n<p>0202       Full Year                 1 Credit                          Grades 11-12<\/p>\n<p>This course provides substantial instruction in differential and integral calculus with applications to add meaning. Topics include analytic geometry review, limits, differential and integral calculus, and applications. A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. There will be a local final exam.<\/p>\n<p><em>Prerequisite:   Pre-Calculus (with a recommended 85+ average) <\/em><\/p>\n<h4>AP STATISTICS<\/h4>\n<p>0203        Full Year         1 Credit                                      Grades 11-12<\/p>\n<p>AP Statistics is equivalent to a one-semester introductory college statistics course. Students will concentrate their study on four broad conceptual themes:<\/p>\n<ol>\n<li>Exploring data: describing patterns and departures from patterns<\/li>\n<li>Sampling and experimentation: planning and conducting a study<\/li>\n<li>Anticipating patterns: exploring random phenomena using probability and simulation<\/li>\n<li>Statistical inference: estimating population parameters and testing hypotheses<\/li>\n<\/ol>\n<p>A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. There will be a local final exam.  It is recommended that students take the AP Statistics examination.<\/p>\n<p><em>Recommended preparation: Algebra 2<\/em><\/p>\n<h4>FOUNDATIONS FOR HIGHER MATHEMATICS<\/h4>\n<p>0205       Full Year 1 Credit                                            Grades 10-12<\/p>\n<p>This course is designed to help students who have passed Algebra I but struggled with the material and would like to strengthen their skills prior to taking a geometry course.  The curriculum is divided into topics including algebra, introductory geometry, and consumer mathematics. A Scientific calculator is required for this course.<\/p>\n<p><em>Required preparation: Algebra I  <\/em><\/p>\n<h4>COLLEGE STATISTICS CHS<\/h4>\n<p>0257        Full Year                 1 Credit                                   Grade 12<\/p>\n<p>This course includes recognizing the uses and abuse of everyday statistics and the quality and reliability of data. Emphasis is on the interpretation of numerical and graphical representations of existing and collected data.  Topics include variability, sampling and elementary design of experiments, elementary distributions, correlation and regression, elementary probability, Central Limit Theorem, elementary interference from samples and statistical significance.  A graphing calculator is required for this course and the recommended model is the TI-84+C Silver Edition. Successful completion of this course makes students eligible for credit from SUNY Adirondack for Mat 127 – Introductory Statistics with Probability. To receive the college credit, students must either get a 75 or higher on the Algebra 2 Regents exam or they must pass the Accuplacer at that same level.<\/p>\n<p><em>Fee required for college credit.  Students may opt to take the course for high school credit only.<\/em><em>  <\/em><\/p>\n<p><em>Recommended Preparation: Algebra 2.<\/em><\/p>\n<p><strong>Calculators<\/strong><\/p>\n<p>Graphing calculators are required on the New York State Regents examinations in Algebra 1, Geometry, and Algebra 2, and all Advanced Placement examinations. The TI-84+C is recommended for student use.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Mathematics Department offers preparation in the concepts and skills necessary for competence in mathematics and for further study.  All courses in mathematics increase understanding of the basic concepts of mathematics and problem solving. Math Department Head: Robin Chudy  (ext. 33318) Graduation Requirements All students are required to earn three credits in high school mathematics &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Mathematics Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4149","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Mathematics Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Mathematics Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The Mathematics Department offers preparation in the concepts and skills necessary for competence in mathematics and for further study.  All courses in mathematics increase understanding of the basic concepts of mathematics and problem solving. Math Department Head: Robin Chudy  (ext. 33318) Graduation Requirements All students are required to earn three credits in high school mathematics &hellip; Continue reading &quot;Mathematics Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-20T18:34:25+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\",\"name\":\"Mathematics Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:25:17+00:00\",\"dateModified\":\"2024-12-20T18:34:25+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Mathematics Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Mathematics Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Mathematics Department Courses - Saratoga City School District","og_description":"The Mathematics Department offers preparation in the concepts and skills necessary for competence in mathematics and for further study.  All courses in mathematics increase understanding of the basic concepts of mathematics and problem solving. Math Department Head: Robin Chudy  (ext. 33318) Graduation Requirements All students are required to earn three credits in high school mathematics &hellip; Continue reading \"Mathematics Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-20T18:34:25+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/","name":"Mathematics Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:25:17+00:00","dateModified":"2024-12-20T18:34:25+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/mathematics-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Mathematics Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4149","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4149"}],"version-history":[{"count":21,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4149\/revisions"}],"predecessor-version":[{"id":9699,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4149\/revisions\/9699"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4149"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}