{"id":4155,"date":"2022-12-06T11:28:43","date_gmt":"2022-12-06T16:28:43","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4155"},"modified":"2024-12-20T10:18:42","modified_gmt":"2024-12-20T15:18:42","slug":"science-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/","title":{"rendered":"Science Department Courses"},"content":{"rendered":"<p>Students must complete three units and one Regents exam in science to graduate with a Regents Diploma. Of the three units, one must be from the living environment curriculum and one from the physical setting curriculum.  Students pursuing a Regents Diploma with Advanced Designation must pass two Regents exams (one physical science and one life science).<\/p>\n<p><strong>Science Department Head:<\/strong> Erin Bell (ext. 33110)<\/p>\n<h3><span>Science Progressions<\/span><\/h3>\n<p><strong>Grade 9<\/strong>: Living Environment or Earth Science<\/p>\n<p><strong>Grade 10<\/strong>: Earth Science or Chemistry<\/p>\n<p><strong>Grade 11:<\/strong> Chemistry, Physics, or Science Elective<\/p>\n<p><strong>Grade 12:<\/strong> Physics, AP Science, or Science Elective<\/p>\n<h3>Science Electives<\/h3>\n<ul>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">PLTW Biomedical Engineering Courses<\/div>\n<\/li>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">Science Research (3 Year Program)<\/div>\n<\/li>\n<li>Sustainability Studies<\/li>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">College Environmental Science<\/div>\n<\/li>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">Forensics<\/div>\n<\/li>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">Natural Disasters<\/div>\n<\/li>\n<li>\n<div class=\"x_x_elementToProof x_FluidPluginCopy\">Astronomy<\/div>\n<\/li>\n<li>AP Biology<\/li>\n<li>AP Chemistry<\/li>\n<\/ul>\n<ol><\/ol>\n<h3><strong>CORE SCIENCES<\/strong><\/h3>\n<p>A well-rounded foundation in science is important to prepare students for college.  We strongly recommend that students take one course in each of the four core subjects before taking a second course (usually AP) in any one subject.<\/p>\n<h4>LIFE SCIENCE BIOLOGY<\/h4>\n<p>0334        Full Year         1 Credit                                         Grades 9-11<\/p>\n<p>Life Science: Biology follows the New York State Science Learning Standards. Emphasis is placed on the science practices of argumentation, modeling, data analysis, and scientific investigations to understand human body regulation, genetics, changes in populations over time and ecosystem dynamics. Students will be expected to use data, evidence and biology principles to explain phenomena. This course has a mandatory 1200-minute lab requirement and culminates with a required Regents Exam in June.<\/p>\n<h4>LIVING ENVIRONMENT ESSENTIALS<\/h4>\n<p>0335a        Full Year       1 Credit                                          Grades 10-12<\/p>\n<p>This course is designed for students who need additional support in preparing for the Regents exam in Biology after successfully completing the course. The objective of this course is to utilize and improve literacy skills through biology themes. Students will explore the principles of biology, build connections, and improve science literacy. In addition, students will conduct an array of experiments and activities to deepen their understanding and improve performance on the Regents Exam. <\/p>\n<h4>EARTH  AND SPACE SCIENCE<\/h4>\n<p>0357        Full Year          1 Credit                                          Grade 9-10<\/p>\n<p>Earth and Space Science is a Regents course that follows the New York State Science Learning Standards with a strong emphasis on scientific inquiry, data analysis, and critical thinking skills. Disciplinary Core Ideas cover major concepts related to Earth&#8217;s systems, including the structure of the Earth, the rock cycle, plate tectonics, weather systems, climate change, the solar system, and the universe. Scientific practices emphasize hands-on investigations, data collection and analysis, model building, and scientific argumentation to understand Earth and space phenomena. Crosscutting concepts Integrate concepts like patterns, cause and effect, systems and system interactions, stability and change to connect different aspects of Earth and space science. This course has a mandatory laboratory requirement and culminates with the required Earth Science Regents examination in June.<\/p>\n<p><em>Prerequisite: Biology<\/em><\/p>\n<h4>AP BIOLOGY<\/h4>\n<p>0303        Full Year        1 Credit                                               Grade 12<\/p>\n<p>AP Biology is an introductory college-level biology course that provides students with a foundation to support future advanced coursework in biology. Students will cultivate their understanding of biology through inquiry-based investigations as they explore content such as cellular processes, biochemical energy, genetics, evolution, and ecological interactions. A summer assignment will be required and utilized within the first week of school.<\/p>\n<p>Students will be encouraged and prepared to take the AP Biology exam given in May.<\/p>\n<p><em>S<\/em><em>tudents will be expected to complete the summer assignment. Prerequisite: Biology, Earth Science, Chemistry and Physics (or concurrent enrollment).<\/em><\/p>\n<h4>PRINCIPLES OF CHEMISTRY<\/h4>\n<p>0319        Full Year        1 Credit                                        Grades 10-12<\/p>\n<p>Principles of Chemistry is a full year non-Regents level chemistry course designed to provide a more project and problem-based learning approach to chemistry that is aligned to NGSS standards. Students will be exposed to a rich chemistry curriculum with the intent of preparing them for future science instruction in college. In addition to data collection and analysis, this course will provide opportunities for enhancing the soft skills, such as writing supporting statements and improving overall scientific literacy.<\/p>\n<h4>PHYSICAL SCIENCE: CHEMISTRY<\/h4>\n<p>0322        Full Year        1 Credit                                       Grades 10-12<\/p>\n<p>Regents Chemistry follows the New York State Science Learning Standards curriculum and is generally recommended for students planning on attending a four-year college. Topics of study include matter, energy, atomic and molecular structure, the periodic table, bonding, kinetics, equilibrium, acid\/base theory and nuclear chemistry. This course is theoretical, abstract, and quantitative. Students will be expected to use data, evidence and chemistry principles to explain phenomena. This course has a mandatory lab requirement and culminates with the required Chemistry Regents examination in June.<\/p>\n<p><em>Prerequisite: Biology, Earth Science. Recommended preparation: Geometry, and concurrent enrollment in Algebra 2.<\/em><\/p>\n<h4>PHYSICAL SCIENCE: CHEMISTRY HONORS<\/h4>\n<p>0322h        Full Year          1 Credit                                      Grades 10-11<\/p>\n<p>Honors Chemistry follows the New York State Science Learning Standards curriculum, as well as various additional topics. The pacing and depth of the course is more demanding than Regents Chemistry. Complex algebra and problem-solving skills will be utilized. Instruction centers on deeper, more rigorous science principles with intensity at the college level. Students are expected to be independent readers and learners of basic concepts related to this course. This course has a mandatory lab requirement and culminates with the required Chemistry Regents examination in June.<\/p>\n<p><em>Prerequisites: Biology, Earth Science. Recommended preparation: Geometry, and concurrent enrollment in Algebra 2 Honors.<\/em><\/p>\n<h4>AP CHEMISTRY<\/h4>\n<p>0302        Full Year              1 Credit                                           Grade 12<\/p>\n<p>AP Chemistry is an introductory college-level chemistry course that provides students with a foundation to support future advanced coursework in chemistry. Students will cultivate their understanding of chemistry through inquiry-based investigations as they explore content such as Chemical Reactions, Kinetics, Thermochemistry, Equilibrium, Acid sand Bases and Electrochemistry among others. A summer assignment will be required and assessed on the first day of school. Students will be encouraged and prepared to take the AP Chemistry exam given in May.<\/p>\n<p><em>Prerequisite: Living Environment, Earth Science. Recommended preparation: Algebra 2, or concurrent enrollment.<\/em><\/p>\n<h4>PHYSICAL SCIENCE: PHYSICS<\/h4>\n<p>0309       Full Year          1 Credit                                     Grades 11-12<\/p>\n<p>Regents Physics follows the New York State NYSLS Physics Curriculum.  Topics of study include mechanics, energy, electricity, magnetism, wave phenomena, and modern physics. This course emphasizes the meaning and implications of physical principles, as well as their mathematical treatment. Throughout the course, students will engage in hands-on laboratory activities and investigations to help them develop scientific inquiry and data analysis skills. Students in this course develop scientific models of real-world phenomena that are explained through the laws of physics. The curriculum also requires that students engage in explorations of crosscutting concepts, such as patterns, cause and effect, and systems and system models, and science and engineering practices. This course is an introductory, algebra-based physics course, designed primarily for students who intend to pursue a four-year college degree.  Successful completion of this course requires a strong background in Geometry and Algebra 2 concepts. Strong background in math is critical in this course. This course has a mandatory lab requirement and culminates with the Physics Regents Examination in June (required).<\/p>\n<p><em>Prerequisite: Biology, Earth Science, Chemistry.<\/em><\/p>\n<p><em>Recommended preparation: Algebra 2 and concurrent enrollment in Pre-calculus.<\/em><\/p>\n<h4>PHYSICS\/CHS<\/h4>\n<p>0307        Full Year                1 Credit<\/p>\n<p>CHS Physics is an algebra-based, introductory college-level physics course. Students will cultivate their understanding of physics through classroom study, in-class activity, and hands-on, inquiry-based laboratory work as they explore concepts like systems, fields, force interactions, and conservation. The course will cover some additional topics in the Regents curriculum. College credit is offered through SUNY Adirondack.<\/p>\n<p><em>Prerequisite: Biology, Earth Science, Chemistry.<\/em><\/p>\n<p><em>Fee required for college credit.  Students may opt to take the course for high school credit only.<\/em><\/p>\n<p><em>Recommended preparation: completion of Chemistry Honors and completion or concurrent enrollment of Pre-Calculus or AP Mathematics. <\/em><\/p>\n<h3><strong>SCIENCE ELECTIVE PATHWAYS<\/strong><\/h3>\n<p>Elective science courses are designed to be taken as a second science course or as a third science.<\/p>\n<p><strong>SCIENCE RESEARCH THREE YEAR PROGRAM<\/strong><\/p>\n<p><em>(University in the High School)<\/em><\/p>\n<p>0323-0325      3 Years        3 Credits                              Grades 10-12<\/p>\n<p><span>Taking Science Research is a unique high school experience that allows the student the opportunity to conduct original scientific research at the college level through the establishment of a mentorship with a professional investigator. In the sophomore year, students explore topics of interest, learn library research skills, and develop a plan for experimentation. In the junior year data is collected, and the analysis of results occurs. The Senior year is devoted to drawing conclusions and the presentation of findings to audiences in various formats. Up to 12 college credits can be earned in this course through an affiliation with the University at Albany.   More Information available: https:\/\/tinyurl.com\/TogaResearch<\/span><\/p>\n<p><em><u>Enrollment Requirements:<\/u><\/em> <em>Application essay\/interview and recommendation from current science teacher.<\/em><\/p>\n<p><span><em><u>Prerequisites:<\/u><\/em><\/span><span><em> Enrollment in the Science Research Program is based on the following: completion of grade 9, a willingness to commit to the three-year program, problem solving skills, analytical abilities, disciplined work habits, and the ability to adhere to deadlines. Students will be responsible for the college fees. <\/em><\/span><\/p>\n<h3><strong>PLTW BIOMEDICAL SCIENCE PATHWAY<\/strong><\/h3>\n<p>The recommended order of these courses is indicated below, however, if students are enrolled in or have completed Life Science: Biology, students can personalize the pathway to best fit their own interests. Each of these courses can be taken for college credit through Rochester Institute of Technology if desired. PLTW Capstone in the Technology Department can be taken as a Capstone course for this progression if all three courses are taken.<\/p>\n<h4>PRINCIPLES OF BIOMEDICAL SCIENCES (PLTW)<\/h4>\n<p>0037       Full Year 1 Credit                                                Grade 9-12<\/p>\n<p>Principles of Biomedical Sciences is the recommended first course in the Biomedical PLTW series. This course is designed for students interested in pursuing a career in the biological sciences, emergency services, healthcare, or medicine. In this course, students investigate the human body systems and various health conditions. Students explore lifestyle choices and medical treatments that might potentially prolong a person’s life.  The course culminates with a written exam. Students need to be concurrently enrolled in a Regents science class. <\/p>\n<p><em>Prerequisite: Completion of, or Co-enrollment in Biology<\/em><\/p>\n<h4>HUMAN BODY SYSTEMS (PLTW)<\/h4>\n<p>0341        Full Year 1 Credit                                             Grades 10-12<\/p>\n<p>The Human Body Systems (HBS) course is the recommended second course in the Biomedical PLTW series but can be taken outside of sequence. In this course students will explore the systems of the human body, by designing experiments to investigate the structures and functions that allow the body to move, protect from disease and react to stimuli.  Data software will be used to monitor various functions of the body such as reflexes, muscle movement and respiration. Students will play roles of biomedical professionals as they solve real world mysteries while playing the role of biomedical professionals. <\/p>\n<p><em>Prerequisite: Completion of, or Co-enrollment in Biology.<\/em><\/p>\n<h4>MEDICAL INTERVENTIONS (PLTW)<\/h4>\n<p>0347        Full Year                 1 Credit                            Grades 10-12<\/p>\n<p>Medical Interventions (PLTW) is the recommended third course in the Biomedical PLTW series but can be taken outside of sequence. In this course, the students will investigate how to prevent, diagnose, and treat diseases. Students will explore how to detect and fight infection; screen and evaluate human DNA for genetic disorders; investigate the cellular biology of cancer and evaluate cancer detection and treatment options; and explore different interventions for when organs of the body begin to fail. Through real-world cases, students will learn various biomedical lab skills and explore a range of biomedical interventions related to immunology, surgery, genetics, audiology, pharmacology, medical devices, and diagnostics. <\/p>\n<p><em>Prerequisite: <\/em><em>Completion of, or Co-enrollment in Biology.<\/em><\/p>\n<h3><strong>SCIENCE ELECTIVES<\/strong><\/h3>\n<h4>NATURAL DISASTERS I: METEOROLOGY<\/h4>\n<p>0339   1 Semester            .5 Credit                                Grades 10 -12<\/p>\n<p>This course will investigate atmospheric related natural disasters, including hurricanes, tornadoes, and other severe phenomenon. The impacts of these events on humans and the environment will be incorporated into study. Throughout this course, students will read about, conduct research, design, and complete laboratory activities, and be involved in projects designed around these catastrophic events (using both a current and a historical perspective).<\/p>\n<p><em>Content tag: Natural<\/em><em> Disasters is taught using real life examples of events that have occurred. This includes accounts and videos or images that may be graphic in nature. <\/em><\/p>\n<h4>NATURAL DISASTERS II: GEOLOGY<\/h4>\n<p>0340        1 Semester           .5 Credit                           Grades 10 -12<\/p>\n<p>Major geologic natural disasters including earthquakes, tsunamis and volcanoes will be examined. The impact that these natural disasters pose to people and the environment will also be studied. Students will be involved in problem-solving techniques and assignments using scientific inquiry, research, and reading to develop a better understanding of these events (through current and historical perspectives).<\/p>\n<p><em>Content tag: Natural<\/em><em> Disasters is taught using real life examples of events that have occurred. This includes accounts and videos or images that may be graphic in nature. <\/em><\/p>\n<h4>SUSTAINABILITY STUDIES<\/h4>\n<p>0353       Full Year              1 Credit                                Grades 11-12<\/p>\n<p>This course is based on current issues in environmental science, such as natural resource exploitation, impacts of climate change, human population growth, and pollution. Understanding chemical cycles, restoration ecology, and sustainable living practices will be necessary for exploring solutions to these environmental issues. The laboratory component of this course includes water and soil quality analysis, measurements of biodiversity, forestry methods, and GIS modeling. Students will participate in the school’s recycling program.<\/p>\n<p><em>Prerequisite:   Earth Science and\/or Biology.<\/em><\/p>\n<h4>ENVIRONMENTAL SCIENCE CHS<\/h4>\n<p>0346        Full Year              1 Credit                                 Grades 11-12<\/p>\n<p>This course involves the survey of the origin and effects of crucial environmental problems and scientific principles in treatment of such topics as population growth, resource depletion, industrial and municipal pollution, natural cycles of materials. This course fulfills the science requirement for non-science majors at most colleges. Students will participate in the school’s recycling program and will complete a final project.<\/p>\n<p><em>Prerequisite: Biology, Earth Science.<\/em><\/p>\n<p><em>College Credit: SUNY Adirondack. Fee required for college credit. Students must earn 80% or better to receive Chemistry 105 credit. Students may opt to take the course for only high school credit. <\/em><\/p>\n<h4>FORENSIC SCIENCE<\/h4>\n<p>0349        Full Year              1 Credit                                 Grades 10-12<\/p>\n<p>Forensic Science investigates a variety of topics including evidence classification, fingerprints, blood spatter, and time of death. Students will participate in laboratory activities, case studies and collaborative work to understand content. <\/p>\n<p><em>Content Tag: Forensic Science is taught with the use of true crime. This includes accounts and videos\/images that may be graphic in nature.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Students must complete three units and one Regents exam in science to graduate with a Regents Diploma. Of the three units, one must be from the living environment curriculum and one from the physical setting curriculum.  Students pursuing a Regents Diploma with Advanced Designation must pass two Regents exams (one physical science and one life &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Science Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4155","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Science Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Science Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Students must complete three units and one Regents exam in science to graduate with a Regents Diploma. Of the three units, one must be from the living environment curriculum and one from the physical setting curriculum.  Students pursuing a Regents Diploma with Advanced Designation must pass two Regents exams (one physical science and one life &hellip; Continue reading &quot;Science Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-20T15:18:42+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"11 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\",\"name\":\"Science Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:28:43+00:00\",\"dateModified\":\"2024-12-20T15:18:42+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Science Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Science Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Science Department Courses - Saratoga City School District","og_description":"Students must complete three units and one Regents exam in science to graduate with a Regents Diploma. Of the three units, one must be from the living environment curriculum and one from the physical setting curriculum.  Students pursuing a Regents Diploma with Advanced Designation must pass two Regents exams (one physical science and one life &hellip; Continue reading \"Science Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-20T15:18:42+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/","name":"Science Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:28:43+00:00","dateModified":"2024-12-20T15:18:42+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/science-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Science Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4155","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4155"}],"version-history":[{"count":11,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4155\/revisions"}],"predecessor-version":[{"id":9678,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4155\/revisions\/9678"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4155"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}