{"id":4158,"date":"2022-12-06T11:29:25","date_gmt":"2022-12-06T16:29:25","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4158"},"modified":"2024-12-23T12:14:35","modified_gmt":"2024-12-23T17:14:35","slug":"social-studies-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/","title":{"rendered":"Social Studies Department Courses"},"content":{"rendered":"<p>All students graduating from Saratoga Springs High School are required to complete a minimum of four units of social studies and the Regents Examination in Global History and Geography or U.S. History and Government.  Some students may choose to earn additional units by completing one or more social studies electives.<\/p>\n<p><strong>Social Studies Department Head:<\/strong> Ron Schorpp  (ext. 33315)<\/p>\n<p><strong>Graduation Requirements<\/strong><\/p>\n<p><em>Four Units including: <\/em>Global History and Geography, U.S. History and Government, Economics and Participation in Government.  One Regents Examination Global History and Geography and\/or U.S. History and Government.<\/p>\n<h3>Sample Social Studies Progressions<\/h3>\n<p><strong>Regents Progression<\/strong>: Global 1, Global 2, US History Participation in Government and Economics<\/p>\n<p><strong>Pre-AP\/Advance Placement Progression<\/strong> Global 9 Pre-AP, AP World History AP US History Or UHS United States History 1 &amp; 2, AP Macro or Public Policy in Modern America Or Principles of Macroeconomics<\/p>\n<h4>GLOBAL HISTORY AND GEOGRAPHY 1<\/h4>\n<p>0142        Full Year         1 Credit                                              Grade 9<\/p>\n<p>This course is designed to provide students with a survey of Global History from prehistoric times through 1750. Students will study the major events, ideas and individuals that have shaped the course of our human history. Topics covered in this course include the Ancient World (prehistory – 500 CE), The Expanding Zones of Exchange and Encounter (500 – 1200 CE), and the First Global Age (1450 – 1750 CE). Global History and Geography 1 is required for graduation and is the first course in a two-year sequence that is completed in Global History and Geography 2.<\/p>\n<h4>GLOBAL HISTORY AND GEOGRAPY 1 PRE AP<\/h4>\n<p>0140        Full Year         1 Credit                                              Grade 9<\/p>\n<p>This course is an introduction to the Advanced Placement World History curriculum. Pre-AP World History is a rigorous, fast-paced, and challenging class for motivated academic students. In addition to the themes covered in Global History and Geography 1, students will examine the changes and continuities over time that have shaped historical periods. This course also explores historical developments by delving into comparisons between major societies. Interested students should anticipate college-level reading and writing assignments on a regular basis. There is also a research-based component to the class.  Students who are successful in this course are encouraged to enroll in AP World History during their 10th grade year.<\/p>\n<p><em>Prerequisites: Teacher recommendation and writing sample (determined at middle school) <\/em><\/p>\n<h4>GLOBAL HISTORY AND GEOGRAPHY 2<\/h4>\n<p>0132        Full Year          1 Credit                                             Grade 10<\/p>\n<p>This course continues the examination of Global History from 1750 through the present. Students will explore the major events, ideas and personalities that have shaped the course of our human history. Topics include the growth of democracy, industry, revolutions, dictators, imperialism, nationalism, the world wars, and the Cold War. There is intensive study of the development of nations and conflicts from the end of World War II through the present. In addition, a thorough review of Global History 1 is included in preparing the students for the NYS Regents examination which covers both Global History 1 and this course. All students must pass this course as well as one social studies Regents examination in order to graduate.<\/p>\n<h4>AP WORLD HISTORY<\/h4>\n<p>0130        Full Year         1 Credit                                              Grade 10<\/p>\n<p>AP World History is a college level course designed to provide an intellectual challenge for students with advanced social studies reading, writing, and thinking skills.  The primary intent of the AP World History course is to teach the history of the world from a global perspective. This approach places emphasis on worldwide historical processes and connections among human societies. The course will highlight the nature of changes and continuities over time and their causes and consequences, as well as comparisons among major societies. AP World History will begin with the Age of Global Interaction (1250-1750) and conclude with the present day. Students will receive instruction in the required skills comparison, contextualization, document analysis, interpretation, synthesis, point of view, historical argumentation, analysis, and the evaluation of historical patterns of continuity and change over time. The course requires a significant commitment for reading and preparation outside the class. It is recommended that students take the AP World History examination.<\/p>\n<p><em>Recommended preparation:<\/em><em> Global 9 Pre-AP. <\/em><\/p>\n<h4>U.S. HISTORY AND GOVERNMENT<\/h4>\n<p>0122        Full Year         1 Credit                                                Grade 11<\/p>\n<p>This course is designed to provide students with a survey of American History and Government from colonial times to the present. Topics covered in this course include exploration, colonization, revolution, government building, sectionalism, manifest destiny, the Civil War, industrialization, immigration, imperialism, the world wars, the Cold War, and contemporary American issues. All students must pass both the course and one social studies Regents examination to graduate.<\/p>\n<h4>UNITED STATES HISTORY  UHS<\/h4>\n<p>0123        Fall Semester                               .5                               Grade 11<\/p>\n<p>This semester-long course is offered through a partnership with the University of Albany and will enable students to earn three college credits.  This course is a college-level United States History course that begins with the age of exploration and concludes with the end of reconstruction (1492-1877). In addition to an in-depth survey of early American history, this course will help students develop research and writing skills expected of first-year university students. Although there are no pre-requisites for this course, it is a rigorous college-level class. All UHS United States History 1 and 2 students are required to take the NYS US History and Government Examination in June.<\/p>\n<p><em>Requirements and college credit: This is an alternative to AP US History. Students are required to take both UHS US History 1 and 2 consecutively. College credit will be offered through the University of Albany. The SUNY Albany course listing is A HIS 100: American Political and Social History 1. Fee required for college credit. Students may opt to take the course for high school credit only. <\/em><\/p>\n<h4>UNITED STATES HISTORY UHS<\/h4>\n<p>0123        Spring Semester                                   .5                           Grade 11<\/p>\n<p>This semester-long course is offered through a partnership with the University of Albany and will enable students to earn three college credits.  This course is a college-level United States History course that begins with the age of exploration and concludes with the end of reconstruction (1492-1877). In addition to an in-depth survey of early American history, this course will help students develop research and writing skills expected of first-year university students. Although there are no pre-requisites for this course, it is a rigorous college-level class. All UHS United States History 1 and 2 students are required to take the NYS US History and Government Examination in June.<\/p>\n<p><em>Requirements and college credit: This is an alternative to AP US History. Students are required to take both UHS US History 1 and 2 consecutively. College credit will be offered through the University of Albany. The SUNY Albany course listing is A HIS 100: American Political and Social History 1. Fee required for college credit. Students may opt to take the course for high school credit only. <\/em><\/p>\n<h4>AP U.S. HISTORY<\/h4>\n<p>0120        Full Year         1 Credit                                               Grade 11<\/p>\n<p>This course is designed to challenge the academic student in American history. Students will study the history of the United States through a comprehensive chronological examination of the development of the nation’s political, economic, diplomatic, and social institutions from the colonial period to the present. Students should expect college level reading assignments in both primary and textbook formats, essay and survey paper writing, and various simulations and projects. All students in this course will also take the NYS Regents examination in U.S. History and Government at the completion of the school year. It is recommended that students take the AP US History examination.<\/p>\n<p><em>Required: A substantial summer reading and writing assignment. <\/em><\/p>\n<h4>PARTICIPATION IN GOVERNMENT<\/h4>\n<p>0102        1 Semester        .5 Credit                                         Grade 12<\/p>\n<p>This course is a state-mandated graduation requirement which focuses on the formulation, decision-making, implementation, and evaluation of public policy at the federal, state, and local levels of government. Avenues of citizen participation will be explored, with attention to the roles of the media, political parties, interest groups, elections, and voting in the political process. In lieu of a final exam, students will be expected to complete a final project with academic and community-based requirements.<\/p>\n<h4>ECONOMICS<\/h4>\n<p>0104        1 Semester        .5 Credit                                         Grade 12<\/p>\n<p>Students in this course will study the economic system of the United States and its operation. They will examine the economic interdependence of the world today and their role as workers, investors and voting citizens. Students will demonstrate a basic understanding of economic principles that will allow them to make informed decisions about our democracy and economy. Students must pass Economics to graduate.<\/p>\n<h4>PRINCIPLES OF MACROECONOMICS CHS<\/h4>\n<p>0115        Full Year                 1 Credit                                     Grade 12<\/p>\n<p>This full-year class offers students the opportunity to experience an actual college level Macroeconomics course and is offered as a dual enrollment class with SUNY Adirondack.  The class offers an examination of the current mixed American economic system, an introduction to economic theories and methods, the macroeconomic theory of national income analysis and fiscal policy, the nature of money and banking in the U.S., the Federal Reserve system and monetary policy, and economic growth.  Principles of Macroeconomics is an introduction to both the principles of this discipline and basic economic forces currently prevailing in the United States.  This course satisfies the graduation requirements for Economics and Participation in Government.<\/p>\n<p><em>College credit: SUNY Adirondack. Fee required for college credit. Students may opt to take the course for high school credit only.<\/em><\/p>\n<h4>AP MACROECONOMICS<\/h4>\n<p>0100        Full Year          1 Credit                                           Grade 12<\/p>\n<p>AP Economics\/Participation in Government is a yearlong course that provides the student with a complete understanding of the principles of economics and how these principles apply to an economic system in its entirety. To accomplish this, the curriculum places an emphasis on the study of national income and price determination. Also, the student will be expected to understand and use performance measures, economic growth, tools of fiscal and monetary policy and international economics in studying this course. Participation in Government components will focus on the formulation, decision-making, implementation, and evaluation of public policy at all levels of government. Avenues of citizen participation will be explored with attention to the roles of the media, political parties, interest groups, elections, and voting in the political process.  Although the macroeconomics course has heavy public policy content, this course will focus exclusively on government topics for the remainder of time after the AP Macroeconomics exam in May. In lieu of a final exam, each student will complete a final project with academic and community-based requirements. This course satisfies the graduation requirements for Economics and Participation in Government. It is recommended that students take the AP Macroeconomics examination.<\/p>\n<h4>PUBLIC POLICY IN MODERN AMERICA UHS<\/h4>\n<p>0114        Full Year                 1 Credit                                  Grade 12<\/p>\n<p>This year long class is offered through a partnership with University of Albany and will enable students to earn three college credits. This course focuses on the history of four major domestic policies: welfare, civil rights, economic policy, and health policy. Students assess the relevance of history to current political debates and analysis of public policy. Furthermore, the course will be taught through the lens of current events. Group workshops and debates will enable students to engage in active learning while grappling with these larger questions. This course satisfies graduation requirements for Economics and Participation in Government.<\/p>\n<p><em>College credit: University of Albany. Fee required for college credit.  Student may opt to take the course for high school credit only.<\/em><\/p>\n<h4>AP EUROPEAN HISTORY<\/h4>\n<p>0101        Full Year         1 Credit                                   Grades 11- 12<\/p>\n<p>This elective class is designed to be a culminating course in the Advanced Placement history sequence. Students will study the history of Europe through a comprehensive examination of the political, socio-economic, diplomatic, and cultural developments that shaped the continent from 1450 to the present. AP European History represents a rigorous college-level survey course and is reflective of the most current shifts in history curricula at the undergraduate level. While there are no prerequisites for entry into this course, it is strongly recommended that motivated academic students enroll. Students in AP European History should expect college level reading, writing, and research assignments. It is recommended that students take the AP European History examination.<\/p>\n<h4>AP PSYCHOLOGY <\/h4>\n<p>0109       Full Year            1 Credit                                 Grades 11-12<\/p>\n<p>The AP Psychology course is designed to introduce students to the systematic and scientific study of the behavior and mental processes of human beings and other animals. Students are exposed to the psychological facts, principles, and phenomena associated with each of the major subfields within psychology. They also learn about the ethics and methods psychologists use in their science and practice. Although there are no prerequisites for this course, AP Psychology is a rigorous college-level class that demands a high degree of interest on the part of enrolled students. It is recommended that students take the AP Psychology examination.<\/p>\n<h4>ANCIENT CIVILIZATION<\/h4>\n<p>0108       1 Semester            .5 Credit                          Grades 9-12<\/p>\n<p>This course is designed to delve deeper into the history of the ancient world than is possible in a traditional Global History or Pre-AP World History course. Students will focus on the history and culture of ancient Sumer, Egypt, Greece, and Rome. The course is also designed to allow students to research areas of interest, such as the development of ancient religions or the society of the Vikings. Taught through seminars, field trips, and collaborative projects, this class is valuable for those students who are interested in an in-depth study of the ancient world.<\/p>\n<h4>PSYCHOLOGY<\/h4>\n<p>0107        1 Semester         .5 Credit                              Grades 9-12<\/p>\n<p>This course is designed to introduce the student to the study of human behavioral and mental processes. Focus areas will include major theoretical perspectives that predominate in modern psychology such as research methods, the biological basis of behavior, different states of consciousness, learning and cognition, motivation and emotion, developmental psychology, and abnormal behavior. The student will learn to think analytically and improve critical thinking skills through case studies, simulations, interactive learning modules, professional journals, and class discussion. This is a valuable course for a student who may be interested in pursuing a career in the field of psychology.<\/p>\n<h4>SARATOGA SPRINGS LOCAL HISTORY<\/h4>\n<p>0113        1 Semester       .5 Credit                                   Grade 9-12<\/p>\n<p>This course provides students with an opportunity to study the history of their hometown in cooperation with the Historical Society of Saratoga Springs and other community-based organizations. The course will utilize group and individual projects, local field trips and guest speakers. Methods of study may include how to do historical research, how to take an oral history, and how to use primary sources in historical context. Students will have the opportunity to do a hands-on study of local history and gain a better understanding of the history aspect of the city’s slogan, “Health, History, Horses.”<\/p>\n<h4>SOCIOLOGY<\/h4>\n<p>0110        1 Semester          .5 Credit                              Grades 9-12<\/p>\n<p>This is a skills-based course that utilizes primary source materials from professional journals, magazines, and daily publications.  The framework of the course explores human and social interaction, behavioral patterns, and group influences. After an introductory unit on Sociology, the students will explore parenting and child development, the media’s influence on society, status in America, crime, the American family, and education. Student assessment will be through both group and individual projects in and out of class, field trips, essays, and analysis of professional studies. This course is an excellent option for those students majoring in social studies.<\/p>\n<h4>WAR AND DIPLOMACY 1<\/h4>\n<p>0111        1 Semester         .5 Credit                              Grades 9-12<\/p>\n<p>This course is designed to go beyond the scope of a traditional history survey course in its study of war and its effect on civilization. There is a major emphasis on student activities, projects, and discussions related to relevant topics and issues.  The focus will be on a study of the ethics, history, and impact of war on society using a variety of social, cultural, and military resources.  War and Diplomacy I covers the period of 1776-1919. <\/p>\n<h4>WAR AND DIPLOMACY 2<\/h4>\n<p>0112        1 Semester           .5 Credit                              Grades 9-12<\/p>\n<p>This is a course designed to go beyond the scope of a traditional history survey course in its study of war and its effect on civilization. There is a major emphasis on student activities, projects, and discussions related to relevant topics and issues. The focus will be on a study of the ethics, history, and impact of war on society using a variety of social, cultural, and military resources. War and Diplomacy II covers the period 1939 to the present.<\/p>\n<h4>EXPLORING TEACHING AS A PROFESSION UHS<\/h4>\n<p>0116        1 Semester            .5 credit                            Grades 11-12<\/p>\n<p>This half year course is offered through a partnership with the School of Education at the University of Albany and will enable students to explore teaching as a future career.  Students who are considering becoming educators will be immersed in the theory and practice of teaching.  We will delve into modern education with a major focus on the secondary school level.  This course emphasizes concepts of education, the changing role of teachers, restructuring schools, and teaching as a career pathway.  Students will also have the opportunity to work with current teachers to gain valuable classroom insights.  Furthermore, this course will examine theories of teaching and learning for the purpose of challenging assumptions about today’s schools and extending expectations concerning tomorrow’s schools.  Although there are no prerequisites for this class, it is a rigorous college-level course. <\/p>\n<p><em>College credit: University of Albany. Fee required for college credit. Students may opt to take the course for high school credit only.<\/em><\/p>\n<h4>INTRODUCTION TO PSYCHOLOGY UHS<\/h4>\n<p>0117        1 Semester            .5 Credit                         Grades 11- 12<\/p>\n<p>This half year course is offered through a partnership with NYS University system (SUNY) and is open to all 11<sup>th<\/sup> and 12<sup>th<\/sup> grade students interested in pursuing a college level psychology class. Students will study higher level methods and points of view in the scientific study of human behavior. Topics in this course will include biological bases of behavior, personality organization, intelligence, motivations, emotions, learning, and social relations.  Students will also explore fascinating psychological studies that delve into the deep recesses of the human mind.  Although there are no prerequisites for this class, it is a rigorous college-level course.<\/p>\n<p><em>College credit: University of Albany. Fee required for college credit. Students may opt to take the course for high school credit only.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>All students graduating from Saratoga Springs High School are required to complete a minimum of four units of social studies and the Regents Examination in Global History and Geography or U.S. History and Government.  Some students may choose to earn additional units by completing one or more social studies electives. Social Studies Department Head: Ron &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Social Studies Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4158","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Social Studies Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Social Studies Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"All students graduating from Saratoga Springs High School are required to complete a minimum of four units of social studies and the Regents Examination in Global History and Geography or U.S. History and Government.  Some students may choose to earn additional units by completing one or more social studies electives. Social Studies Department Head: Ron &hellip; Continue reading &quot;Social Studies Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-23T17:14:35+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"14 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\",\"name\":\"Social Studies Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:29:25+00:00\",\"dateModified\":\"2024-12-23T17:14:35+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Social Studies Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Social Studies Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Social Studies Department Courses - Saratoga City School District","og_description":"All students graduating from Saratoga Springs High School are required to complete a minimum of four units of social studies and the Regents Examination in Global History and Geography or U.S. History and Government.  Some students may choose to earn additional units by completing one or more social studies electives. Social Studies Department Head: Ron &hellip; Continue reading \"Social Studies Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-23T17:14:35+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/","name":"Social Studies Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:29:25+00:00","dateModified":"2024-12-23T17:14:35+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/social-studies-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Social Studies Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4158","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4158"}],"version-history":[{"count":8,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4158\/revisions"}],"predecessor-version":[{"id":9705,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4158\/revisions\/9705"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4158"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}