{"id":4160,"date":"2022-12-06T11:30:29","date_gmt":"2022-12-06T16:30:29","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4160"},"modified":"2025-01-06T12:42:41","modified_gmt":"2025-01-06T17:42:41","slug":"technology-department-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/","title":{"rendered":"Technology Department Courses"},"content":{"rendered":"<p>Students enrolled in the high school Career and Technical Education Program may choose a three- or five-unit sequence.  However, students who do not wish to pursue a CTE pathway may also take technology courses as electives.  Students pursuing a Regents Diploma with Advanced Designation may also elect to complete five units of business, family and consumer science, and technology electives in place of the World Language requirement. <\/p>\n<p><strong>Technology Department Head:<\/strong> Michael Gallagher  (ext. 33355)<\/p>\n<h3>Project Lead the Way (Pre-Engineering)  Sample Progression<\/h3>\n<p><strong>Grade 9, 10, 11, 12      <\/strong>              <\/p>\n<p><em><u>Prerequisite: STEM Academy<\/u><\/em><\/p>\n<ul>\n<li>(IED) Introduction to Engineering Design\n<ul>\n<li><em>If you are interested in taking this course but did not complete STEM Academy at the middle school, you may be admitted after the successful completion of non-PLTW Design and Drawing for Production.<\/em><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Grade 10, 11, 12<\/strong><\/p>\n<p><em><u>Prerequisite: Introduction to Engineering Design<\/u><\/em><\/p>\n<ul>\n<li>(CEA) Civil Engineering and Architecture\n<ul>\n<li><em>Does not require IED pre-requisite. Please see the course description for more information.<\/em><\/li>\n<\/ul>\n<\/li>\n<li>(CIM) Computer Integrated Manufacturing<\/li>\n<li>(DE) Digital Electronics<\/li>\n<li>(POE) Principles of Engineering<\/li>\n<li>(SE) Software Engineering<\/li>\n<\/ul>\n<p><strong>Grade 12<\/strong><\/p>\n<ul>\n<li>Capstone Course<\/li>\n<\/ul>\n<p><u>Prerequisites Engineering<\/u>: Students must have successfully completed Introduction to Engineering Design (PLTW) AND three of the six of the following courses: Computer Integrated Manufacturing, Digital Electronics, Civil Engineering Architecture, Principles of Engineering, Software Engineering, Computer Science, Python &amp; Multimedia.<\/p>\n<p><u>Prerequisites<\/u> <u>Biomedical:<\/u> Students who have successfully completed PLTW-Biomedical pathway including Principles of Biomedical Sciences, Human Body Systems, Medical Interventions.<\/p>\n<p><em>Students who have not met the above criteria may be considered for EDD pending a Math, Science, or Technology teacher recommendation and panel review.<\/em><\/p>\n<h3>Traditional Technology Sample Progression<\/h3>\n<p><strong> Grade 9, 10, 11, 12<\/strong><\/p>\n<p><em><u>Prerequisite: None<\/u><\/em><\/p>\n<ul>\n<li>Basic Principles of Construction (Full year)<\/li>\n<li>Materials Processing (1\/2 year)<\/li>\n<li>Small and Home Electronics (1\/2 year)<\/li>\n<li>Robotics 1 (1\/2 year)<\/li>\n<\/ul>\n<p><em> <\/em><em><u>Prerequisite: Materials Processing<\/u><\/em><\/p>\n<ul>\n<li>Advanced Woods (1\/2 year)<\/li>\n<li>Production Systems (1\/2 year)<\/li>\n<\/ul>\n<p><em><u>Prerequisite: Basic Principles of Construction<\/u><\/em><\/p>\n<ul>\n<li>Carpentry and Masonry (Full year)<\/li>\n<\/ul>\n<p><em> <\/em><em><u>Prerequisite: Robotics 1<\/u><\/em><\/p>\n<ul>\n<li>Robotics 2 (1\/2 year)<\/li>\n<\/ul>\n<p><em><u>Prerequisite: Civil Engineering and Architecture or Acceptable Art Credit<\/u><\/em><\/p>\n<ul>\n<li>Architectural Drawing (Full year)<\/li>\n<\/ul>\n<h3><strong>PLTW COURSES – TECHNOLOGY, SCIENCE AND MATH<\/strong><\/h3>\n<p>This is a high school pre-engineering and engineering technology program. Students who enroll in the program are also expected to complete a college preparatory sequence of courses in mathematics.  College credit may be applied for these courses. Any student expressing an interest in a single PLTW course out of sequence should demonstrate a strong math\/science background and an aptitude for the selected course. Approval by the department head or instructor will then be necessary.<\/p>\n<h4>INTRODUCTION TO ENGINEERING DESIGN  PLTW(IED)<\/h4>\n<p>0489        Full Year          1 Credit                                       Grades 9-12<\/p>\n<p>The Introduction to Engineering course (IED)<strong> <\/strong>introduces students to engineering concepts and the engineering design process. The course is designed to help students develop problems solving skills with emphasis placed on 3D solids modeling. Utilizing the Engineering Design process, students will work together in teams to solve problems and learn how to manage projects. Students learn how to use statistical analysis and mathematical modeling to solve problems. IED encourages students to consider ethical issues related to the challenges they face in the course.<\/p>\n<p><em>Prerequisite: STEM Academy or Design and Drawings for Production. Can be used for Fine Art requirements.<\/em><\/p>\n<p><em>College credit: Rochester Institute of Technology: Fee required for college credit<\/em><\/p>\n<h4>DIGITAL ELECTRONICS PLTW (DE)<\/h4>\n<p>(Offered in 2025-2027<\/p>\n<p>0492        Full Year       1 Credit                                       Grades 10-12<\/p>\n<p>This course is a study of electronic circuits that are used to process and control digital signals. Digital electronics is the foundation of all electronic devices such as cellular phones, laptop computers, digital cameras, and high-definition televisions. The major focus of the DE course is to expose students to the design process of combinational and sequential logic design, teamwork, communication methods, engineering standards, and technical documentation. Students are also exposed to circuit design tools used in industry, including logic gates, integrated circuits, and programmable logic devices.  This course is designed for students exploring a career in engineering or engineering technology.<\/p>\n<p><em>Prerequisite: Successful completion of Introduction to Engineering Design.<\/em><\/p>\n<p><em>College credit: Rochester Institute of Technology. Fee required for college credit.<\/em><\/p>\n<h4>CIVIL ENGINEERING\/ARCHITECTURE PLTW (CEA)<\/h4>\n<p>0496        Full Year        1 Credit                                       Grades 10-12<\/p>\n<p>The Civil Engineering and Architecture (CEA)<strong> <\/strong>course introduces students to the design and development of buildings and sites. The course covers a range of topics, including design, engineering practices, 3D architectural design software, professional skills, and career exploration. Students will work individually and in teams to solve problems, research zoning another relevant building codes, design structures and sites as well as explore the many systems that are an integral part of building construction.<\/p>\n<p><em>College credit: Rochester Institute of Technology. Fee required for college credit.<\/em><\/p>\n<h4>COMPUTER INTEGRATED MANUFACTURING PLTW (CIM)<\/h4>\n<p>0493        Full Year           1 Credit                                   Grades 10-12<\/p>\n<p>Computer Integrated Manufacturing transforms ideas into products. This course builds on basic engineering and design concepts while introducing the practical skills needed to create and market physical products. Students will explore the entire manufacturing process, from material selection and cost considerations to mold making, automation, and robotics. They will also learn how to integrate computer-aided design (CAD) and computer-aided manufacturing (CAM) to streamline production. In this hands-on course, students will enhance their modeling and hands on skills, tackling real-world challenges that bring their ideas to life. Students will engage in both the technical and creative aspects of manufacturing, gaining a comprehensive understanding of how to transform concepts into tangible products. As a result, they will explore how technology is shaping the future of manufacturing and learn to harness it for product development and production.<\/p>\n<p><em>Prerequisite: Successful completion of Introduction to Engineering Design.<\/em><\/p>\n<p><em>College credit: Rochester Institute of Technology. Fee required for college credit.<\/em><\/p>\n<h4>PRINCIPLES OF ENGINEERING PLTW (POE)<\/h4>\n<p>0491        Full Year         1 Credit                                     Grades 11-12<\/p>\n<p>A challenging broad-based survey course designed to help students understand the field of engineering and engineering technology and its career possibilities. Students will develop engineering problem-solving skills that are involved in post-secondary education programs and engineering careers. This course uses principles from math and science to solve engineering challenges.<\/p>\n<p><em>Prerequisite: Successful completion of Introduction to Engineering Design.<\/em><\/p>\n<p><em>College credit: Rochester Institute of Technology. Fee required for college credit.<\/em><\/p>\n<p><strong>PLTW CAPSTONE (FORMERLY ENGINEERING DESIGN AND DEVELOPMENT)<\/strong><\/p>\n<p>0494        Full Year            1 Credit                                           Grade 12<\/p>\n<p>PLTW Capstone (formerly Engineering Design and Development) provides students an opportunity to exercise skills developed in PLTW classes, other high school classes, and personal experiences. Students work in teams, using the unique knowledge and skills of each member to identify and solve a problem that is group derived. Students will complete research, design and test a prototype or model of your solution, evaluate your results, and analyze data—documenting each step along the way. Students present their work to a panel of engineers at the end of the year. <\/p>\n<p><em>Prerequisites Engineering: Students must have successfully completed Introduction to Engineering Design (PLTW) AND three of the six of the following courses: Computer Integrated Manufacturing, Digital Electronics, Civil Engineering Architecture, Principles of Engineering, Software Engineering, Computer Science, Python &amp; Multimedia.<\/em><\/p>\n<p><em> <\/em><em>Prerequisites Biomedical: Students who have successfully completed PLTW-Biomedical pathway including Principles of Biomedical Sciences, Human Body Systems, Medical Interventions.<\/em><\/p>\n<h4>DESIGN AND DRAWING FOR PRODUCTION<\/h4>\n<p>0474        Full Year               1 Credit                                  Grades 9-12<\/p>\n<p>This course teaches basic concepts and principles of technical drawing, projection, size description, pictorial representation, and similar processing techniques and tools. Students develop solutions to various design or product problems, and proposed solutions are researched, sketched, refined, and rendered as technical drawings. It is an excellent foundation for students wishing to take other technological courses.<\/p>\n<p><em>*Can be used for the fine arts requirement<\/em><\/p>\n<h4>BASIC PRINCIPLES OF CONSTRUCTION<\/h4>\n<p>0460        Full Year           1 Credit                                      Grades 9-12<\/p>\n<p>The Basic Principles of Construction course is designed as an introductory class for those interested in exploring the foundational concepts of the construction industry. This course provides a comprehensive overview of essential construction principles, including tool and job site safety protocols, and practical skills that are crucial in both residential and commercial building projects.<\/p>\n<p>Students will learn about construction materials, basic tools and equipment, blueprint reading, and the step-by-step processes involved in construction projects. Emphasis will be placed on understanding the importance of safety measures, teamwork, problem-solving, and effective communication on a job site. Through hands-on projects, demonstrations, and guided practice, students will develop a strong foundation in measuring, cutting, assembling, and finishing techniques. By the end of this course, students will have gained a practical skill set and a clear understanding of career opportunities in the construction field.<\/p>\n<h4>CARPENTRY AND MASONRY<\/h4>\n<p>0461        Full Year            1 Credit                                   Grades 10-12<\/p>\n<p>This is an advanced, hands-on course designed for students who have completed the prerequisite course <em>Basic Principles of Construction<\/em>. This course provides students with in-depth knowledge and practical experience in the field of carpentry, focusing on the skills and techniques needed to build, repair, and enhance wooden structures and furniture.<\/p>\n<p>Students will learn and apply essential carpentry skills such as blueprint reading, framing, cutting and joining wood, installation of doors and windows, and the use of carpentry tools and machinery. Emphasis will be placed on safety practices, project planning, and teamwork. Throughout the course, students will complete a series of individual and group projects that mirror real-world carpentry tasks, allowing them to develop problem-solving skills and attention to detail. By the end of the course, students will have gained the foundational expertise needed to pursue further studies in construction technology, trade apprenticeships, or entry-level carpentry work.<\/p>\n<p><em>Prerequisite: Basic Principles of Construction.<\/em><\/p>\n<h4>MATERIALS PROCESSING &#8211; WOOD<\/h4>\n<p>0472        1 Semester           .5 Credit                               Grades 9-12<\/p>\n<p><span data-olk-copy-source=\"MessageBody\">This course is designed to teach students how to design and develop a project from start to finish. Students will learn how to fully plan woodworking projects using technical drawings, cost estimates, and a plan of procedure. With a large emphasis on safety, hand and <\/span><span>primarily<\/span><span> <\/span><span>machine tools are utilized to carry out designs to a finished product while working in a fully functioning woodshop.<\/span><\/p>\n<h4>PRODUCTION SYSTEMS &#8211; WOOD<\/h4>\n<p>0486        1 Semester            .5 Credit                                Grades 9-12<\/p>\n<p>This course provides instruction on the systems of manufacturing and construction &#8211; their resources, processes, products and quality assurance, their impact on society, the economy, the environment, and manufacturing. Students will design and produce a saleable product. A scale model or structure will also be constructed.<\/p>\n<p><em>Prerequisite: Material Processing – Wood<\/em><\/p>\n<h4>ADVANCED MATERIALS<\/h4>\n<p>0479       1 Semester            .5 Credit                           Grades 10-12<\/p>\n<p>This is an in-depth and hands-on course dealing with processing methods, techniques, tools, and safety associated with custom wood working and metal fabrication. Students will utilize advanced methods of processing and forming and incorporate them into projects that they design and create. Students will also explore the diverse physical properties of different types of materials and be exposed to their unique and diverse applications. <\/p>\n<p><em>Prerequisite: Materials Processing <span data-olk-copy-source=\"MessageBody\">and or Carpentry <\/span><\/em><\/p>\n<h4>ARCHITECTURAL DRAWING<\/h4>\n<p>0469        Full year 1 Credit                                             Grades 11-12<\/p>\n<p>Architecture is both the process and the product of planning, designing, and constructing buildings and other physical structures.  This course is designed for students who might be considering a future in the field of architecture, design, or building construction management.  It will include college and career research, portfolio development, independent and group design projects, landscape design and city planning, exploration of design theories, and skill development in understanding and creating construction documents. <\/p>\n<p><em>Prerequisite: Completion of Civil Engineering and Architecture, or Portfolio Development 1<\/em><\/p>\n<h4>HOME &amp; SMALL ELECTRONICS<\/h4>\n<p>0478        1 Semester            .5 Credit                              Grades 9-12<\/p>\n<p>This course covers the fundamentals of DC and AC electric circuit theory.  It provides students with an understanding of small electronics and methods of analyzing circuits with a hands-on approach.  They will learn how to use circuit methodology to solve practical electrical problems.  This is an applications course with circuit techniques.  The course will also focus on the basic concepts of electrical and electronic devices, power supplies, as well as home electricity.  The laboratory will include experiments using computer simulations, measuring instruments, and electronic workstations. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Students enrolled in the high school Career and Technical Education Program may choose a three- or five-unit sequence.  However, students who do not wish to pursue a CTE pathway may also take technology courses as electives.  Students pursuing a Regents Diploma with Advanced Designation may also elect to complete five units of business, family and &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Technology Department Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4160","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Technology Department Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Technology Department Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Students enrolled in the high school Career and Technical Education Program may choose a three- or five-unit sequence.  However, students who do not wish to pursue a CTE pathway may also take technology courses as electives.  Students pursuing a Regents Diploma with Advanced Designation may also elect to complete five units of business, family and &hellip; Continue reading &quot;Technology Department Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-01-06T17:42:41+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\",\"name\":\"Technology Department Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:30:29+00:00\",\"dateModified\":\"2025-01-06T17:42:41+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Technology Department Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Technology Department Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/","og_locale":"en_US","og_type":"article","og_title":"Technology Department Courses - Saratoga City School District","og_description":"Students enrolled in the high school Career and Technical Education Program may choose a three- or five-unit sequence.  However, students who do not wish to pursue a CTE pathway may also take technology courses as electives.  Students pursuing a Regents Diploma with Advanced Designation may also elect to complete five units of business, family and &hellip; Continue reading \"Technology Department Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-01-06T17:42:41+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/","name":"Technology Department Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:30:29+00:00","dateModified":"2025-01-06T17:42:41+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/technology-department-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Technology Department Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4160","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4160"}],"version-history":[{"count":8,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4160\/revisions"}],"predecessor-version":[{"id":4391,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4160\/revisions\/4391"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4160"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}