{"id":4164,"date":"2022-12-06T11:32:28","date_gmt":"2022-12-06T16:32:28","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4164"},"modified":"2024-12-23T13:02:06","modified_gmt":"2024-12-23T18:02:06","slug":"career-and-technical-education-through-boces","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/","title":{"rendered":"Career and Technical Education through BOCES and New Visions"},"content":{"rendered":"<p>Career and Technical Education (CTE) programs provide hands-on learners with an opportunity to master academic and technical skills within a subject that interests them and leads to a rewarding career.<\/p>\n<p>The objectives of Career and Technical Education are:<\/p>\n<ul>\n<li>To acquire skills for employment<\/li>\n<li>To prepare students to earn National and State Industry Certifications<\/li>\n<li>To prepare students to pass an Industry-approved Technical Assessment<\/li>\n<li>To encourage students to continue their education through Articulation Agreements with colleges<\/li>\n<li>To prepare students for positions that are available in the region<\/li>\n<li>To provide credit toward graduation from high school<\/li>\n<li>To prepare for further trade, technical and\/or advanced training<\/li>\n<\/ul>\n<p>Students receive four credits each year of successful study in a Career and Technical program (three units in CTE and 1 unit in Math and English).<\/p>\n<p>The Career and Technical programs listed below will be offered at the F. Donald Myers Education Center.  Transportation is arranged so that students can take classes at Saratoga as well as the Career and Technical course.  Students are urged to visit the appropriate programs and the campus to help them understand the courses that are offered before they decide to attend.  Saratoga is committed to paying tuition for students who take these courses.  It is not always possible to provide other courses to replace a Career and Technical course that is dropped once the school year is underway. For these reasons, the students, parents\/guardians, and counselors should consider all the issues before deciding on a specific program.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Enrollment Process<\/strong><\/p>\n<p>Students must apply for the program of choice.  Upon receipt of the application, the student will be placed in a lottery for a seat in the program.  If you don’t receive a seat in your program of choice after the lottery, you will be placed on a waiting list for subsequent lotteries.<\/p>\n<h3>Approximate Program Hours<\/h3>\n<ul>\n<li>AM Session: 8:00 -10:30 am<\/li>\n<li>PM Session: 11:45 am – 2:15 pm<\/li>\n<\/ul>\n<p>Connect with WSWHE BOCES at <a href=\"http:\/\/www.wswheboces.org\">www.wswheboces.org<\/a><\/p>\n<h4>AUTO BODY<\/h4>\n<p>This is a two-year program based on Automotive Service Excellence (ASE) Task Lists for Painting and Refinishing and Non-Structural Analysis and Damage Repair.  The curriculum includes, but is not limited to body alignment, dent removal, welding, painting, refinishing, trim, glass work, shop operations, and safety training, use of computers, tools and technology.  Students apply their knowledge and skills in the state-of-the-art paint booth and mixing room and use the latest technology in our on-site shop. The program prepares students for entry-level employment in the auto body industry and to achieve Automotive Service Excellence (ASE) Certification after they have met all the requirements. Students are also prepared and encouraged to continue their education and training at post-secondary institutions and industry-supported training centers.<\/p>\n<h4>AUTOMOTIVE TECHNOLOGY<\/h4>\n<p>This is a two-year program based on the National Automotive Technician Foundation (NATEF) model for Maintenance and Light Repair.  The certification track is designed to graduate entry-level technicians with a broad skill set, a solid foundation in electrical\/electronics, and a general understanding of all automotive systems. The program offers live work on school-owned vehicles using high-tech equipment. Students benefit from strong relationships with industry partners that result in a wide variety of internships, equipment, and vehicle donations. <br \/>\nHeavy use of computers and high-tech equipment increases students&#8217; diagnostics and repair skills in the following areas: brakes, electrical and electronic systems, steering and suspension, engine repair, engine performance, manual drive train and axles, automatic transmission\/transaxle, heating, and air conditioning.<\/p>\n<h4>CONSTRUCTION TRADES<\/h4>\n<p>This is a two-year program based on the Residential Construction Academy Series.  Students obtain a basic knowledge of tools, methods, materials, and technologies currently used in the construction industry. Emphasis is placed on theory, as well as related math concepts. Practical experience is gained through on-site and community service-based construction projects throughout the year and students will also complete the construction of a modular home during the school year.  Students’ complete competency-based modules include small to large scale residential construction, safety, tools and equipment, blueprints, building materials, floors, walls, ceilings, stairs and roofing, window and doors, site layout, foundations, interior and exterior finishing, and project management.<\/p>\n<h4>COSMETOLOGY<\/h4>\n<p>This is a two-year, 1000-hour program dedicated to preparing students for current and emerging careers in the professions of natural hair styling, esthetics, nail specialty, and\/or cosmetology.  Cosmetology combines crucial elements of art, science, technical skills, interpersonal skills, and entrepreneurship. Students will adhere to all ethical and professional standards of the cosmetology industry.  Students are expected to participate, under supervision, in the actual operation of a full-service salon on each campus catering to real customers to gain management skills and customer service experience.  Curriculum includes commencement level math and English language arts. Upon successful completion of the 1,000-hour program, students are eligible to sit for the New York State Licensing exam to obtain a cosmetology license.<\/p>\n<h4>CRIMINAL JUSTICE STUDIES<\/h4>\n<p>This is a two-year program for students interested in careers in law enforcement, investigations, security, corrections, courts, law, social work and counseling, or other related fields. The comprehensive curriculum covers topics such as the study of crime, the foundations of law enforcement, the courts, emergency and fire management, introduction to criminal justice, legal aspects and the law, investigations, corrections, crime prevention, and interpersonal communications.  Students participate in mock trials, crime scene investigations, accident investigations, crime scene sketching, budget development, police reports, educational field trips, and community service projects. The curriculum is presented through classroom instruction, computer-based learning, and hands-on related activities and labs.<\/p>\n<h4>CULINARY ARTS AND HOSPITALITY<\/h4>\n<p>The Culinary Arts &amp; Hospitality Program at BOCES implements an industry-based program that includes kitchen basics, safety, and sanitation, purchasing and inventory control, customer service, and food and control cost. Students complete two years of instruction and pass national assessments during each year. They must also complete a minimum of ten hours of non-paid internship. Upon completion, the students are ready for careers in the hospitality industry and post-secondary opportunities. The curriculum includes basic food preparation, purchasing, inventory control, culinary nutrition and techniques, sanitation and workplace safety, hospitality management, front and back of house operations, menu planning and development, food and cost control, and marketing.<\/p>\n<h4>EARLY CHILDHOOD EDUCATION<\/h4>\n<p>This is a two-year program based on Child Development Associate (CDA) competencies and requirements and focuses on developing skills in early childcare and the education profession.  This program provides students with the opportunity to work with children three and four years old, under supervision, in an on-site preschool that is free to the community.  Students learn to provide guidance, promote positive and productive relationships with families, and will ensure well run childcare programs as well as learn to establish and maintain a safe, healthy learning environment, while nurturing the physical, intellectual, social, and emotional development of young children.<\/p>\n<h4>ENVIRONMENTAL CONSERVATION AND FORESTRY<\/h4>\n<p>This is a two-year program that aligns with the Society of American Foresters programs in forest technology standards and procedures.  The program emphasizes forest ecology and silviculture, forest management, woods safety, forest land usage, forest protection, fish and wildlife management, forest recreation, trends in urban forestry, and current and emerging environmental conservation issues.  Students spend over 75% of their time outdoors in “land labs.” These labs enable students to participate in approved projects that put theory into practice. There are several different types of land labs from entrepreneurial endeavors to community service projects.<\/p>\n<h4>GRAPHIC AND VISUAL COMMUNICATIONS<\/h4>\n<p>This is a two-year program based on current and future trends and practices in the industry with a concentration on Adobe Creative Suite applications, including Photoshop, Illustrator, and InDesign. Students learn the following applications and skills: basic layout and design for television, print and Internet, digital photography, illustration, audio and video editing, and animation. Students use state-of-the-art Apple computers and digital equipment to create multimedia projects. They receive comprehensive instruction with an emphasis on technical excellence in desktop publishing applications. In addition, students learn skills necessary to build, maintain, and grow client relationships.<\/p>\n<h4>HEALTH OCCUPATIONS<\/h4>\n<p>This is a two-year program that implements two state curriculums, Health Occupations (CORE) and Nurse Assisting. Skills &amp; Theory is designed to prepare students to render care in a variety of health care facilities as a nursing assistant. The program builds on skills and theory acquired through CORE care. For example, the course comprises entry-level skills related to anatomy and physiology and frequently seen abnormal conditions.  The second-year students will learn skills in Medical Office Assisting, phlebotomy, EKGs, computer applications, and central supply, in conjunction with supervised clinical experience at hospitals, nursing homes, physicians&#8217; offices, clinics, insurance companies, and community agencies.<\/p>\n<h4>HVAC-R<\/h4>\n<p>This is a two-year program aligned with the most current HVAC Excellence modules relevant for this geographic area and industry needs and trends. The program imparts skills and knowledge for the following areas: installation, service and repair of heating, air conditioning, and refrigeration equipment, systems in both residential and commercial applications, with emphasis on safety and Environmental Protection Agency (EPA) requirements and regulations.  The coursework integrates shop operations, job planning and estimating, customer service, professionalism, and ethics. The curriculum is enhanced by the Home Performance with the Energy Star Program, which helps students understand how the house works as a system.<\/p>\n<h4>HEAVY EQUIPMENT MAINTENANCE AND OPERATION<\/h4>\n<p>This is a two-year program based on the National Center for Construction Education and Research Contren Learning Series for Heavy Equipment and Repair.  Students learn to operate, maintain, diagnose, and repair construction-related equipment such as backhoes, bulldozers, bucket loaders, excavators, dump trucks, and skid steers. The program enjoys corporate collaboration with Milton, Caterpillar and Bobcat, among others, through which students receive specialized training at their corporate site, as well as instructional opportunities at our education centers, field trip experiences, internships, and job shadowing opportunities.  Students study the following modules throughout the program: introduction to trade, heavy equipment safety, identification of heavy equipment and basic operational techniques, tractors, grades and slopes, diesel engines, and hydraulics.<\/p>\n<h4>HORSE CARE<\/h4>\n<p>This is a two-year program that includes training of Standardbred horses for racing, using all related tack and equipment. Students learn the role of the caretaker, safety, professionalism, handling of horses, and breaking of yearlings. Students spend most of their time at the Saratoga Equine Sports Center where they learn and apply equine and veterinary science on Standardbred horses.  Students are given the opportunity to participate in a work-based learning experience, which exposes them to the operation of a business and specific job duties related to future careers. The curriculum includes equine systems, equine physiology, nutrition, health, disease, emergency medical care, stable management, bloodlines and breeding, and equine sales.<\/p>\n<h4>HORTICULTURE, LANDSCAPING AND FLORAL DESIGN<\/h4>\n<p>This is a two-year program aligns with the NYS Nursery &amp; Landscape Association and incorporates contemporary knowledge, skills, and trends found in the horticulture, floral, and landscaping industries.   Students design and implement landscaping for some of the area’s finest gardens. They operate and manage on-site greenhouses and floral shops that are open to the public, gaining hands on experience in retail sales, merchandising, customer service, and shop management.  The curriculum includes landscape design, floral design, greenhouse crop production, landscape installation and maintenance, ornamental horticulture, integrated pest management, plant biology, soil science, hydroponics, retail sales, merchandising and shop management.<\/p>\n<h4>SMALL ANIMAL SCIENCE<\/h4>\n<p>This is a two-year program based on Industry Standards from National Agricultural, Food &amp; Natural Resources. The Cornell University Veterinary Curriculum is used as the guide for developing topics to be covered. The program is integrated with ELA and math aligned to NYS Next Generation Standards.  Students completing the program successfully qualify to work as: Veterinary Technician degree, Veterinary Assistant, Veterinary Office Receptionist\/Office Staff, Small Business Owner, Groomer, Trainer, preparation for studies in Veterinary Science, and preparation for Veterinary Technician degree.<\/p>\n<h4>WELDING<\/h4>\n<p>This two-year Welding program is based on the American Welding Society (AWS) curriculum, which provides broad exposure to the operation, standards, and current practices in the field of welding and fabrication. Students learn through classroom instruction, demonstrations, field trips, guest speakers, and hands-on practice of welding techniques.<\/p>\n<h4><strong>NEW VISIONS HEALTH AND CAREERS EXPLORATION<\/strong><\/h4>\n<p>Admission to the New Visions Health Careers Exploration Program is competitive and highly selective. Students from 31 school districts compete for a limited number of Health Careers Exploration positions. Successful applicants must demonstrate solid academic ability, a commitment to continued education in the medical field, and strong study\/organizational skills.  Specific requirements include three years each of New York State Regents math, science, English, and social studies, advanced academic ability, strong study\/organizational skills, and a solid attendance record. Students accepted must provide a record of immunization and a physical examination report, attend a pre-employment orientation at the hospital as well as provide their own transportation to and from school and clinical sites. <\/p>\n<p>Classrooms are in the Wesley Health Care Center in Saratoga Springs and in the Sanford Street School in Glens Falls. Students meet for 3.5 hours daily, attend classroom instruction two days per week and do clinical rotations in a variety of health professions the other three days. Clinical rotations are assigned at Glens Falls Hospital, Saratoga Hospital, Wesley Health Care Center, and several private practices and clinics throughout the region. Students observe acute and routine medical procedures, as well as providing ancillary support services to patients.   The schedule will be 8:00 am to 11:30 am.<\/p>\n<p>Students receive one credit each for Anatomy &amp; Physiology, Health Careers Exploration, English 12 Honors, and one-half credit each for Economics and Participation in Government. Students also could earn three college credits through SUNY Adirondack by taking BIO109 &#8211; Medical Terminology.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Career and Technical Education (CTE) programs provide hands-on learners with an opportunity to master academic and technical skills within a subject that interests them and leads to a rewarding career. The objectives of Career and Technical Education are: To acquire skills for employment To prepare students to earn National and State Industry Certifications To prepare &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Career and Technical Education through BOCES and New Visions&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4164","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Career and Technical Education through BOCES and New Visions - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Career and Technical Education through BOCES and New Visions - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Career and Technical Education (CTE) programs provide hands-on learners with an opportunity to master academic and technical skills within a subject that interests them and leads to a rewarding career. The objectives of Career and Technical Education are: To acquire skills for employment To prepare students to earn National and State Industry Certifications To prepare &hellip; Continue reading &quot;Career and Technical Education through BOCES and New Visions&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-23T18:02:06+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\",\"name\":\"Career and Technical Education through BOCES and New Visions - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:32:28+00:00\",\"dateModified\":\"2024-12-23T18:02:06+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Career and Technical Education through BOCES and New Visions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Career and Technical Education through BOCES and New Visions - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/","og_locale":"en_US","og_type":"article","og_title":"Career and Technical Education through BOCES and New Visions - Saratoga City School District","og_description":"Career and Technical Education (CTE) programs provide hands-on learners with an opportunity to master academic and technical skills within a subject that interests them and leads to a rewarding career. The objectives of Career and Technical Education are: To acquire skills for employment To prepare students to earn National and State Industry Certifications To prepare &hellip; Continue reading \"Career and Technical Education through BOCES and New Visions\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-23T18:02:06+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/","name":"Career and Technical Education through BOCES and New Visions - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:32:28+00:00","dateModified":"2024-12-23T18:02:06+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/career-and-technical-education-through-boces\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Career and Technical Education through BOCES and New Visions"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4164","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4164"}],"version-history":[{"count":6,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4164\/revisions"}],"predecessor-version":[{"id":4402,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4164\/revisions\/4402"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4164"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}