{"id":4172,"date":"2022-12-06T11:36:48","date_gmt":"2022-12-06T16:36:48","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4172"},"modified":"2024-12-23T13:13:27","modified_gmt":"2024-12-23T18:13:27","slug":"saratoga-pathways-academy-courses","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/","title":{"rendered":"Saratoga Pathways Academy Courses"},"content":{"rendered":"<p>The SPA Program is an interdisciplinary, project-based learning program for students in grades 9-12. SPA students take their core classes in the state-of-the-art project-based learning center within the high school. They have access to individual laptops, a 3-D printer, and more of the latest in educational technology. SPA students engage in authentic projects that emphasize both content knowledge and success skills that help students become college and career ready. Students are exposed to a challenging yet rewarding curriculum as they develop problem-solving skills, critical thinking, creativity, innovation, collaboration, communication, and leadership. Projects offer students an opportunity to work interdisciplinary and often in conjunction with local businesses and organizations. SPA students also collect community involvement hours through service, internships, and job shadowing experiences. In addition to their courses in the program, students run a SPA student government, mock economic system, and coordinate with parents\/guardians and teachers about their own educational goals through the SPA TAPS committee.<\/p>\n<p>The SPA Program is open to students at the beginning of any of their high school years 9-12. Eligible students must be on track to receive a Regents Diploma with Advanced Designation. The following courses are offered for each grade as part of the SPA program. Please note, the humanities courses are co-taught by Social Studies and English teachers and therefore must be taken together.<\/p>\n<p><strong>Grade 9:<\/strong><\/p>\n<ul>\n<li>SPA Global History 1 Humanities<\/li>\n<li>SPA English 9 Humanities<\/li>\n<\/ul>\n<p><strong>Grade 10:<\/strong><\/p>\n<ul>\n<li>SPA Global History 2 Humanities<\/li>\n<li>SPA English 10 Humanities<\/li>\n<\/ul>\n<p><strong>Grade 11:<\/strong><\/p>\n<ul>\n<li>SPA United States History, Government &amp; Humanities<\/li>\n<li>SPA English 11 Humanities<\/li>\n<\/ul>\n<p><strong>Grade 12:<\/strong><\/p>\n<ul>\n<li>SPA Academy 12 Humanities (English 12 and SS)<\/li>\n<\/ul>\n<h4>SARATOGA PATHWAYS ACADEMY ENGLISH 9 HUMANITIES<\/h4>\n<p>0055       Full Year                1 Credit                                      Grade 9<\/p>\n<p>This course is aligned with Saratoga Pathways Academy Global Studies 9 Humanities. Students in SPA have 1:1 access to technology, a state-of-the-art classroom and project-based learning is the primary style of instruction. In this course students will study genres including poetry, drama, the novel, nonfiction, and short fiction. Students will read essays, articles, and literary criticism all related to various thematic units. They will explore the threads of moral code, empathy, the hero, and coming of age. Students will read classic works such as <em>Romeo and Juliet<\/em> by William Shakespeare, and Homer’s<em> Odyssey <\/em>as well as contemporary novels like <em>The Tao of Pooh <\/em>by Benjamin Hoff. Because SPA English 9 Humanities and SPA Global Studies 9 Humanities are taught together, the classes progress chronologically through the ages. Students will also select books from all genres to read on their own throughout the school year. Assignments will include research assignments, creative pieces, individual and group presentations, article annotations and responses, literary essays, and thesis papers. Vocabulary, grammar, and technical aspects of language will be addressed within the context of study of the literature and the student’s writing.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY ENGLISH 10 HUMANITIES<\/h4>\n<p>0056         Full Year                1 Credit                                  Grade 10<\/p>\n<p>This course is aligned with Saratoga Pathways Academy Global Studies 10 Humanities, and continues the curriculum started in Saratoga Pathways Academy English 9 Humanities. Students in SPA have 1:1 access to technology, a state-of-the-art classroom, and project-based learning is the primary style of instruction. In this course students will study genres including poetry, drama, the novel, nonfiction, and short fiction. Students will read essays, articles, and literary criticism all related to various thematic units, and study literary selections representing numerous cultures and traditions.  Students will engage in an explanation of the correlation between the savage and the civilized by reading a novel of choice using the lens of Post-Colonial Criticism to analyze power structures within their novels. The reading of Elie Wiesel’s memoir <em>Night<\/em> will develop students’ understanding of the Holocaust, while Marjane Satrapi’s graphic novel <em>Persepolis<\/em> will broaden students’ definition of literature. Finally, students will explore ideas surrounding the UN&#8217;s Universal Declaration of Human Rights while reading Khaled Hosseini&#8217;s <em>A Thousand Splendid Suns<\/em><em>.  <\/em>Students will closely read and annotate texts of all forms, write literary essays and original creative works, and engage in a research project to produce and present a comprehensive paper. Project-based learning engages students in a variety of activities designed to develop deeper learning competencies required for success in college, career, and civic life while preparing them for the Common Core English Regents Examination. <\/p>\n<h4>SARATOGA PATHWAYS ACADEMY ENGLISH 11 HUMANITIES<\/h4>\n<p>0057        Full Year                 1 Credit                                   Grade 11<\/p>\n<p>This course is aligned with Saratoga Pathways Academy US History 11 Humanities and continues the curriculum started in Saratoga Pathways Academy English 9 Humanities. Students in SPA have 1:1 access to technology and a state-of-the-art classroom and project-based learning is the primary style of instruction. In this course, students will study genres including poetry, drama, the novel, nonfiction, and short fiction. Students will read essays, articles, and literary criticism all related to various thematic units and explore such classic American works as Steinbeck’s <em>Of Mice and Men<\/em>, Miller’s <em>The Crucible<\/em>, and Williams’ <em>A Streetcar Named Desire<\/em>. Students will complete writing assignments in a variety of settings and will also work on presenting their ideas in discussion and\/or Socratic Forum. They will also refine their oral communication skills through gathering and organizing evidence to support a position in informative and persuasive presentations. The course addresses NYS Next Generation Learning Standards. Students will take the English Regents examination.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY ENGLISH 12 HUMANITIES<\/h4>\n<p>0061       Full Year                 1 Credit                                     Grade 12<\/p>\n<p>This project-based course will involve intensive individual and collaborative research into an area of the humanities, including history, language, literature, music, philosophy, and religion. Focusing on the research process, writing, and presentation skills, students will delve into an area of individual interest related to the humanities. The human experience will be explored through fiction, literary nonfiction, primary sources, politics, economics, historical archives, discussions, guest lectures, and other library resources, placing it in the context of local, state, or national historical events.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY GLOBAL 1 HUMANITIES<\/h4>\n<p>0145        Full Year                 1 Credit                                  Grade 9<\/p>\n<p>As part of the SPA Program, this course offers a project-based learning approach to Global History 9. Taught together with SPA English 9 Humanities, the global and English curriculums are intertwined to provide a more enriching learning experience. While learning about global history from the rise of ancient civilizations through the Age of Exploration, students will explore literature that complements their studies. As a project-based learning course, students participate in interdisciplinary, engaging unit projects that allow them to develop both knowledge and success skills for life, such as critical thinking, problem-solving, collaboration, creativity, innovation, communication, and leadership. SPA students also have access to the state-of-the-art project-based learning center, which is equipped with student laptops, a 3-D printer, and more of the latest educational technology. SPA Global 9 Humanities must be taken in conjunction with SPA English 9 Humanities.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY GLOBAL 2 HUMANITIES<\/h4>\n<p>0146        Full Year                 1 Credit                                  Grade 10<\/p>\n<p>As part of the SPA Program, this course offers a project-based learning approach to Global History 10. Taught together with SPA English 10 Humanities, the Global and English curriculums are intertwined to provide a more enriching learning experience. While learning about global history from the Enlightenment through the present day 21st century, students will explore literature and current issues that complement their studies. As a project-based learning course, students participate in interdisciplinary, engaging unit projects that allow them to develop both knowledge and success skills for life, such as critical thinking, problem solving, collaboration, creativity, innovation, communication, and leadership. SPA students also have access to the state-of-the-art project-based learning center, which is equipped with student laptops, a 3-D printer, and more of the latest educational technology. SPA Global 10 Humanities must be taken in conjunction with SPA English 10 Humanities. Students who were not enrolled in SPA 9 Humanities are still eligible to take SPA 10 Humanities.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY UNITED STATES HISTORY, GOVERNMENT AND HUMANITIES 11<\/h4>\n<p>0147        Full Year                 1 Credit                                    Grade 11<\/p>\n<p>As part of the SPA Program, this course offers a project-based learning approach to United States History &amp; Government. Taught together with SPA English 11 Humanities, the history, government, and English curriculums are intertwined to provide a more enriching learning experience. While learning about United States history from colonization to the present, students will explore literature and current issues that complement their studies. As a project-based learning course, students participate in interdisciplinary, engaging unit projects that allow them to develop both knowledge and success skills for life, such as critical thinking, problem-solving, collaboration, creativity, innovation, communication, and leadership. SPA students also have access to the state-of-the-art project-based learning center, which is equipped with student laptops, a 3-D printer, and more of the latest educational technology. SPA US History, Government &amp; Humanities must be taken in conjunction with SPA English 11 Humanities. Students who were not enrolled in SPA 10 Humanities are still eligible to take SPA 11 Humanities.<\/p>\n<h4>SARATOGA PATHWAYS ACADEMY:  PARTICIPATION IN GOVERNMENT\/ECONOMICS HUMANITIES<\/h4>\n<p>0148        Full Year    1 Credit                                                   Grade 12<\/p>\n<p>This course is a dynamic culmination of the project-based collaboration in the humanities, combining units of study in social studies and ELA at the 12th grade level. Students in Saratoga Pathways Academy 12 (SPA 12) will explore topics in government and economics with a special emphasis on research, analysis, and real-world problem solving. SPA 12 students will delve into historical documents, learn about archival research, work collaboratively on political and economic areas of personal interest, and explore relevant works of fiction and non-fiction. This course is taught by team Social Studies and ELA teachers in a flexible format in the high tech and innovative Project-Based Learning Room. Participants will have the opportunity to utilize community resources and forge relationships with experts beyond high school. The Saratoga Pathways Academy setting is truly a school-within-a-school, and SPA 12, while open to all 12th grade students, is designed to be a capstone course in the humanities. This course satisfies the graduation requirements for Economics and Participation in Government And must be taken with SPA 12: Humanities for English 12 credit.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The SPA Program is an interdisciplinary, project-based learning program for students in grades 9-12. SPA students take their core classes in the state-of-the-art project-based learning center within the high school. They have access to individual laptops, a 3-D printer, and more of the latest in educational technology. SPA students engage in authentic projects that emphasize &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Saratoga Pathways Academy Courses&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4172","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Saratoga Pathways Academy Courses - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Saratoga Pathways Academy Courses - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The SPA Program is an interdisciplinary, project-based learning program for students in grades 9-12. SPA students take their core classes in the state-of-the-art project-based learning center within the high school. They have access to individual laptops, a 3-D printer, and more of the latest in educational technology. SPA students engage in authentic projects that emphasize &hellip; Continue reading &quot;Saratoga Pathways Academy Courses&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-23T18:13:27+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"8 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\",\"name\":\"Saratoga Pathways Academy Courses - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:36:48+00:00\",\"dateModified\":\"2024-12-23T18:13:27+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Saratoga Pathways Academy Courses\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Saratoga Pathways Academy Courses - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/","og_locale":"en_US","og_type":"article","og_title":"Saratoga Pathways Academy Courses - Saratoga City School District","og_description":"The SPA Program is an interdisciplinary, project-based learning program for students in grades 9-12. SPA students take their core classes in the state-of-the-art project-based learning center within the high school. They have access to individual laptops, a 3-D printer, and more of the latest in educational technology. SPA students engage in authentic projects that emphasize &hellip; Continue reading \"Saratoga Pathways Academy Courses\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-23T18:13:27+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/","name":"Saratoga Pathways Academy Courses - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:36:48+00:00","dateModified":"2024-12-23T18:13:27+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/saratoga-pathways-academy-courses\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Saratoga Pathways Academy Courses"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4172","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4172"}],"version-history":[{"count":5,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4172\/revisions"}],"predecessor-version":[{"id":9710,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4172\/revisions\/9710"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}