{"id":4175,"date":"2022-12-06T11:40:00","date_gmt":"2022-12-06T16:40:00","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=4175"},"modified":"2024-12-20T10:33:17","modified_gmt":"2024-12-20T15:33:17","slug":"graduation-requirements","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/","title":{"rendered":"Graduation Requirements"},"content":{"rendered":"<p>New York State students have access to the local diploma, the Regents diploma, and the Regents diploma with advanced designation. To earn a New York State high school diploma, students must meet both the credit requirements and the assessment requirements. Schools and districts may create diploma requirements in addition to those required by the New York State Education Department.<\/p>\n<p>While there are multiple means of earning units of credit towards a diploma, typically students earn diploma credit through the mastery of the learning outcomes set forth in a locally developed syllabus for a given high school subject, after the student had the opportunity to complete a unit of study (180 minutes of instruction per week throughout the school year, or the equivalent).  The credit requirements below apply to all diploma types: local, Regents, and Regents with advanced designation. <\/p>\n<h3><strong>Credit Requirements<\/strong><\/h3>\n<p><strong>Required Courses &amp; Minimum Number of Credits:<\/strong><\/p>\n<ul>\n<li>English    4 credits<\/li>\n<li>Social Studies    4 credits\n<ul>\n<li><em>Distributed as follows:<\/em>\n<ul>\n<li><em>U.S. History (1)<\/em><\/li>\n<li><em>Global History and Geography (2)<\/em><\/li>\n<li><em>Participation in Government (1\/2)<\/em><\/li>\n<li><em>Economics (1\/2)<\/em><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<li>Mathematics     3 credits<\/li>\n<li>Science       3 credits\n<ul>\n<li><em>Distributed as follows:<\/em>\n<ul>\n<li><em>Life Science (1)<\/em><\/li>\n<li><em>Physical Science (1)<\/em><\/li>\n<li><em>Life Science or Physical Science (1)<\/em><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<li>World Language     1* credits<\/li>\n<li>Health      ½ credits<\/li>\n<li>The Arts     1 credits<\/li>\n<li>Physical Education    2 credits<\/li>\n<li>Health     ½ credits<\/li>\n<li>Electives     3  1\/2 credits<\/li>\n<li>Total Credits     22 credits<\/li>\n<\/ul>\n<p>*Students with disabilities may be excused from the requirement for 1 unit of credit in World Languages if so, indicated on their Individualized Education Program (IEP), but they must still earn 22 units of credit to graduate.  Such students are also exempt from the sequence requirement for earning a Regents diploma with advanced designation. <\/p>\n<p>English language learners (ELLs) enrolled in Bilingual Education and English as a New Language programs must meet the following program requirements: <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/bilingual-ed\/enl-9-12-units-of-study-table-5-6-15.pdf\">9-12 English as a New Language (ENL) Units of Study and Staffing Requirements<\/a> and<a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/bilingual-ed\/bilingual-ed-9-12-units-of-study-table-5-6-15.pdf\"> 9-12 Transitional Bilingual Education Program Requirements<\/a>. For additional guidance, reference <a href=\"https:\/\/www.nysed.gov\/bilingual-ed\/units-study-tables-english-new-language-enl-and-bilingual-education-programs\">Units of Study Tables for English as a New Language (ENL) and Bilingual Education Programs<\/a>. <\/p>\n<h4><strong>Regents or local diploma<\/strong><\/h4>\n<p>In addition to successful completion of the appropriate units of credits, to earn a Regents or local diploma, students must pass*:<\/p>\n<ul>\n<li>one English language arts Regents Examination or <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/state-assessment\/approved-alternative-examinations.pdf\">NYSED-Approved Regents Examination Alternative<\/a>;<\/li>\n<li>one mathematics Regents Examination or NYSED-Approved Regents Examination Alternative;<\/li>\n<li>one science Regents Examination or NYSED-Approved Regents Examination Alternative;<\/li>\n<li>one social studies Regents Examination or NYSED-Approved Regents Examination Alternative; and<\/li>\n<li>one pathway (see <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/multiple-pathways\">Multiple Pathways<\/a>for more information).<\/li>\n<\/ul>\n<p>* Eligible students may meet the assessment requirements using <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination\">Appeals, Safety Nets, and Superintendent Determination.<\/a> Students granted an exemption from any examination are not required to pass such specific examination to meet the assessment requirements for any diploma type (local, Regents, or Regents with advanced designation).<\/p>\n<h4><strong>R<\/strong><strong>egents diploma with advanced designation<\/strong><\/h4>\n<p>In addition to successful completion of the appropriate units of credit, to earn a Regents diploma with advanced designation, students must pass* two additional math assessments and one additional science assessment to include:<\/p>\n<ul>\n<li>one English language arts Regents Examination or <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/state-assessment\/approved-alternative-examinations.pdf\">NYSED-Approved Regents Examination Alternative<\/a>;<\/li>\n<li>three mathematics Regents Examinations or NYSED-Approved Regents Examination Alternatives;<\/li>\n<li>one life science Regents Examination or NYSED-Approved Regents Examination Alternative;<\/li>\n<li>one physical science Regents Examination or NYSED-Approved Regents Examination Alternative;<\/li>\n<li>one social studies Regents Examination or NYSED-Approved Regents Examination Alternative; and<\/li>\n<li>one pathway (see <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/multiple-pathways\">Multiple Pathways<\/a>for more information).<\/li>\n<\/ul>\n<p>* Eligible students may meet the assessment requirements for advanced designation using <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination\">special appeals<\/a>. Students granted an exemption from any examination are not required to pass such specific examination to meet the assessment requirements for any diploma type (local, Regents, or Regents with advanced designation). <\/p>\n<p>To earn the Regents diploma with advanced designation, students must also complete one of the three sequence options:<\/p>\n<ul>\n<li>two additional credits in World Languages (for a total of three credits) and the locally developed Checkpoint B World Languages Exam,<\/li>\n<li>5-unit sequence in the Arts, or<\/li>\n<li>5-unit sequence in Career and Technical Education (CTE).<\/li>\n<\/ul>\n<p>The 5-unit sequence, leading to the Regents diploma with advanced designation, is at the discretion of the district. The sequence should be a meaningful group of courses building upon a student’s skills and interests in a particular area. NYSED recommends the sequence begin with a foundational course and then advance through electives in the discipline; however, the district has the responsibility to determine what ultimately the sequence will include.  NYSED does not have specific course requirements to be included in the 5-unit sequence in either the Arts or CTE for advanced designation. <\/p>\n<p>Note: A student exempt from the World Languages credit requirement who seeks a Regents diploma with advanced designation does NOT have to complete the 5-unit sequence in the Arts or CTE in lieu of the World Languages sequence in order to meet the assessment requirements for the advanced diploma.<\/p>\n<h4><strong>Appeals, Safety Nets, and Superintendent Determination<\/strong><\/h4>\n<p>Eligible students may appeal to graduate with a lower score on a Regents Exam. This section includes information related to special appeals, <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination#TraditionalAppeals\">traditional appeals<\/a>, and <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination#AppealsResources\">appeals resources<\/a>.<\/p>\n<h4><strong>Special Appeals<\/strong><\/h4>\n<p>Any student who meets the following eligibility conditions may appeal to earn a diploma with a lower score on a Regents Exam. These conditions are specific to the special appeal.<\/p>\n<ul>\n<li>The student must have taken the Regents Exam during June 2022, August 2022, January 2023, June 2023, or August 2023 test administration periods.<\/li>\n<li>The student must have a score of 50-64 on the Regents Exam that is the subject of the appeal and was taken during one of the above administrations.<\/li>\n<li>The student must have a course average in the subject under appeal (as evidenced in the official transcript that records grades achieved by the student in each quarter of the school year) that meets or exceeds the required passing grade by the school.<\/li>\n<\/ul>\n<p>Note: This will be a limited rule in effect for exams taken during these specific administration periods only (June\/August 2022, January\/June\/August 2023). Special appeals may be applied towards any diploma type (local, Regents, and Regents with Advanced Designation). Special appeals do not count towards the maximum number of appeals that can be applied to specific diploma types. <\/p>\n<h4><strong>Traditional Appeals<\/strong><\/h4>\n<p>All New York State students are eligible to appeal a lower score on a Regents Exam if they meet the following criteria:<\/p>\n<ul>\n<li>have taken the Regents Exam under appeal at least two times;<\/li>\n<li>have at least one score on the Regents Exam under appeal within the point range appropriate for the appeal:<\/li>\n<\/ul>\n<table width=\"500\" style=\"width: 100%;\">\n<tbody>\n<tr>\n<td style=\"width: 88.6207%;\">\n<p>All student appeal<\/p>\n<\/td>\n<td style=\"width: 11.2069%;\">\n<p>60-64<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 88.6207%;\">\n<p>English language learners seeking appeals in ELA only *<\/p>\n<\/td>\n<td style=\"width: 11.2069%;\">\n<p>55-59<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td style=\"width: 88.6207%;\">\n<p>Students with disabilities eligible for the Low Pass Safety Net Option<\/p>\n<\/td>\n<td style=\"width: 11.2069%;\">\n<p>52-54<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<ul>\n<li>have taken advantage of academic help provided by the school in the subject tested by the Regents Exam under appeal;<\/li>\n<li>have passed the course for which the appeal is being sought; and<\/li>\n<li>have been recommended for an exemption to the graduation requirement by the student’s teacher or Department chairperson in the subject of the Regents Exam under appeal.<\/li>\n<\/ul>\n<p>* To be eligible for the Local Diploma via Appeal for English Language Learners, the student must have entered the United States in high school (grade 9 or after) and must still be identified as an English language learner during the 2nd attempt at passing the Regents Exam in English Language Arts.<\/p>\n<p><strong>Resources<\/strong><\/p>\n<ul>\n<li>Special Appeal, <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/specialappealtoearndiplomaswithlowerscoreregentsform.docx\">Special Appeal to Earn Diplomas with a Lower Score on a Regents Exam Taken in the 2021-22 or 2022-23 School Year Form<\/a><\/li>\n<li>Traditional Appeal, <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/appealgraduatelowerscoreregents.pdf\">Appeal to Graduate with a Lower Score on a Regents Exam<\/a>. The summary form no longer needs to be mailed to the State Education Department; it should be maintained by the school and be available for inspection by the State Education Department, if requested.<\/li>\n<\/ul>\n<h4><strong>Safety Net<\/strong><\/h4>\n<p>Students with disabilities have three safety net options available to support acquisition of the local diploma.  Safety net options include the Low Pass Safety Net, the <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination#LowPassSafetyNetAppeal\">Low Pass Safety Net with Appeal<\/a>, and the <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/appeals-safety-nets-and-superintendent-determination#CompensatorySafetyNet\">Compensatory Safety Net<\/a>. <\/p>\n<p><strong> <\/strong><strong>Low Pass Safety Net<\/strong><\/p>\n<p><strong>Applicability<\/strong><\/p>\n<ul>\n<li>The Low Pass Safety Net Option is available to:<\/li>\n<li>students with disabilities with a current individualized education program (IEP),<\/li>\n<li>students with a Section 504 accommodation plan, if documented on the plan, and<\/li>\n<li>students declassified from special education while in grades 8-12, if recommended and documented by the committee on special education (CSE).<\/li>\n<\/ul>\n<p><strong>Requirements<\/strong><\/p>\n<p>The Low Pass Safety Net Option allows a student with a disability to meet the testing requirements for a local diploma by achieving a score between 55 and 64 on one or more of the required Regents Exams.<\/p>\n<p><strong>Additional Considerations<\/strong><\/p>\n<ul>\n<li>Non-Regents exams (e.g., NYSED-Approved Regents Exam Alternative assessments or NYSED-Approved Pathway assessments are not subject to the Low Pass Safety Net Option.<\/li>\n<li>A student with a disability who makes use of the Low Pass Safety Net Option may also use the Compensatory Safety Net Option to meet graduation requirements for a local diploma.<\/li>\n<\/ul>\n<p><strong>Diploma Type<\/strong><\/p>\n<p>The Low Pass Safety Net Option leads to the local diploma.<\/p>\n<h4><strong>Low Pass Safety Net with Appeal<\/strong><\/h4>\n<p><strong>Applicability<\/strong><\/p>\n<p>The Low Pass Safety Net Option with Appeal is available to:<\/p>\n<ul>\n<li>students with disabilities with a current individualized education program (IEP),<\/li>\n<li>students with a Section 504 accommodation plan, if documented on the plan, and<\/li>\n<li>students declassified from special education while in grades 8-12, if recommended and documented by the committee on special education (CSE).<\/li>\n<\/ul>\n<p><strong>Eligibility Conditions<\/strong><\/p>\n<p>To be eligible to appeal a score of 52-54, a student with a disability must meet all other conditions of appeal as follows:<\/p>\n<ul>\n<li>have taken the Regents Exam under appeal at least two times; <\/li>\n<li>have at least one score on the Regents Exam under appeal within the 52-54 score band;<\/li>\n<li>present evidence that the student has taken advantage of academic help provided by the school in the subject tested by the Regents Exam under appeal;<\/li>\n<li>have a course average in the subject under appeal that meets or exceeds the required passing grade by the school (as evidenced in the official transcript that records grades achieved by the student); and<\/li>\n<li>be recommended for an exemption to the graduation requirement by the student’s teacher or Department chairperson in the subject of the Regents Exam under appeal. <\/li>\n<\/ul>\n<p><strong>Additional Considerations<\/strong><\/p>\n<ul>\n<li>The decision to grant or deny an appeal is made at the district level and is not subject to State Education Department approval.<\/li>\n<li>Non-Regents exams are not subject to the appeals process.<\/li>\n<li>A student with a disability who makes use of the Low Pass Safety Net Option with Appeal may also use the Compensatory Safety Net Option to meet graduation requirements for a local diploma.<\/li>\n<\/ul>\n<p><strong> <\/strong><strong>Diploma Type<\/strong><\/p>\n<p>The Low Pass Safety Net Option with Appeal leads to the local diploma. <\/p>\n<p><strong>Resources<\/strong><\/p>\n<p>Additional information on the appeal process, including the Low Pass Safety Net Option with Appeal may be found in the &#8220;Appeals&#8221; section of this webpage and the &#8220;appeals&#8221; section of the <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/frequently-asked-questions-about-nys-graduation-requirements\">Graduation Requirements FAQ<\/a>.<\/p>\n<p><a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/safety-net-options-avail-to-swd-to-grad-w-local-diploma.pdf\">Safety Net Options Available to Students with Disabilities to Graduate with a Local Diploma<\/a><\/p>\n<h4><strong>Compensatory Safety Net<\/strong><\/h4>\n<p>The Compensatory Safety Net Option allows a student with a disability who scores between 45-54 on one or two of the required Regents Exams (except for ELA or mathematics) to compensate the low score with a score of 65 or higher on another required Regents Exam to graduate with a local diploma. <\/p>\n<p><strong>Applicability<\/strong><\/p>\n<p>The Compensatory Safety Net Option is available to:<\/p>\n<ul>\n<li>students with disabilities with a current individualized education program (IEP),<\/li>\n<li>students with a Section 504 accommodation plan, if documented on the plan, and<\/li>\n<li>students declassified from special education while in grades 8-12, if recommended and documented by the committee on special education (CSE).<\/li>\n<\/ul>\n<p><strong>Eligibility Conditions<\/strong><\/p>\n<p>To be eligible for the Compensatory Safety Net Option, a student with a disability must meet all conditions as follows:<\/p>\n<ul>\n<li>meet the assessment requirements in ELA and mathematics, typically this is done by obtaining a score of at least 55 (or an approved appeal of 52-54) on both the ELA and Mathematics Regents Exams;<\/li>\n<li>obtain a passing grade that meets or exceeds the required passing grade by the school for the course in the subject area of the Regents Exam in which he or she received a score of 45-54; and<\/li>\n<li>have a satisfactory attendance rate, in accordance with the district’s or school’s attendance policy, for the school year during which the student took the examination in which he or she received a score of 45-54, exclusive of excused absences. <\/li>\n<\/ul>\n<p><strong>Additional Considerations<\/strong><\/p>\n<ul>\n<li>A score of 65 or higher on a single examination may not be used to compensate for more than one examination for which a score of 45-54 is earned.<\/li>\n<li>A student with a disability who makes use of the Compensatory Safety Net Option may also use the Low Pass Appeal Option (i.e., appeal scores of 52-54) to meet graduation requirements for a local diploma.<\/li>\n<li>Regents Exams required to earn a local or Regents diploma include English, mathematics, science, and social studies. Students may also use one additional Regents Exam to fulfill the pathway requirement. Additional information can be referenced on the <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/graduation-requirements\">Graduation Requirements webpage.<\/a><\/li>\n<\/ul>\n<p><strong>Diploma Type<\/strong><\/p>\n<p>The Compensatory Safety Net Option leads to the local diploma.<\/p>\n<p><strong>Resources<\/strong><\/p>\n<p><a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/compensatory-option-checklist-for-eligibility.pdf\">Checklist for the Eligibility for the Compensatory Safety Net Option<\/a><\/p>\n<p><a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/safety-net-options-avail-to-swd-to-grad-w-local-diploma.pdf\">Safety Net Options Available to Students with Disabilities to Graduate with a Local Diploma<\/a><\/p>\n<h4><strong>Superintendent Determination Option for Graduation with a Local Diploma<\/strong><\/h4>\n<p>The Superintendent Determination Option allows a superintendent (or the principal\/head of school of a registered nonpublic school or charter school, as applicable) to make a local determination that a student with a disability has otherwise met the standards for graduation with a local high school diploma when such student has not been successful, because of their disability, at demonstrating their proficiency on one or more of the Regents Exams required for graduation. <\/p>\n<p><strong>Applicability<\/strong><\/p>\n<p>This option is available to students with disabilities with a current individualized education program (IEP) only. It does not apply to students with section 504 accommodation plans or students who have been declassified from special education.<\/p>\n<p><strong>Written Request<\/strong><\/p>\n<p>The superintendent may only consider an eligible student for a local diploma through the superintendent determination option upon receipt of a written request from the student&#8217;s parent or guardian. Such request must be submitted in writing to the student’s school principal or chairperson of the district’s committee on special education (CSE). Schools and districts may utilize the sample form, <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/parent-request-for-superintendent-determination-sample-form.pdf\">Parent Request for Superintendent Determination Option for Graduation with a Local Diploma<\/a>. A written request received by the school principal, chairperson of the CSE, or any other employee of the school, must be forwarded to the school superintendent immediately upon its receipt.<\/p>\n<p><strong>Eligibility Conditions<\/strong><\/p>\n<p>To be eligible for the Superintendent Determination Option, a student with a disability must meet all conditions as follows:<\/p>\n<ul>\n<li>the parent\/guardian submitted a written request that their child be considered for a superintendent determination;<\/li>\n<li>the student has a current IEP and be receiving special education programs and\/or related services;<\/li>\n<li>the student did not meet the graduation requirements through the existing appeal options;<\/li>\n<li>the student has earned the required course credits and has passed, in accordance with district policy, all courses required for graduation, including the Regents courses to prepare for the corresponding required Regents Exam areas (English language arts (ELA), mathematics, social studies, and science);<\/li>\n<li>the student:\n<ul>\n<li>earned a minimum score of 55 or successfully appealed a score between 52 and 54 on the ELA and mathematics Regents Exams;<\/li>\n<li>or was unable to achieve a minimum score of 55 or did not initiate an appeal of a score between 52 and 54 on the ELA and\/or mathematics Regents Exam(s), but they completed the requirements for the New York State Career Development and Occupational Studies (CDOS) Commencement Credential;<\/li>\n<\/ul>\n<\/li>\n<li>the student has participated in all Regents Exams required for graduation but has not passed one or more of these examinations; and<\/li>\n<li>the student has otherwise demonstrated competency in the subject area(s) where the student was not able to demonstrate their proficiency on the State&#8217;s learning standards through the Regents Exam(s).<\/li>\n<\/ul>\n<p><strong>Review and Documentation<\/strong><\/p>\n<p>Upon receipt of a written request from an eligible student’s parent or guardian, the superintendent must, in consultation with the school principal, review, document and provide a written certification\/assurance that there is evidence that the student has otherwise met the standards for graduation with a local high school diploma. In conducting a review to ensure the student has met the academic standards, the superintendent must consider evidence that demonstrates that the student:<\/p>\n<ul>\n<li>passed the course(s) culminating in the examination(s) required for graduation, in accordance with the grading policies of the district. Such evidence may include student work completed throughout the school year and\/or interim grades on homework, projects, class work, quizzes, tests, etc., that demonstrate that the student has met the learning standards for the course; and<\/li>\n<li>actively participated in the Regents Exam(s) required for graduation.<\/li>\n<\/ul>\n<p>The superintendent must sign the form prescribed by the Commissioner of Education, <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/superintendentdeterminationform.pdf\">Superintendent Determination of Graduation with a Local Diploma <\/a>(Updated June 2023), which documents the evidence reviewed, certifies that the information is accurate, and indicates that the superintendent has determined that the student has either met or has not met the requirements for a local diploma.<\/p>\n<p>The student and the parent of the student must receive written notice of the superintendent’s determination with the copy of the completed superintendent’s determination form and, where the superintendent determines that the student has met the requirements for graduation, the district must provide prior written notice that the student is not eligible to receive a free appropriate public education (FAPE) after graduation with a local diploma. Where the superintendent determines that the student has not met the requirements for graduation, the written notice shall inform the student and their parent that the student has the right to attend school until receipt of a local or Regents diploma or until the end of the school year in which the student turns 21, whichever shall occur first.<\/p>\n<p>A copy of the form must be placed in the student’s record. In addition, a copy of the form must be submitted to the Department no later than August 31.<\/p>\n<h4><strong>Transition Planning<\/strong><\/h4>\n<p>To ensure appropriate transition planning for the student, the development of transition goals and services must include a discussion with the student’s parents of:<\/p>\n<ul>\n<li>the graduation requirements that apply to the student depending upon the year in which he or she first enters grade nine.<\/li>\n<li>how the student is progressing toward receipt of a diploma including:\n<ul>\n<li>the courses the student has passed and the number of credits the student has earned as required for graduation.<\/li>\n<li>the examinations required for graduation that the student has taken and passed; and<\/li>\n<\/ul>\n<\/li>\n<li>the appeal, safety net, and superintendent determination options that may be available to the student to allow the student to meet the graduation examination requirements.<\/li>\n<\/ul>\n<p>At the CSE meeting in which transition services will be discussed, the student’s parents must be provided with written information explaining the graduation requirements. Such information must include the eligibility criteria and processes for seeking an appeal to graduate with a lower score on a Regents Exam and for requesting that a student be considered for a local diploma through the superintendent determination option. Parents must also be informed that graduation from high school with a local diploma or Regent’s diploma will terminate their child’s entitlement to FAPE and their eligibility for special education services.<\/p>\n<p><strong>Resources<\/strong><\/p>\n<ul>\n<li><a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/parent-request-for-superintendent-determination-sample-form.pdf\">Parent Request for Superintendent Determination for Graduation with a Local Diploma<\/a><\/li>\n<li><a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/programs\/standards-instruction\/superintendentdeterminationform.pdf\">Superintendent Determination for Graduation with a Local Diploma<\/a>, updated June 2023 (to be returned to NYSED)<\/li>\n<\/ul>\n<h4><strong>Endorsements and Seals<\/strong><\/h4>\n<p><strong>Honors<\/strong><\/p>\n<p>The honors endorsement may be awarded to students who complete the requirements for either the Regents diploma or the Regents diploma with advanced designation. To earn the honors endorsement, a student must meet the assessment requirements for the Regents diploma or the Regents with advanced designation and also earn a computed average of 90 or above on the Regents Exams applicable to their diploma type (no rounding up is permitted). Students who substitute more than 2 NYSED-Approved Regents Exam Alternatives for the required Regents Exams are not eligible for the honors endorsement.<\/p>\n<p><strong>Mastery in Math and Science<\/strong><\/p>\n<p>The mastery endorsement may be awarded to students who complete the requirements for the Regents diploma with advanced designation. To earn mastery in mathematics and\/or mastery in science, students must demonstrate mastery on the Regents Exams in mathematics and\/or science. Mastery is evidenced by earning a score of 85 or above.<\/p>\n<p><strong>Mastery in Mathematics<\/strong><\/p>\n<ul>\n<li>Student completed all the requirements for the Regents diploma with advanced designation; and\n<ul>\n<li>passed 3 Regents Exams in mathematics with a score of 85 or higher; or<\/li>\n<li>passed 2 Regents Exams in mathematics with a score of 85 or higher and was granted an exemption on a third Regents Exam in mathematics; or<\/li>\n<li>passed 1 Regents Exams in mathematics with an 85 or higher and earned a final course grade of 85 or higher in 2 additional mathematics courses culminating in a Regents Exam for which an exemption was granted.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Mastery in Science<\/strong><\/p>\n<ul>\n<li>Student completed all the requirements for the Regents diploma with advanced designation; and\n<ul>\n<li>passed 3 Regents Exams in science with a score of 85 or higher; or<\/li>\n<li>passed 2 Regents Exams in science with a score of 85 or higher and was granted an exemption on a third Regents Exam in science: or<\/li>\n<li>passed 1 Regents Exam in science with an 85 or higher and earned a final course grade of 85 or higher in 2 additional science courses culminating in a Regents Exam for which an exemption was granted.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><strong>Seal of Biliteracy<\/strong><\/p>\n<p>The New York State Seal of Biliteracy recognizes high school graduates who have attained a high level of proficiency in English and one or more world languages. <\/p>\n<p>Additional information can be referenced on <a href=\"https:\/\/www.nysed.gov\/bilingual-ed\/new-york-state-seal-biliteracy-nyssb\">The New York State Seal of Biliteracy webpage<\/a>.<\/p>\n<p><strong>Seal of Civic Readiness<\/strong><\/p>\n<p>The Seal of Civic Readiness is a formal recognition that a student has attained a high level of proficiency in terms of civic knowledge, civic skills, civic mindset, and civic experiences.<\/p>\n<p>Additional information can be referenced on the <a href=\"https:\/\/www.nysed.gov\/standards-instruction\/seal-civic-readiness\">Seal of Civic Readiness webpage<\/a>.<\/p>\n<p><strong>Technical Endorsement<\/strong><\/p>\n<p>The technical endorsement may be awarded to students who complete the requirements for any diploma type (local, Regents, or Regents with advanced designation) and also complete a <a href=\"https:\/\/www.nysed.gov\/sites\/default\/files\/current-nysed-approved-cte-programs.pdf\">NYSED-Approved Secondary Career and Technical Education (CTE) program<\/a> that includes:  <\/p>\n<ul>\n<li>passing a minimum of 3.5 CTE credits <\/li>\n<li>passing each part of a 3-part technical assessment (written, demonstration, project components).<\/li>\n<\/ul>\n<p>Additional information can be referenced on the Technical Endorsement webpage<\/p>\n","protected":false},"excerpt":{"rendered":"<p>New York State students have access to the local diploma, the Regents diploma, and the Regents diploma with advanced designation. To earn a New York State high school diploma, students must meet both the credit requirements and the assessment requirements. Schools and districts may create diploma requirements in addition to those required by the New York State Education Department. &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Graduation Requirements&#8221;<\/span><\/a><\/p>\n","protected":false},"author":18,"featured_media":0,"parent":3953,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-4175","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Graduation Requirements - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Graduation Requirements - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"New York State students have access to the local diploma, the Regents diploma, and the Regents diploma with advanced designation. To earn a New York State high school diploma, students must meet both the credit requirements and the assessment requirements. Schools and districts may create diploma requirements in addition to those required by the New York State Education Department. &hellip; Continue reading &quot;Graduation Requirements&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-20T15:33:17+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"17 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\",\"url\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\",\"name\":\"Graduation Requirements - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-12-06T16:40:00+00:00\",\"dateModified\":\"2024-12-20T15:33:17+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Saratoga Springs High School\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Academic Program Guide\",\"item\":\"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/\"},{\"@type\":\"ListItem\",\"position\":5,\"name\":\"Graduation Requirements\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Graduation Requirements - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/","og_locale":"en_US","og_type":"article","og_title":"Graduation Requirements - Saratoga City School District","og_description":"New York State students have access to the local diploma, the Regents diploma, and the Regents diploma with advanced designation. To earn a New York State high school diploma, students must meet both the credit requirements and the assessment requirements. Schools and districts may create diploma requirements in addition to those required by the New York State Education Department. &hellip; Continue reading \"Graduation Requirements\"","og_url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-20T15:33:17+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"17 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/","url":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/","name":"Graduation Requirements - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-12-06T16:40:00+00:00","dateModified":"2024-12-20T15:33:17+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/graduation-requirements\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Saratoga Springs High School","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/"},{"@type":"ListItem","position":3,"name":"Counseling","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/"},{"@type":"ListItem","position":4,"name":"Academic Program Guide","item":"https:\/\/www.saratogaschools.org\/saratoga-springs-high-school\/counseling\/academic-program-guide\/"},{"@type":"ListItem","position":5,"name":"Graduation Requirements"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4175","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=4175"}],"version-history":[{"count":14,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4175\/revisions"}],"predecessor-version":[{"id":4178,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/4175\/revisions\/4178"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/3953"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=4175"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}