{"id":476,"date":"2021-12-16T16:09:00","date_gmt":"2021-12-16T21:09:00","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=476"},"modified":"2024-10-23T13:16:53","modified_gmt":"2024-10-23T17:16:53","slug":"blue-streak-hall-of-fame","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/","title":{"rendered":"Blue Streak Hall of Fame"},"content":{"rendered":"<p>The Blue Streak Hall of Fame honors individuals and teams for their extraordinary contributions to athletics on an annual basis. The program was established to recognize and celebrate the accomplishments of outstanding athletes, coaches, administrators, and supporters. A committee composed of current and former coaches, high school administrators, community members and current and retired athletic directors review the nominations and select the honorees. A trophy case in the lobby of the blue gym holds plaques in honor of the Hall of Fame members.<\/p>\n<div class=\"x_elementToProof\">Individuals become eligible 5 years after graduation from Saratoga Springs High School or after 3 years removed from their coaching position. Nominations may be submitted annually to the Athletic Office on or before the 20th day of June for the year in which the application is to be considered. <\/div>\n<div class=\"x_elementToProof\"><\/div>\n<div class=\"x_elementToProof\"><a href=\"https:\/\/forms.office.com\/r\/LSdFndFzRC\">Hall of Fame Nomination Form Link <\/a><\/div>\n<h2>Blue Streak Hall of Fame <\/h2>\n<p><a href=\"#inductees2024\">2024 Inductees<\/a> | <a href=\"#inductees2023\"> 2023 Inductees<\/a> | <a href=\"#inductees2022\">2022 Inductees<\/a> | <a href=\"#inductee2021\" title=\"2021 Inductees\">2021 Inductees<\/a> | <a href=\"#2019-inductees\">2019 Inductees<\/a> | <a href=\"#2018-inductees\">2018 Inductees<\/a> | <a href=\"#2017-inductees\">2017 Inductees<\/a> | <a href=\"#2016-inductees\">2016 Inductees<\/a> | <a href=\"#2015-inductees\">2015 Inductees<\/a> | <a href=\"#2014-inductees\">2014 Inductees<\/a> | <a href=\"#2013-inductees\">2013 Inductees<\/a> | <a href=\"#2012-inductees\">2012 Inductees<\/a> | <a href=\"#2011-inductees\">2011 Inductees<\/a> | <a href=\"#2010-inductees\">2010 Inductees<\/a> | <a href=\"#2009-inductees\">2009 Inductees<\/a><\/p>\n<h3><a id=\"inductees2024\"><\/a>2024 Inductees<\/h3>\n<h4><strong>Kelsey Briddell<\/strong><\/h4>\n<p>Kelsey Briddell, class of 2014, excelled in field hockey and track and field at Saratoga Springs High School. During her high school career, Kelsey was a four-year varsity field hockey player, earning All-State honors in 2013 and serving as co-captain that same year. A versatile attack\/midfield player, she also helped lead the ADK Club Field Hockey team to victory at the U-16 National Indoor Championship. In track, Kelsey was a key member of the undefeated 4&#215;100 Suburban Council Championship relay team (2013-2014) and placed 6th in the state in the 4&#215;100 relay in 2014.<\/p>\n<p>Kelsey continued her athletic journey at the University of Albany, where she became a four-year starter for the field hockey team. Her accomplishments included selection to the All-Rookie Team, winning the America East Conference Championship, and earning America East All-Tournament Team honors. Kelsey’s talent extended to the international stage, representing the U.S. National Teams and competing in the World Championships with the FIH Pro League.<\/p>\n<h4><strong>Lindsey Frank<\/strong><\/h4>\n<p>Lindsey Frank, class of 2019, made her mark as an elite dual-sport athlete in both field hockey and lacrosse. A four-year varsity starter in both sports, Lindsey set numerous records at Saratoga Springs, including 60 career assists, 82 career goals, 21 single-season assists, and 29 single-season goals. Her exceptional lacrosse skills earned her US Lacrosse All-America honors in both 2018 and 2019, as well as being named the Times Union Girls Lacrosse Player of the Year in back-to-back seasons. Lindsey was also a 1st Team All-New York selection and a Suburban Council First Team All-Star.<\/p>\n<p>After high school, Lindsey continued her lacrosse career at the University of Richmond, where she had a historic 2023 season, tallying 90 points (3rd in program history) from 67 goals (a program single-season record). By the end of her Richmond career, she ranked in the top 10 in program history in points (234), goals (164), assists (70), and draw controls (182). She later joined Northwestern University as a graduate student, where she contributed to the Big 10 Lacrosse Championship and earned Honorable Mention USA Lacrosse Division 1 Preseason All-American honors in 2024.  Lindsey also played one year of field hockey at Northwestern, helping the team achieve a National Division One NCAA runner-up finish in 2023.<\/p>\n<h4><strong>Derrick Legall<\/strong><\/h4>\n<p>Derrick Legall has dedicated over 30 years to supporting the youth and sports programs in Saratoga Springs, both within the city and the school district. His tireless efforts have made a lasting impact on the community, from serving as head of the Saratoga High Booster Club to leading the West Side Little League. Under his leadership, the West Side Little League flourished, and he played a pivotal role in the rebuilding of the West Side Little League Field and Ballpark, creating a space for generations of young athletes to thrive.<\/p>\n<p>Even after his own children graduated from Saratoga Springs High School, Derrick continued his commitment to local youth, staying true to a promise he made years ago. His contributions have not gone unnoticed; in 2011, Derrick was named Outstanding Citizen of the Year by the Saratoga Wilton Elks #161 Lodge, a recognition of his selfless dedication. Derrick also serves on the Saratoga Springs Recreation Commission, furthering his passion for enhancing recreational opportunities for all.<\/p>\n<h4><strong>Tina Villa-Gac<\/strong><\/h4>\n<p>Tina Villa-Gac, class of 2004, is a track and field athlete known for her remarkable achievements in shot put and discus. Over her six years of varsity competition (1998-2004), Tina earned numerous accolades, becoming a three-time Suburban Council and Section 2 Champion in both indoor and outdoor track and field events. She ranks 3rd all-time at Saratoga Springs High School in both discus and shot put, and she holds the distinction of being 10th all-time in Section 2 for discus. Tina consistently showcased her talent, qualifying for the New York State Outdoor Championships from 2000 to 2004 and achieving notable placements at national competitions.<\/p>\n<p>In 2003, Tina qualified for the Indoor National Championships in both discus and shot put, finishing 9th in the nation, and again in 2004, where she secured 8th place. Her dedication and performance were recognized with the prestigious Clifford Furnas Award in 2008 and the Ideal Bull Award, celebrating her excellence in both athletics and academics.<\/p>\n<p>Continuing her athletic journey, Tina attended the University of Buffalo as a Division 1 scholarship athlete, where she not only won a MAC Championship in shot put but also served as team captain and President of the Student-Athlete Advisory Committee. In recognition of her outstanding undergraduate achievements in both scholarship and athletics, she received the 2008 Clifford Furnas Award.<\/p>\n<h4><strong>Charles &#8220;Chip&#8221; Williams<\/strong><\/h4>\n<p>Charles &#8220;Chip&#8221; Williams, class of 1974, excelled in football, basketball, and baseball, making a lasting impact in each sport. As a guard on the basketball team during the 1973-1974 season, Chip earned Foothills Council All-League honors, showcasing his skill and determination on the court.<\/p>\n<p>In baseball, he played a crucial role in leading the team to the Foothills Council League Championship in 1974, finishing the season with an impressive batting average of over .300. Chip’s prowess extended to the football field, where he earned All-American honors, solidifying his reputation as a versatile and talented athlete.<\/p>\n<h4><strong>Jake Zanetti<\/strong><\/h4>\n<p>Jake Zanetti, class of 2005, made a significant mark in both Wrestling and Track &amp; Field. In Track &amp; Field he achieved remarkable success lettering in five Varsity Seasons and finishing 3rd in the 2005 NYSPHSAA Track and Field Championships and 5th in the NYS Federation, in Pole Vault, while setting a School Record with a height of 14’9″. Jake won numerous invitationals and dual meets throughout his career in the vertical jumps; Suburban Council Championships, Colonie Relays, Hudson Falls Invitational, etc. Jake also excelled as a five-year, Varsity Wrestler under the legendary Coach Bellai, showcasing his versatility as an athlete; earning 108 career wins, a Class A Sectional Championship at 145 lbs., and being a 3-Time Champion of the Saratoga Invitational Tournament. Jake was named to multiple All-Section, All-Conference, and All- Saratogian honors throughout both sports. He also lettered for two seasons in Cross Country. Jake served as a two-year Captain for Wrestling and Track &amp; Field as a Junior and a Senior, was named the Most Valuable Wrestler and Field Athlete as a Senior in both sports, as well as the Richard Joyce, the Clayton Chubb, and the Hutch Tibbetts Memorial Award\/Scholarship Winner at the All-Sports Banquet in 2005.<\/p>\n<p>After High School, Jake continued his pole vaulting career at the State University of New York at Cortland, where he became a Division 3 collegiate athlete. His dedication and talent culminated in a NCAA National Championship victory in Pole Vaulting in 2009, solidifying his status as one of the top athletes in his division. This championship played finale to another All-American Place finish in 2007 (6th), 7 SUNYAC Championships (Indoor and Outdoor Track &amp; Field), 3 ECAC Championships, and multiple State Titles.<span><\/span><\/p>\n<p>Today, Jake is a Physical Education Teacher and Coach within the Saratoga Springs City School District, where he shares his passion for sports and movement with the next generation of students and athletes.<\/p>\n<h3><a id=\"inductees2023\"><\/a>2023 Inductees<\/h3>\n<p><em>In addition to the six inductees, the 2004 field hockey team was recognized.<\/em><\/p>\n<h4>Kerri Burgess (Clark)<\/h4>\n<p>Kerri Burgess (Clark), class of 2005, participated in varsity field hockey for three years, varsity lacrosse for four years, and varsity gymnastics for six years. She was dominant in each sport and her accolades include numerous academic and athletic awards during her high school years.  In 2004, she led the field hockey team to the New York State Class A Championships.  She also participated on the Section 2 Gymnastics State teams from 7<sup>th<\/sup> – 12<sup>th<\/sup> grade.   Kerri attended RPI and earned a Bachelor of Science Degree. While attending RPI she was a member of the field hockey and lacrosse teams for four years.  Her 2009 RPI Lacrosse team were the ECAC champions. <\/p>\n<h4><strong>Doranne Mullan (Kelly)<\/strong><\/h4>\n<p>Doranne Mullan (Kelly), class of 1975, participated in multiple sports at Saratoga Springs High School. With Title IX in its infancy, Doranne helped to forge a path for girls sports while participating in and excelling at field hockey (top scorer), basketball (2 year starter and co-caption), volleyball, track and field, and softball (pitcher). In track and field, Doranne earned awards for the 100-yard dash, the 220, the 440, and the relay. She also excelled in the high jump, earning the highest jump in the Foothills Council and Section 2 in 1975. Doranne has served as a board member for the Saratoga Recreation Commission and is entering her 23<sup>rd<\/sup> year as a CDBVO (volleyball) official. <\/p>\n<h4>Jay Mulligan<\/h4>\n<p>The late Jay Mulligan, class of 1973, played football for Hall of Fame coach Blaise Iuliano. Jay was a fullback and team captain his senior year.  Playing under Jim Mattise, he played two years of varsity baseball as a catcher, outfielder, and designated hitter. Jay was a capable hitter and tremendous teammate on those successful Blue Streak Baseball teams. It was wrestling where Jay was truly a star. Jay wrestled for coach Blaise Iuliano, and he was a two-time Section 2 Champion and placed at the NYS Championships. Additionally, he was a member of the 1971-72 team that finished as undefeated Northern Conference Champions, and captain of the 1972-73 team that were Foothills Council and Section 2 Champions. Jay was a two-time first team all-conference selection and helped the Blue Streaks capture multiple tournament championships. Jay finished his outstanding career with a 72-6 record. <\/p>\n<h4><strong>Jay Navin<\/strong><\/h4>\n<p>Jay Navin, class of 2014, participated in cross country and indoor &amp; outdoor track.  Jay led his team to two sectional championships: a state &amp; federation championship &amp; an 11<sup>th <\/sup>place finish at Nike Nationals. In Indoor track Jay was a four-time sectional champ; two-time All-American; 3<sup>rd<\/sup> in the Millrose Mile; 4<sup>th<\/sup> in the New Balance Mile.  In section 2, Jay was the second fastest runner in the 1000 meter as well as the school record holder. He is also a school record holder in the 4 x 1 mile &amp; distance medley relay.  For outdoor track, Jay was a four-time sectional champ; 5<sup>th<\/sup> in the Penn Relays Mile and state champ in the 800 meter &amp; school record holder.<\/p>\n<h4><strong>Joey Santamoor<\/strong><\/h4>\n<p>Joey Santamoor, class of 1995, played five years on the varsity ice hockey team, three years on the varsity baseball team, and two years on the varsity football team.  He was the first male athlete to participate in three team sports that represented their school district in state championships in one year.  Joey was the recipient of the Saratoga Springs High School Most Outstanding Athlete Award in 1995.  In football, Joey was named the Saratogian Defensive End Player of the Year for the 1994-1995 season, and he was a Section 2 League Champion for the 1994-1995 season. In ice hockey, Joey was named All Section First Team Goaltender in 1993, 1994, and 1995.  In baseball, the Saratogian named him Right Field Player of the Year.  With the help of Joey, the 1995 baseball team won the Section 2 Class AA Championships.<\/p>\n<h4>Mickey Walczak<\/h4>\n<p>The late Mickey Walczak, class of 1978, had a stellar high school career.  He played basketball for three years and football for two years from 1975-1978.  As a football player, Mickey was captain for the 1977 Foothills Council Championship team.  He gained more than 1,000 yards each year as a running back and received all-state honors after his senior season.  In basketball, Mickey was named captain during the 1977-1978 season.  That same year the team went undefeated.  After graduating from high school, Mickey attended West Virginia University on a full scholarship, playing four years of Division I football.  At the 1981 Peach Bowl, Mickey helped West Virginia University defeat the University of Florida.  Mickey won the game’s Most Valuable Offensive Player.<\/p>\n<h3><a id=\"inductees2022\"><\/a>2022 Inductees<\/h3>\n<h4>Kevin Chartrand <\/h4>\n<p><span data-contrast=\"auto\">Kevin Chartrand, class of 1997, participated in football and basketball at Saratoga Springs High School. Some of his accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Named All –Area Team as a quarterback for football.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Received the <\/span><span data-contrast=\"none\">Capital District Chapter of New York Scholar-Athlete Award for football performance, academic achievement, and school leadership <\/span> <span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"none\">Member of the 1<\/span><span data-contrast=\"none\">st<\/span><span data-contrast=\"none\"> Saratoga basketball team to win the Suburban Council<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"auto\">Named Suburban Council Basketball Player of the Year 1996-1997<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"5\" data-aria-level=\"1\"><span data-contrast=\"auto\">Received the <\/span><span data-contrast=\"none\">Vince DeGregory Basketball Award 1996-1997 and the Ray Waldron Athlete of the Year Award.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Attended Marist College and was a four-year member of the football team.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Attended SUNY Stony Brook and earned a master’s degree.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"none\">Mr. Chartrand is currently a social studies teacher at Matittuck High School, and has coached football, basketball, and golf. He is married and the father of two children.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<h4>Peter Dickens <\/h4>\n<p><span data-contrast=\"auto\">Peter Dickens, class of 1973, participated in football, basketball, baseball, and track at Saratoga Springs High School. Some of his accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Captain of track and football team  <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Named to “All State” in track in field and placed second in the high hurdles.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\"> P<\/span><span data-contrast=\"auto\">layed football at University of New Hampshire.<\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">Mr. Dickens passed away in 2012.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<h4>William Ford <\/h4>\n<p><span data-contrast=\"auto\">William Ford, class of 1967, participated in football, basketball, and baseball at Saratoga Springs High School. Some of his accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Top defensive player in the linebacker position during his two varsity years.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Served as captain of the basketball team during his junior and senior year and was the leading rebounder.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"auto\">Earned the recognition of “most athletic” during his senior year.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"auto\">Lead the baseball team to a sectional championship during his senior year.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\"> Attended Union College<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<h4 style=\"font-size: 16px;\">Dr. John MacFadden <\/h4>\n<p><span data-contrast=\"auto\">Dr. John MacFadden served as a coach, teacher, administrator, and superintendent of schools for the Saratoga Springs City School District for 38 years from 1969 &#8211; 2007. In each position, he was an advocate and a supporter of the Blue Streaks Athletic Program. Some of his athletic involvement includes:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"51\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Serving as a co-coach for the JV football team and varsity track and field team.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"51\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"auto\">Supporting the athletic booster club as a member since its inception.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"51\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"auto\">Promoting facility additions to support athletics including the athletic stadium at Saratoga Springs High School and the addition of seating and score boards.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"51\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"5\" data-aria-level=\"1\"><span data-contrast=\"auto\">Enhancing community recreation with improvements to the fields and courts at East Side and West Side Recreation Parks.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">Dr. MacFadden received a bachelor&#8217;s degree in history\/political science from Alfred University, a master’s degree in education and instruction as well as educational administration from University at Albany, and a doctorate in educational administration from Nova-Southeastern University.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">Upon his retirement in 2007, the district&#8217;s administrative office building on campus was named the MacFadden Administration Building to recognize his many contributions to the school district.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<h4>Megan Mangano <\/h4>\n<p><span data-contrast=\"auto\">Megan Mangano, class of 1997, participated in <\/span><span data-contrast=\"auto\">soccer, basketball, and lacrosse <\/span><span data-contrast=\"auto\">at Saratoga Springs High School. Some of her accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Was a three-sport varsity athlete<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Named an All-American during her senior year lacrosse season, as well as Surburban Council’s Most Valuable Player and a First-Team All-Star.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Earned a scholarship to attend and play lacrosse for the University of New Hampshire and was a 4-year starter for her division 1 team. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Considered an instrumental part of the 2001 UNH women’s lacrosse team and set school records for goals and points in a season. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"45\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"auto\">Named to the North Regional All-America Second team and America East All-Conference first team.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><span data-contrast=\"auto\">After graduating from the University of New Hampshire with a Bachelor of Science degree in Nutritional Sciences, Ms. Mangano moved to Southern California to complete her dietetic internship and become one of the first in the country to earn her credentials as a CSSD (Board Certified Specialists in Sports Dietetics). Her career as a Sports Dietitian and Functional Nutritionist has taken her around the world working with soccer teams including LA Galaxy, Everton of the English Premier League and the national soccer teams for the United States, Turkey, Qatar and Mexico. Megan served as the team nutritionist for the LA Clippers of the NBA for 7 seasons and continues to consult with a variety of NBA, NFL, NHL and MLB teams and athletes, the US Olympic Committee, as well as a variety of sport professionals and entertainers.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">Ms. Mangano played club lacrosse in San Diego and Los Angeles and has completed six marathons, including the Boston Marathon. She currently resides in Southern California with her wife Angela, and two young children, and their dog Chance.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<h4>Susan Ruggles <\/h4>\n<p><span data-contrast=\"auto\">Susan Ruggles class of 1976, participated in field hockey, basketball, volleyball, and track and field for four years at Saratoga Springs High School. Some of her accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:276}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Helped to advocate for and start the <\/span><span data-contrast=\"auto\">girl&#8217;s interscholastic athletic program at Saratoga Springs High School and played in the school’s inaugural season of field hockey.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"auto\">Set multiple track and field school records and served as the team&#8217;s co-captain.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"47\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"auto\">Received MVP award for volleyball in 1974.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"46\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"auto\">Received the Girls Booster Club award for Outstanding Athlete in 1976.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"50\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"auto\">Received a degree from Lafayette College and a master&#8217;s degree in Theology from Lutheran Theological Seminary<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">Ms. Ruggles married Roger Ruggles, her high school sweetheart, and is currently a pastor at a Lutheran Church. She received her Class D coaching Certificate and started a girls’ soccer program in Forks Township, Pennsylvania.<\/span><span data-contrast=\"none\"> As a foster parent, she has mentored children from the community, coaching them in life skills like she learned in sports. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<h4>Courtney Salton  <\/h4>\n<p><span data-contrast=\"auto\">Courtney Salton (West), class of 1998, participated in Soccer, gymnastics, and indoor and outdoor track at Saratoga Springs High School. Some of her accomplishments include:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<p><span data-contrast=\"auto\">High School:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"49\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Named First Team Suburban Council and Fifth Team All State in 1997 in soccer<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"49\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"none\">21-time Section 2 Champion in 55m, 100m, 200m. 300m, 400m, 4&#215;100, and 4x400m.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"49\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"auto\">Still the school record holder for<\/span><span data-contrast=\"none\"> 200m dash, 300m dash, 400m dash, 4x100m relay, 4x200m relay, and 4x400m relay.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"49\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559683&quot;:0,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"none\">Member of multiple <\/span><span data-contrast=\"none\">Section 2 and Suburban Council Championship Track and Field Teams.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">College:<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"2\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Received a scholarship to participate in Track and Field at the University of Rhode Island<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"2\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"2\" data-aria-level=\"1\"><span data-contrast=\"none\">Member of the first URI Women’s Track and Field Team to capture the Indoor Atlantic 10 Conference Champions in 2000.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"2\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"3\" data-aria-level=\"1\"><span data-contrast=\"none\">Named as part of the All &#8211; Conference Team in 2000.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"2\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559684&quot;:-2,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" aria-setsize=\"-1\" data-aria-posinset=\"4\" data-aria-level=\"1\"><span data-contrast=\"none\">Consistently placed in the top 6 in the 55m dash, 100m dash, 200m dash, 400m dash, 4x100m relay and the 4x400m relay.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240,&quot;335559991&quot;:360}\"> <\/span><\/li>\n<\/ul>\n<p><span data-contrast=\"auto\">Ms. Salton is currently a teacher and coach in the Saratoga Springs City School District. <\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"> <\/span><\/p>\n<h3><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:0,&quot;335559740&quot;:240}\"><a id=\"inductee2021\"><\/a><\/span>2021 Inductees<\/h3>\n<h4>Chris Cocozzo<\/h4>\n<p>Chris Cocozzo, class of 1989, participated in wrestling at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Three-time Saratoga Invitational Champion (1987-1989).<\/li>\n<li>Three-time Class A Champion (1987-1989).<\/li>\n<li>Two-time Section 2 Champion (1987-1988).<\/li>\n<li>Unscored upon in the 1987 Section 2 tournament.<\/li>\n<li>6th in the NYS tournament in wrestling (1988).<\/li>\n<li>Varsity wrestling team captain 1987-1989.<\/li>\n<li>Three-time winner of the Steve Rue Award (1987-1989).<\/li>\n<li>Awarded as The Saratogian’s Athlete of the week multiple times.<\/li>\n<\/ul>\n<p>Empire State Games:<\/p>\n<ul>\n<li>Qualified multiple times for the Empire State Games in Freestyle &amp; Greco-Roman wrestling as well as judo.<\/li>\n<li>Earned the silver medal in Greco-Roman.<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Attended SUNY Delhi and participated in wrestling.<\/li>\n<li>Qualified for NJCAA Nationals (1990-1991).<\/li>\n<li>Featured in USA Wrestling Magazine in 1992 where he was ranked 4th.<\/li>\n<\/ul>\n<p>Mr. Cocozzo is the co-owner and President of Boyce &amp; Drake Plumbing &amp; HVAC, the oldest operating plumbing and heating company in Saratoga Springs established in 1947. Since ending his competitive wrestling career Mr. Cocozzo has spent years privately coaching local wrestlers to accomplish their goals.<\/p>\n<h4>Keelin Hollowood<\/h4>\n<p>Keelin Hollowood, class of 2013, participated in cross country and track at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Winner of the New Balance National Outdoor Championship in the Steeplechase in 2012 and 2013.<\/li>\n<li>Member of 4xmile and distance medley relay national championship teams.<\/li>\n<li>Section 2 Cross Country Champion in 2009 and runner-up in 2010-2012.<\/li>\n<li>Section 2 Indoor and Outdoor Track Championships in steeplechase and 1500m.<\/li>\n<li>Member of NYS Federation Meet Championship Cross Country team in 2009-2012.<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Competed in cross country and track and field at Providence College.<\/li>\n<li>Member of the 2013 NCAA Division National Championship Cross Country Team.<\/li>\n<li>Multiple top ten finishes in steeplechase at the Big East Championships.<\/li>\n<\/ul>\n<p>Hollowood has served as a volunteer coach for the Saratoga Springs High School track and cross country program. She is currently the Assistant Athletic Director of Skidmore College.<\/p>\n<h4>Tim Jackson<\/h4>\n<p>Tim Jackson, class of 1976, participated in football, wrestling, and track and field at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Served as captain of the football, wrestling, and track and field teams<\/li>\n<li>Named to All-League offense and defense teams in football.<\/li>\n<li>Undefeated Section 2 Champion and state qualifier in wrestling.<\/li>\n<li>Represented the Niagara-Adirondack JR AAU wrestling team competing in Europe.<\/li>\n<li>Held the pole vault record of 13’ during his junior year.<\/li>\n<li>Received an Outstanding Athlete Award, Hutch Tibbetts Award, nd the Steve Rue Memorial Trophy.<\/li>\n<\/ul>\n<p>Jackson graduated from SUNY Cobleskill. Prior to his passing in 2021, he was employed by National Grid and very active in his church.<\/p>\n<h4>Gary Kalinkewicz<\/h4>\n<p>Gary Kalinkewicz coached many levels of sports in the district including JV soccer, modified basketball, and varsity golf.<\/p>\n<p>His accomplishments include:<\/p>\n<ul>\n<li>Coaching record of 360-75 overall, which is seventh in NYS all-time.<\/li>\n<li>Coached the Blue Streaks to Section 2 Golf Championships in 1991, 1992, 1993, 1997, 1999, 2000, 2001, and 2002 &#8211; as well as many runner-up teams.<\/li>\n<li>Coached 24 students in the NYS state golf championship, including two state champions<\/li>\n<li>Served as Section 2 Golf Coordinator.<\/li>\n<\/ul>\n<p>Kalinkewicz has also served as a NYS basketball and soccer official. In 1994, he was awarded the National Federation of Interscholastic Coaches Association Award and in 2006, he was named to the Saratoga Springs City Hall of Fame. In 2016, he was inducted into the Upstate NY Basketball Hall of Fame<\/p>\n<h4>Kelly McKinley<\/h4>\n<p>Kelly (Mullan) McKinley, class of 1998, participated tennis, gymnastics, and track at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Named as a Section 2 and Surburban Council All-Star in gymnastics in 1997 and 1998.<\/li>\n<li>Qualified for the NY State Gymnastics Championships in 1995 –1997 and earned All-state honors in 1997.<\/li>\n<li>Member of multiple Suburban Council Championship Teams in gymnastics.<\/li>\n<li>Served as captain of the varsity softball team in 1998 and named a Suburban Council Senior All-Star.<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Attended SUNY Brockport and participated in gymnastics.<\/li>\n<\/ul>\n<p>Mckinley has served as a Section 2 official and as a volunteer for Saratoga Springs Little League and Saratoga Stars baseball. McKinley is now a teacher and varsity softball coach at Schuylerville High School.<\/p>\n<h4>Keith Potter<\/h4>\n<p>Keith Potter, class of 1973, participated in football and wrestling at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Named All-league player for offense and defense in football.<\/li>\n<li>Northern Conference junior varsity champion and varsity champion in wrestling.<\/li>\n<\/ul>\n<p>Potter went on to play semi-professional football for the Glens Falls Greenjackets. As a player, he was named as an Empire Football League All-Star for four years and was nominated to the Greenjackets Hall of Fame.<\/p>\n<p>He is employed at Allerdice Building Supplies. He has also served as an assistant coach for Saratoga Springs Pop Warner Football.<\/p>\n<h4>Emily Riley<\/h4>\n<p>Emily Riley, class of 2008, participated in field hockey at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Played field hockey for four years at the varsity level and was named captain during her senior year.<\/li>\n<li>Invited to the Elite Futures Olympic Development Program and Futures Elite Tournament Team.<\/li>\n<li>Led team to New York State Final 4 Championships in field hockey.<\/li>\n<li>Earned multiple awards including Saratogian’s Dream Team Player of the Year, Section 2 Player of the Year, and named to All NY State Field Hockey All Star Team in 2008.<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Two-time captain of St. Lawrence’s Field Hockey Team. Named Regional All American in 2009.<\/li>\n<li>Earned a Bachelor of Science in Biology from St Lawrence University.<\/li>\n<\/ul>\n<p>Riley now works as a nurse practitioner at Dana-Farber Cancer Institute in Boston.<\/p>\n<h3 id=\"2019-inductees\">2019 Inductees<\/h3>\n<h4>Tim Bush<\/h4>\n<p>Tim Bush, class of 2005, participated in football at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Member of the 2004 Class AA Super Champion team.<\/li>\n<li>Selected to Second Team All-State by the NYS Sports Writers.<\/li>\n<li>Selected as First Team All-Star Suburban Council by the Times Union, The Daily Gazette, and the Saratogian.<\/li>\n<li>Named as a Section 2 All-Star.<\/li>\n<li>Career Stats: 70 receptions, 838 yards, and five touchdowns.\n<p>Junior College:<\/li>\n<li>Attended Hudson Valley Community College and was named to the First Team All-Northeast Conference.<\/li>\n<li>Named as a NJCAA Honorable Mention All-American Leading Receiver as a freshman<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Attended University at Albany and participated in football and was letter winner in 2007, 2008 &amp; 2009<\/li>\n<li>Named as “Male Athlete of the Year” and “Team MVP” in 2009.<\/li>\n<li>Named to the First Team All-Conference in 2008 and 2009.<\/li>\n<li>Undefeated NEC Champion (2007-2008)<\/li>\n<li>2008 Gridiron Classic Champion (Bowl Game) vs. Jacksonville<\/li>\n<li>Has six 100 yd plus games<\/li>\n<li>His stats included of 147 receptions, 1880 yds and 10 touchdowns with a 12.8 average per catch.\n<p>After college, Mr. Bush played in the IFL for the West Texas Roughnecks in 2010 and the New Mexico Stars in 2011. He also attended a private workout with Saskatchewan Roughriders CFL in 2011.<\/li>\n<\/ul>\n<h4>Anthony DeMatteo<\/h4>\n<p>Anthony “Tony” DeMatteo, class of 1974, participated in football, basketball, and baseball for Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Member of the Five Letter Club.<\/li>\n<li>President of the Boy’s Varsity Club in 1974.<\/li>\n<li>Member of the 1974 Foothills Council Baseball team.<\/li>\n<li>Named as the “Most Valuable Player” in 1974 for football during his senior year.<\/li>\n<li>Recipient of the Hutch Tibbets Award in 1974.<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Attended Daemen College and graduated with a BS in Physical Therapy in 1978<\/li>\n<\/ul>\n<p>After college, Mr. DeMatteo worked at Albany Medical Center from 1978-1981. He initiated sports participation screening clinics in conjunction with the Department of Orthopedic Surgery. In 1980, he started his own private practice. Mr. DeMatteo was a member of the 1997 United States Speed Skating Medical Team.v<\/p>\n<p>He continues to be involved with Saratoga Springs High School coaches and student-athletes through his development of a program to bring the first Certified Athletic Trainers to the school.<\/p>\n<p>Mr. DeMatteo currently lives in the area with his family and owns Saratoga Physical Therapy.<\/p>\n<h4>Erik Hoover<\/h4>\n<p>Erik Hoover, class of 1999, participated in basketball and baseball for Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Named “Most Outstanding Player” at the 1998 baseball sports awards banquet in 1998.<\/li>\n<li>Co-Captain of the basketball and baseball team in 1999.<\/li>\n<li>Named as the 1999 Saratogian “Player of the Year” in baseball.<\/li>\n<li>Senior year baseball stats: .447 batting average, 26 RBI, 38 hits, which was the school record in 1999.<\/li>\n<li>Received the Benny Fasulo Memorial Award in 1999.\n<p>College:<\/li>\n<li>Attended The College of St. Rose and played baseball.<\/li>\n<li>Part of The College of St. Rose baseball team who won the New York Collegiate Athletic Conference championship.<\/li>\n<li>Served as Co-Captain of the baseball team in 2002 and 2003.<\/li>\n<li>Named to Northeast 10 Conference All-Conference Team as a First Team Utility Player in 2003.\n<p>Erik Hoover is currently a teacher at the Lake George Central School District. He has coached the Lake George High School Varsity Baseball team for over 10 years and has won more than 100 games. In 2018, the team won the Section 2 Class CC Championship.<\/li>\n<\/ul>\n<h4>Kevin Hopkins<\/h4>\n<p>Kevin Hopkins, class of 2004, participated in basketball for Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Received the Scholar-Athlete Award for boys’ basketball and the Vince DeGregory Basketball award in 2004.<\/li>\n<li>Selected to the First-Team All-Suburban Council.\n<p>College:<\/li>\n<li>Attended Amherst College and played basketball.<\/li>\n<li>Member of the 2007 Division 3 National Championship Basketball Team. The team made three visits to the national semifinals while he was on the team.<\/li>\n<li>Top five all-time at Amherst College in field goal percentage, blocked shots, and total points.\n<p>After college, he played professional basketball in Germany for two years before returning to Amherst College to be the assistant coach for two seasons. While coaching, he earned a Masters Degree in Sports Management.<\/li>\n<\/ul>\n<p>In June 2017, he was named as the Head Coach at Muhlenberg College in Pennsylvania.<\/p>\n<h4>Tim Parker<\/h4>\n<p>Tim Parker, class of 1989, participated in basketball for Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Scored over 1900 career points, which placed him fourth in section 2 history.<\/li>\n<li>At the time he graduated, he was the all-time leading scorer in large schools within Section 2 basketball.<\/li>\n<li>Averaged 24 points per game and was named to the NYSSWA Fifth Team Large School All-State Team during his junior year.<\/li>\n<li>Averaged 35.9 points per game and was named to the NYSSWA Fifth Team Class A All-State Team during his senior year.<\/li>\n<li>During his junior year, he led Saratoga to a final four appearance in the NYSPHSAA Championships.\n<p>College:<\/li>\n<li>He received a full scholarship to Providence College of the Big East, the premier NCAA league at that time. However, he left Providence and attended Champlain Community College.<\/li>\n<li>While attending Champlain, the basketball team was ranked #3 nationally and #1 in the northeast among junior colleges.<\/li>\n<\/ul>\n<h4>Jordan Stevens<\/h4>\n<p>Jordan Stevens, class of 2009, participated in basketball for Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Started on Varsity Basketball for five years, beginning as an eighth grader.<\/li>\n<li>Played Varsity Baseball and lettered as an eighth grader.<\/li>\n<li>Scored 1,799 career points, the second most in school history.<\/li>\n<li>A three-time All-State selection (8th AA team in 2008-09, 8th AA team in 2007-08, 11th AA team in 2006-07.)<\/li>\n<li>Named Suburban Council Player of the Year in 2006-2007 and 2008-2009.<\/li>\n<li>Nominated for the McDonald&#8217;s All-American game.<\/li>\n<li>Served as team captain for two years.<\/li>\n<li>He also lettered in volleyball and track.\n<p>College:<\/li>\n<li>Attended College of the Holy Cross and was a four-year member of the men’s basketball team.<\/li>\n<li>As a senior he appeared in 29 games, averaging 5.7 points, 2.5 assists, 2.4 rebounds and 0.8 steals per contest, while hitting 34.6 percent of his shots from three-point range (36 of 104).<\/li>\n<li>Over his collegiate career, he appeared in over 100 games, totaled 518 points, 207 rebounds and 149 assists.<\/li>\n<li>He won the Richard J. Maloney Award, for spirit and energy as a loyal contributor to the Holy Cross men&#8217;s basketball program.<\/li>\n<\/ul>\n<h3 id=\"2018-inductees\">2018 Inductees<\/h3>\n<h4>Brianne Bellon<\/h4>\n<p>Brianne Bellon, class of 2010, participated in cross-country, winter track and spring track at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Member of varsity cross country (5 years) varsity winter track (6 years) and varsity spring track (6 years)<\/li>\n<li>Member of the undefeated cross-country team, which was the suburban council, sectional, and federation champions for five years.<\/li>\n<li>She was a member of the number two team in the USA for three years<\/li>\n<li>Brianne was on seven national champion relay teams: 4xmile, 4&#215;800, and distance medley relay. The first was as a seventh grader.<\/li>\n<li>Brianne is the current 800-meter record holder for Saratoga Springs, and a member of the Saratoga and Section 2 record holding 3200-meter relay team.\n<p>College:<\/li>\n<li>Attended University at Albany and participated in cross-county, winter track and spring track.<\/li>\n<li>She was a member of the distance medley relay, which holds the university record.\n<p>Brianne is currently a social studies teacher in the Galway School District.<\/li>\n<\/ul>\n<h4>Claudia Didziulis<\/h4>\n<p>Claudia Didziulis, class of 1952, participated in varsity basketball, varsity cheerleading and varsity softball for Saratoga Springs High School. After graduating from Becker College in Worcester, Ms Didziulis became a long-time secretary to Athletic Directors Raymond Waldron and Bob Stulmaker from 1976-2000.<\/p>\n<p>In addition, she received the first ever Section 2 Athletic Director’s Secretary of the Year Award in 1999 at the NYS Athletic Administrators Conference.<\/p>\n<h4>Rory Pedrick<\/h4>\n<p>Rory Pedrick, class of 2004, participated in varsity football and varsity lacrosse for three years at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>He was a captain of football &amp; lacrosse team during his senior year.<\/li>\n<li>Was selected to the First Team Suburban Council in lacrosse for two years.<\/li>\n<li>He was a High School All American in Lacrosse.<\/li>\n<li>He was the Saratogian Player of the Year and a Saratogian and Daily Gazette First Team Quarterback.<\/li>\n<li>He was the recipient of the Ray Waldron Outstanding Athlete Award.<\/li>\n<li>He earned the National Football Foundation Hall of Fame Scholar Athlete Award.\n<p>College:<\/li>\n<li>Rory went on to play four years of Division 1 Lacrosse at UMass and made it to the National Championship game as a sophomore.<\/li>\n<li>Rory was the first Blue Streak to be recognized twice on ESPN’s – “Play of the Day.”<\/li>\n<li>He was part of NEILA Scholar-Athlete Team.<\/li>\n<li>He was one of four senior captains at UMass during his senior year.<\/li>\n<\/ul>\n<h4>Bill Scott<\/h4>\n<p>Bill Scott, class of 1929, participated in varsity football, varsity basketball, and varsity baseball for four years at Saratoga Springs High School. Mr. Scott was a two-sport athlete at Springfield College and excelled at baseball and track. He played baseball and batted third in front of Ted Williams on the US Army team in WWII.<\/p>\n<p>After graduating from Springfield College, he started the athletic programs at Northville High School and served as both Athletic Director and coach for all teams. Next, he became the Athletic Director for Ballston Spa where he began the sports program and was the first football, baseball, and basketball coach in the program’s history. He coaches in seven decades and was also a top football official in the 1930s and 1940s. The school mascot of the “Scotties” was named in his honor.<\/p>\n<h4>Lawrence Youngblood<\/h4>\n<p>Lawrence “Toby” Youngblood, class of 1975, participated in varsity basketball and varsity baseball for at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>He was a member of the Foothills Council All-Star Team in 1974-75.<\/li>\n<li>He was a co-captain of the Foothills Council basketball team and was awarded most improved player in 1974-75.<\/li>\n<li>He was a member of the Foothills Council champion basketball and baseball team in 1974-75.<\/li>\n<li>In 1975, he was awarded Outstanding Male Athlete, Section 2 Leader in stolen base percentage, baseball’s most valuable player, and was a Booster Club Award Winner.\n<p>After high school, Mr. Youngblood coached basketball for CYO, and was the coach and general manager for Saratoga American Little League. In addition, he coached baseball and basketball at Spa Catholic High School, Schuylerville High School and Galway High School.<\/li>\n<\/ul>\n<p>Mr. Youngblood is currently involved in the Saratoga American Little League, high school sports, NY Mets semi-pro baseball team, Black Student Alliance All-Star Basketball, and the Schuylerville Community Theater.<\/p>\n<h3 id=\"2017-inductees\">2017 Inductees<\/h3>\n<h4>Jen Dryer (Pennell)<\/h4>\n<p>Jen Dryer, class of 1994, participated in soccer, basketball, softball and lacrosse at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Played varsity soccer and varsity basketball as an eighth grader<\/li>\n<li>Named Suburban Council First Team All-star multiple times for soccer, basketball and lacrosse<\/li>\n<li>Part of Section 2 Division 1 Championship Lacrosse Team in 1991 and 1992.<\/li>\n<li>Named First Team Saratoga Dream Team for basketball<\/li>\n<li>Finished basketball career with 1523 points, 325 assists, 348 steals, and 228 rebounds\n<p>College:<\/li>\n<li>Attended West Virginia Wesleyan College from 1994-1998 on a full scholarship for the Division 2 basketball program.<\/li>\n<li>Started as point guard all four years and her overall career included 775 points, 460 assists, 206 steals, and 297 rebounds.<br \/>\n<h4>Robert Guglielmo<\/h4>\n<\/li>\n<\/ul>\n<p>Robert Guglielmo was a longtime assistant coach for Saratoga Springs High School from 1971-2011. Guglielmo coached many levels of sports in the district including:<\/p>\n<ul>\n<li>Freshman football in 1971<\/li>\n<li>Varsity football from 1972-2010<\/li>\n<li>JV wrestling from 1971-1974<\/li>\n<li>Varsity lacrosse from 1988-1993<\/li>\n<li>JV lacrosse from 1994-2003 and in 2005.<\/li>\n<li>Modified lacrosse from 2009-2011\n<p>During Guglielmo’s 40 years of coaching football, SSHS team accomplishments include: 15 league championships, 22 sectional playoffs, 5 sectional runner-ups and 5 championships. Guglielmo also assisted lacrosse and wrestling teams to multiple league and sectional championships.<\/li>\n<\/ul>\n<h4>Matthew Kuenzel<\/h4>\n<p>Matthew Kuenzel, class of 2002, participated in football, indoor track and field and outdoor track and field at Saratoga Springs High School. Some of his accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Team Captain for football (2001) and track and field (2002)<\/li>\n<li>Named Section 2 All-Star Captain and Offensive Team Player of the Year for football in 2001<\/li>\n<li>School record holder for the shot out since 2002.<\/li>\n<li>Three-time NYS Meet Qualifier: discus (2001), shot put (indoor-2002), shot put (outdoor-2002)<\/li>\n<li>Received the Clayton Chubb Outstanding Male Athlete of the Year Award and the NYS Sports Foundation Scholar Athlete Award in 2002<\/li>\n<li>School record holder for the shot out since 2002<\/li>\n<li>Part of Suburban Council Boys Track and Field Championship Team.<\/li>\n<li>Yaddo Medal Award Winner\n<p>College:<\/li>\n<li>Attended SUNY Geneseo where he served as Co-Captain of the Men’s Indoor and Outdoor Track and Field Teams<\/li>\n<li>NCAA SUNYAC Conference Sportsmanship Award Winner and the 2006<\/li>\n<li>Geneseo Male Contribution and Leadership Award<\/li>\n<li>Currently the SUNY Geneseo school record holder in the indoor shot put, outdoor shot put and discus<\/li>\n<li>Five-time SUNY Geneseo Student Athlete of the week One-time ECAC Field Athlete of the week\n<p>After graduating, Kuenzel coached at the college level and teaches middle school mathematics.<\/li>\n<\/ul>\n<h4>Landon Moore<\/h4>\n<p>Landon Moore graduated from Saratoga Springs High School in 1970 and was dedicated to the youth in Saratoga Springs for over 43 years.<\/p>\n<p>Moore began a career of service as a camp counselor for the City of Saratoga Springs Recreation Department. At the age of 16, and under the tutelage of the late Bennie Fasulo, he coached the All Star Frogs in Biddy Basketball. Throughout the years, he also coached the Pop Warner football program, Little League Baseball, a women&#8217;s softball league, Skidmore College softball and Saratoga Catholic Central High School football and baseball.<\/p>\n<p>Moore was appointed to the city&#8217;s first recreation commission by former mayor Raymond Watkin. He received the &#8220;Outstanding Young Man&#8221; award in 1984 and was a recipient of the &#8220;Outstanding Athlete Volunteer Recognition&#8221; award in 2006. In addition, the basketball court at Saratoga Springs Recreation Center was named in his honor. Moore passed away in 2011.<\/p>\n<h4>Madalayne Smith<\/h4>\n<p>Madalayne Smith, class of 2010, participated in indoor track and field and outdoor track and field at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>First in Section 2 history for the 100-meter hurdles<\/li>\n<li>Second in Section 2 history for the 100-meter dash<\/li>\n<li>11th in Section 2 history for the long jump<\/li>\n<li>State and Federation Champion in the 100-meter hurdles\n<p>College:<\/li>\n<li>Attended University of Connecticut and competed in indoor track and outdoor track<\/li>\n<li>Finished fourth in the outdoor track 100-meter hurdles at the Big East Championships and at the American Athletic Conference Championships in 2014<\/li>\n<li>Finished third in the indoor track 60-meter hurdles at the American Athletic Conference Championships and eighth in the ECAC Championships in 2013-14<\/li>\n<li>Finished first in the indoor track 60-meter hurdles at the New England Championships in 2012-13 with a meet record of 8.47<br \/>\n<h4>Maureen Van Neste (Wickerham)<\/h4>\n<\/li>\n<\/ul>\n<p>Maureen Van Neste, class of 1994, participated in basketball and outdoor track and field at Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Participated in varsity outdoor track and field for six years<br \/>\n1993 NYSPHSAA discus state champion and 1994 NYSPHSAA discus runner-up<\/li>\n<li>Section 2 Champion in the shot put and discus in 1994<\/li>\n<li>Suburban Council Champion in the shot put and discus in 1994<\/li>\n<li>Co-captain of varsity basketball team during 1993-1994 season\n<p>Van Neste attended Syracuse University and participated in indoor track and field and outdoor track and field. She graduated Suma Cum Laude with a Bachelor of Arts in Policy Studies in 1997 and went on to earn a Master of Public Administration from Syracuse University and a Juris Doctor from Georgetown University. She is a Professor and the Director of Experiential Learning at Chicago-Kent College of Law at Illinois Tech in Chicago, IL.<\/li>\n<\/ul>\n<h4>Jamie Welsh (Sweeney)<\/h4>\n<p>Jamie Welsh, class of 2002, participated in cross country, indoor track and field and outdoor track and field for Saratoga Springs High School. Some of her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Part of girls cross country team to win the state, federation and national title in 2001<\/li>\n<li>Named a Suburban Council All Star for cross country, indoor and outdoor track and field<\/li>\n<li>Ran a leg of the New York State and federation indoor and outdoor 4&#215;800 relay team<\/li>\n<li>Named an All-American for the Steeplechase and Distance Medley Relay in 2002<\/li>\n<li>Was listed in the “Who&#8217;s Who Among High School Students” and a finalist for the 2002 Sports Foundation Section II Scholar Athlete Award\n<p>College:<\/li>\n<li>Attended University of Rhode Island and participated in cross country, indoor track and outdoor track<\/li>\n<li>Received Rookie Performer of the Meet Award at the outdoor A-10 Championships in 2002<\/li>\n<li>Placed twelfth in the steeplechase at the New England Championship in 2005<\/li>\n<\/ul>\n<h3 id=\"2016-inductees\">2016 Inductees<\/h3>\n<h4>Cassie Beckwith<\/h4>\n<p>Cassie Beckwith, class of 1992, participated in basketball (3 years), soccer (4 years) and lacrosse (3 years) at Saratoga Springs High School. Her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Captain of soccer, basketball and lacrosse teams.<\/li>\n<li>Named to Suburban league first team in basketball.<\/li>\n<li>Widely regarded by her coaches as one of the best athletes to ever graduate from Saratoga Springs High School.\n<p>College:<\/li>\n<li>Named Rookie of the Year for basketball in 1993-1994.<\/li>\n<li>Named Athlete of the Year in 1996.<\/li>\n<li>Named to basketball 1st team during her sophomore, junior and senior year.<\/li>\n<li>Part of Franklin College Soccer Team that were NCAA champs in 1995 and 1996, 2nd team conference senior year.<\/li>\n<\/ul>\n<h4>Ronnie Bostick<\/h4>\n<p>Ronnie Bostick, class of 1958, participated in basketball at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Key member of two Section 2 Basketball Championship teams in 1955-56 and 1957-1958.<\/li>\n<li>Considered one of the finest players in Section 2 during his playing days.\n<p>Following High School, Bostick attended Paul Smith Junior College where he was selected 1st Team Junior College All-American and went on to play at the University of Wyoming in 1961.<\/li>\n<\/ul>\n<p>Following his time at the University of Wyoming, he enlisted in the Air Force and was a member of the US Air Force #1 Basketball team in Europe. He excelled and received a commendation from the US European Air Force Commander. Bostick passed away in April 2009.<\/p>\n<h4>Hannah Davidson<\/h4>\n<p>Hannah Davidson, class of 2008, participated in cross country, winter track and spring track for six years at Saratoga Springs High School. Her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Member of 2004 National Champion Cross Country Team.<\/li>\n<li>Three-time Footlocker finalist.<\/li>\n<li>Three-time Nike Team Nationals participant.<\/li>\n<li>New York State Champion in the steeplechase.<\/li>\n<li>New York and United States Freshman 2K steeplechase record holder.<\/li>\n<li>Nike Outdoor Nationals Champion in the 2K steeplechase.\n<p>College:<\/li>\n<li>Named NCAA DI Cross Country and Track All-American at Providence College.<\/li>\n<li>Two-time Big East Runner-up in the 3000 meters and 3K Steeplechase.<\/li>\n<li>Named to Second Team All-American Indoor in the 3000 meters.<\/li>\n<li>Named New England Runner of the Year in 2015.<\/li>\n<li>Named a NCAA Division I All-American in Cross Country and Track.\n<p>After Providence College, Davidson attended graduate school at Syracuse University. Post-collegiate successes include a seventh place finish at the 2015 USATF Indoor Championship in the two mile.<\/li>\n<\/ul>\n<h4>Scott Ewing<\/h4>\n<p>Scott Ewing, class of 1972, participated in baseball (3 years), basketball (3 years) and football (2 years), at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>Served as Captain in each of the following sports: varsity baseball, varsity basketball, junior varsity football and baseball, and freshman basketball and baseball.<\/li>\n<li>1972 Booster Club award, Best Athlete.<\/li>\n<li>1972 Key Club award, Best Athlete.<\/li>\n<li>1972 most improved player for varsity baseball.<\/li>\n<li>Led team in on-base percentage, runs scored, and stolen bases for varsity baseball in 1972.<\/li>\n<li>Coaches and players of the class of 1972 recognized Scott with major athletic awards at the conclusion of his senior year.\n<p>Ewing attended and graduated from Duke University in 1976.<\/li>\n<\/ul>\n<h4>Danielle Coon-Messenger<\/h4>\n<p>Danielle Coon-Messenger, Class of 2001, participated in cross county, winter track and spring track for six years at Saratoga Springs High School. Her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>State Champion in Cross Country.<\/li>\n<li>3000 meter State Champion in Spring Track.<\/li>\n<li>Foot Locker Finalist in the 2000 meters.<\/li>\n<li>New York State Cross Country Runner of the Year in 7th &#8211; 12th grade.<\/li>\n<li>Foot Locker National Championship competitor.<\/li>\n<li>Member of National Championship Distance Medley Relay.<\/li>\n<li>Member of the State and National Champion Cross Country Team (1996 &#8211; 2000)\n<p>After high school, Coon-Messenger competed in cross country and track at Wake Forest University.<\/li>\n<\/ul>\n<h4>Hutchin D. Tibbetts<\/h4>\n<p>Hutchin D. Tibbitts, class of 1954, participated in varsity football (3 years), basketball (2 years) and baseball (2 years) at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School Varsity Football:<\/p>\n<ul>\n<li>Co-captain of the varsity football team in 1953.<\/li>\n<li>Named to the Sports Writers All-American School Honorable Mention by the Wigwam Wiseman of America Football Committee. One of 10 backfield players from New York State.<\/li>\n<li>Named as a member of the National High School All-American All Stars by the Wigwam Wiseman of American Football Committee.<\/li>\n<li>Tibbitts scored 11 rushing touchdowns, passed for 7 touchdowns and ran for extra points for a total of 72 points in a 7 game schedule.\n<p>High School Varsity Basketball:<\/li>\n<li>Played guard on the varsity basketball team in 1952-53.<\/li>\n<li>Part of the 1953-54 Class B Section II team.<\/li>\n<li>Scored 141 points and averaged 7 points per game, 4th highest on the team; had 72 rebounds, 3rd highest, 79 assists, 2nd highest.<\/li>\n<li>During the Sectional II Championship game against Glens Falls in 1954,<\/li>\n<li>Tibbitts contributed 10 points and defended Glens Falls’ best scoring player.\n<p>High School Varsity Baseball:<\/li>\n<li>Led the team in runs, was highest in stolen bases with 16 in 11 games, and batted 309, 4th highest.<\/li>\n<li>Tibbitts played centerfield and was known for his defensive abilities, often holding runners to singles or throwing them out at the plate.\n<p>College:<\/li>\n<li>Received a scholarship to play football for Amherst.<\/li>\n<li>Was the team’s second leading scorer during his sophomore year (1955).<\/li>\n<li>Tibbitts was written up in the September 24, 1956 issue of SPORTS ILLUSTRATED – Special Football Issue as a player to watch in the 1956 season.\n<p>After graduating college, Tibbitts played semi-pro football. He played offensive halfback and quarterback plus defensive safety for the Glove City Colonials from 1961 – 63. Tibbitts also played for a Boston area town team in 1959.<\/li>\n<\/ul>\n<h4>Susan Hoffman<\/h4>\n<p>Susan Hoffman was a teacher and coach in the Saratoga Springs City School District from 1975-2012. Hoffman coached many levels of sports in the district including:<\/p>\n<ul>\n<li>Varsity field hockey – 22 years<\/li>\n<li>Modified field hockey &#8211; 13 years<\/li>\n<li>Varsity basketball (girls) &#8211; 7 years<\/li>\n<li>JV volleyball (girls)– 1 year<\/li>\n<li>Varsity softball– 8 years<\/li>\n<li>Modified swimming – 1 year<\/li>\n<li>Girls lacrosse &#8211; 23 years\n<p>Hoffman earned several Suburban Council Championships, a state final four appearance in 1997, three regional championships and ten Section 2 Class A Championships (3 Field Hockey\/7 Lacrosse). Other accomplishments include:<\/li>\n<li>Named Section 2 Coach of the Year three times.<\/li>\n<li>Named Adirondack Chapter US Lacrosse Woman of the Year (Ciera 1995).<\/li>\n<li>Inducted into Adirondack Chapter US Lacrosse Hall of Fame in 2002 (first woman).<\/li>\n<li>Inducted into City of Saratoga Springs Athletic Hall of Fame in 2007.<\/li>\n<li>All of the Varsity teams she coached earned NYSPHSAA Scholar Athlete awards.<\/li>\n<li>Coached 232 All Americans and\/or All-American Honorable Mentions, numerous Academic All-Americans and over 100 athletes playing next level in lacrosse.<\/li>\n<li>Volunteer coach for Empire State Games (Field Hockey) and Stars and Stripes lacrosse tournament.<\/li>\n<\/ul>\n<h4>Damian Fantauzzi<\/h4>\n<p>Damian Fantauzzi was an art teacher and coach for Saratoga Springs High School for 34 years. Fantauzzi coached many levels of sports including:<\/p>\n<ul>\n<li>Varsity and JV boys basketball – 19 years (varsity:184 wins\/123 losses)<\/li>\n<li>Girls varsity basketball – 8 years (80 wins\/82 losses)<\/li>\n<li>Girls modified basketball – 2 years (26 wins\/2 losses)<\/li>\n<li>JV tennis &#8211; 22 years<\/li>\n<li>Boys varsity tennis – 12 years (132 wins\/48 losses)<\/li>\n<li>Track &#8211; 17 years\n<p>His accomplishments include:<\/li>\n<li>Named Coach of the Year for the Suburban Council in 1997 and 2001.<\/li>\n<li>Named to Junior College Adirondack All State 5th team.<\/li>\n<li>All League Western B Conference 1962 Mechanicville High Basketball scholarship to New Mexico Highlands Cowboy University.<\/li>\n<li>Won Foothills JV League in 1974-1975, 1975-1976, 1977-1978, 1979-1980.<\/li>\n<li>Won Foothills Varsity League in 1996-1997.\n<p>Before becoming a teacher and coach, Fantauzzi played Junior College ball at Adirondack and averaged 21 points a game. He then played at New Mexico Highlands (NAIA school) and averaged 10 points a game. He tried out with the Denver Rockets of the old ABA. He played one year semipro with the Schafer Brewers.<\/li>\n<\/ul>\n<h3 id=\"2015-inductees\">2015 Inductees<\/h3>\n<h4>Brenda Adams<\/h4>\n<p>Brenda Adams, a teacher and coach in the Saratoga Springs City School District for 28 years, was the winningest hoops coach for girls’ basketball in school history with a career record of 100-54. In addition, Adams coached two softball teams to sectional titles in 1994 and 2000, and was named Saratogian Coach of the year during both of those seasons. In 2014, she was named Times Union’s Golf Coach of the Year after a successful season. Adams passed away in January 2015 after losing a battle with ovarian cancer.<\/p>\n<p>Adams coached 64 different seasons from 1987-2014 at Saratoga Springs High School in six different sports including field hockey, basketball, softball, volleyball, bowling and golf. <\/p>\n<p>Below is a list of the sports and levels Adams coached during her 28 year career:<\/p>\n<ul>\n<li>Varsity girls basketball – 7 years<\/li>\n<li>Varsity bowling – 8 years<\/li>\n<li>Varsity field hockey – 1 year<\/li>\n<li>Varsity golf – 7 years<\/li>\n<li>Varsity softball – 6 years<\/li>\n<li>Varsity girls volleyball – 5 years<\/li>\n<li>JV field hockey – 2 years<\/li>\n<li>JV basketball – 1 year<\/li>\n<li>JV softball – 4 years<\/li>\n<li>JV volleyball – 3 years<\/li>\n<li>Freshmen field hockey – 3 years<\/li>\n<li>Freshmen basketball – 4 years<\/li>\n<li>Freshmen softball – 9 years<\/li>\n<li>Freshmen volleyball – 4 years\n<p>No matter what sport Adams coached, her teams were always prepared, competitive and looked like they enjoyed themselves, a direct reflection on a coach who was always a delight to be around. <\/p>\n<h4>Mike Beach<\/h4>\n<p>Mike Beach, class of 1979, participated in football, basketball and baseball at Saratoga Springs High School. His accomplishments include:<\/li>\n<li>Team captain, Most Valuable Player, and key players on the undefeated<\/li>\n<li>Foothills Conference championship football team<\/li>\n<li>Named to the First Team All-League, All-Area, and All-State in football<\/li>\n<li>Named to the First Team All-League and All-Area in basketball<\/li>\n<li>Named to the First Team All-League and All-Area in baseball. The team was the Section 2 runner-up<\/li>\n<li>He received the 1979 Booster Club Award, the highest award given at end of year\n<p>Beach accepted a baseball scholarship to Stetson College and then became a Saratoga Springs Firefighter. Beach passed away in May 2006 and there is a scholarship award given each year in his honor and memory.<\/p>\n<h4>Elise Britt<\/h4>\n<p>Elise Brit, class of 2005, participated in field hockey (2 years), lacrosse (4 years), gymnastics (4 years), and track and field (1 year) while at Saratoga Springs High School. Her accomplishments include:<\/p>\n<p>High School:<\/li>\n<li>Member of 2004 national lacrosse team,<\/li>\n<li>Member of the 2004 suburban council all-star team<\/li>\n<li>Leading scorer in field hockey in 2004<\/li>\n<li>Member of 2004 national lacrosse team<\/li>\n<li>Pole vault section champion during indoor track and field in 2004<\/li>\n<li>Received the 2005 Clayton Chubb Athletic Award<\/li>\n<li>Received the 2006 Outstanding Athlete Hall of Fame (Varsity gymnastic sectional champion and state qualifier)<\/li>\n<li>Britt worked closely with Mike Miller to start powder puff football.\n<p>College:<\/li>\n<li>Played on a top 20 nationally ranked Division 3 field hockey team while at Skidmore College. The team made four NCAA tournament appearances and won three Liberty League Championships.<\/li>\n<li>2009 Liberty League Tournament MVP in Field Hockey<\/li>\n<li>Named to Liberty League All-Academic Team<\/li>\n<li>Nominated to Skidmore Hall of Fame 2008-2009 <br \/>\n<h4>Robert “Buddy” Clarke<\/h4>\n<p>Robert “Buddy” Clarke, class of 1979, participated in basketball and outdoor track while at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/li>\n<li>Named to the New York State Sports Writers Association all-state sixth team, Large Schools, 1978-79.<\/li>\n<li>Averaged 21.8 points and 10 rebounds per game, named to The Saratogian Dream Team basketball selection in 1978-79. He was widely considered one of the top players in the area<\/li>\n<li>Member of regular season undefeated 1977-78 boys basketball team<\/li>\n<li>Capital District Basketball Hall of Fame inductee in 2014<\/li>\n<li>Graduated as third fastest 100 yard sprinter in Section 2 outdoor track history with a time of 9.8 seconds and seventh fastest in the 200 meters with a time of 22.0 seconds.<\/li>\n<li>4th place finisher in the 200 at the NYSPHSAA Outdoor Track Championships in 1979.\n<p>College:<\/li>\n<li>Graduated as Springfield College&#8217;s all-time leading scorer with 1,766 points (breaking record held for 30 years), first in career field goals, second in career free throws, third in career assists, and ninth in career rebounds<\/li>\n<li>Named to NCAA Division II All-American second team in 1982. <br \/>\n<h4>Samuel “Sam” Downing<\/h4>\n<p>Sam Downing, class of 1943, participated in football (4 years), basketball (3 years), baseball (3 years) and tennis (1 year) while at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/li>\n<li>President of the boys’ varsity club in 1942<\/li>\n<li>Captain of the football team in 1942<\/li>\n<li>Winner of High Point Trophy (best athlete) in 1943<\/li>\n<li>Captain of basketball and baseball Teams in 1943\n<p>After high school, Downing served in the United States Army as an airplane mechanic and then as the Saratoga Springs Deputy Commissioner of Public Works for 19 years.<\/p>\n<p>Downing played for the Saratoga Colt semi-pro baseball team and Saratoga semi-pro basketball. Additionally, he owned Downing Store on Lake Avenue for nine years across from east side recreation. Downing passed away in October 2009.<\/p>\n<h4>Jerry Grolley<\/h4>\n<p>\nJerry Grolley, Class of 1955, participated in basketball and baseball while at Saratoga Spring High school. His accomplishments include:<\/p>\n<p>High School:<\/li>\n<li>Named to All-star team in 1952<\/li>\n<li>Played on team that won Basketball League Championships in 1952 and won the Western League trophy in 1954<\/li>\n<li>Named MVP in basketball in 1953<\/li>\n<li>Played on team that won semi-pro basketball playoffs in 1955\n<p>Grolley went on to manage and coach American Little League baseball teams and was an assistant coach for Saratoga Springs JV Basketball.<\/p>\n<h4>Greg Kelsey<\/h4>\n<p>\nGreg Kelsey, class of 2006, participated in cross-country and indoor track for 3 years while at Saratoga Springs High School. Greg is the only male national champion from Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School:<\/li>\n<li>Two-time High School All-American<\/li>\n<li>National Champion in the steeplechase in 2006<\/li>\n<li>Millrose Mile competitor, Foot Locker finalist<\/li>\n<li>Member of national distance medley relay champion team<\/li>\n<li>Runner-up in two mile at the NYS Indoor Track Championship<\/li>\n<li>Captain of cross country and winter track teams for two years<\/li>\n<li>Member of Suburban Council and Sectional Championship cross country team in 2004 and 2005<\/li>\n<li>Member of State Champion cross country team in 2005<\/li>\n<li>Member of National Champion cross country team in 2005\n<p>College:<\/li>\n<li>Competed in cross country, indoor and outdoor track at University of Maryland<\/li>\n<li>Captain of University of Maryland cross-country and track teams for 3 years<\/li>\n<li>Competed in NCAA Championship.\n<p>Kelsey earned a degree in Kinesiology. He taught in Milwaukee and Washington, DC. As part of the Teach for America program and currently teaches in Philadelphia.<\/li>\n<\/ul>\n<h3 id=\"2014-inductees\">2014 Inductees<\/h3>\n<h4>Nicole Blood<\/h4>\n<p>Nicole Blood, class of 2006, exceled in track and cross-country at Saratoga Springs High School. Ms. Blood continued her running career at the University of Oregon where she was recognized as an All-American in cross country. Her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>12 time All-American in cross country, indoor and outdoor track<\/li>\n<li>Outdoor track National Champion in the mile<\/li>\n<li>Member of 2004 National #1 Cross Country team<\/li>\n<li>Member of 2005 #2 National Cross Country team<\/li>\n<li>Outdoor track NYSPHSAA first place in 1600 meters<\/li>\n<li>Cross country NYSPHSAA Class A Champion in 2001, 2003, 2004<\/li>\n<li>Cross country NYS Federation Champion in 2002, 2003, 2004<\/li>\n<li>Cross country Section 2 Class A Champion in 2001, 2002, 2003, 2004<\/li>\n<li>Cross country Footlocker National Championship 2002 (9th), 2003 (7th), 2004 (21st), 2005 (28th)<\/li>\n<li>Indoor track NYSPHSAA first place in the mile<\/li>\n<li>Indoor track member of Penn Relays Distance Medley Relay Champion Team<\/li>\n<li>Indoor track member of National Champion Distance Medley team in winter and spring track\n<p>College:<\/li>\n<li>Attended University of Oregon<\/li>\n<li>Recognized as the most decorated female athlete in University of Oregon history<\/li>\n<li>All-American in Cross country<\/li>\n<\/ul>\n<h4>\nBarbara Chubb<\/h4>\n<p>Barbara Chubb, a former elementary teacher in the Saratoga City School District, taught from 1965 to 1999. Ms. Chubb was involved in a variety of school and community athletic groups. Due to her high level of involvement, she was asked by former Athletic Directors Raymond Waldron and Bob Stulmaker to help research the historical facts surrounding the history of Saratoga’s community and high school athletics. A conservative estimate of her support to the sporting programs in Saratoga’s community and high school is estimated at 40 years. Her involvement includes:<\/p>\n<p>Involvement:<\/p>\n<ul>\n<li>Original board member for Saratoga Miss Softball<\/li>\n<li>Started an evening program at Division Street Elementary School allowing young children to have open-gym time<\/li>\n<li>Supported &#8220;All-Sports Booster Club&#8221;, prior to the district having individual booster clubs<\/li>\n<li>Raised money for all levels of Saratoga’s football program, by orchestrating the program’s advertising book, which raised $5,000 a year<\/li>\n<li>Served as Treasurer for the Girls’ Basketball Booster Club for 5 years<\/li>\n<li>Charter member of the Committee for the Allegiance Bowl and member of its board for the first six years<\/li>\n<\/ul>\n<h4>Moira D’Andrea<\/h4>\n<p>Moira D’Andrea, class of 1986, participated in cross country and track in high school. After graduating, Ms. D’Andrea became a three-time US Olympic speed skating team member. Her accomplishments include:<\/p>\n<p>Speed Skating:<\/p>\n<ul>\n<li>Three time US Olympic speed skating team member<\/li>\n<li>1988 &#8211; Calgary short track<\/li>\n<li>1992 &#8211; Albertville long track<\/li>\n<li>1998 &#8211; Nagano long track<\/li>\n<li>Seven-time US Speed skating team member<\/li>\n<li>Two-time World Championship medalist (1995, 1996)<\/li>\n<li>10-time US National speed skating champion<\/li>\n<li>Coach of Canadian 2002 Olympic Team<\/li>\n<\/ul>\n<h4>Rich Johns<\/h4>\n<p>Rich Johns, a former coach and teacher, won 17 league titles, 9 sectional team titles and holds the Section II record for Class AA with 85 consecutive wins. Mr. Johns developed a girls’ tennis program that has traditionally been among the top teams in New York State. The program produced a number of outstanding individuals who have gone on to play at various levels of the NCAA. <\/p>\n<p>Team and Individual Accomplishments:<\/p>\n<ul>\n<li>17 League Championships in Varsity Girls’ Tennis<\/li>\n<li>Nine Section II Team Championships<\/li>\n<li>Coached first and only Foothills Council Boys Team Champion<\/li>\n<li>Coached John Phillips: Two-time singles Champion and Section II singles semi-finalist<\/li>\n<\/ul>\n<p>\nAchievements and Awards:<\/p>\n<ul>\n<li>USTA Eastern Section High School Coach of the Year in 1985<\/li>\n<li>Inducted into SUNY Potsdam’s Sports Hall of Fame in 1986<\/li>\n<li>National High School Coach of the Year in 2010– Recognized by Racquet Sports Industry<\/li>\n<li>Founder of Act With Respect Always<\/li>\n<\/ul>\n<h4>Dylan Welsh<\/h4>\n<p>Dylan Welsh, Class of 1999, exceled in cross country, indoor track and outdoor track while at Saratoga Springs High School. His accomplishments include:<\/p>\n<p>High School<\/p>\n<ul>\n<li>Cross Country Section 2 Class A champion in 1996<\/li>\n<li>Cross Country New York State Public High School Athletic Association champion; Section 2 Class A champion in 1997<\/li>\n<li>Cross Country New York State Federation champion; New York State Public<\/li>\n<li>High School Athletic Association champion; Section 2 Class A champion in 1998<\/li>\n<li>Indoor Track: first Section 2 runner to win the Millrose Mile in 1999<\/li>\n<li>Outdoor Track: graduated with sixth fastest time in 3,200 meters in Section 2 history<\/li>\n<li>Outdoor Track: graduated with sixth fastest time in 800 meters in Section 2 history<\/li>\n<li>Indoor Track: graduated with 2nd fastest time in 1,600 meters in Section 2 history<\/li>\n<li>Indoor Track: graduated with 3rd fastest time in 1,000 in Section 2 history<\/li>\n<\/ul>\n<p>\nCollege:<\/p>\n<ul>\n<li>Attended Georgetown<\/li>\n<li>Indoor Track All-American in 2001<\/li>\n<li>Big East champion in 2002<\/li>\n<li>Big East champion in 2003<\/li>\n<\/ul>\n<h3 id=\"2013-inductees\">2013 Inductees<\/h3>\n<h4>Lindsey Ferguson<\/h4>\n<p>Lindsey Ferguson, class of 2006, was an outstanding member of the high school track and cross country teams who won a full scholarship to Notre Dame University, where she continued her athletic career. Her accomplishments include:<\/p>\n<p>High School:<\/p>\n<ul>\n<li>4 times All-American in Cross Country<\/li>\n<li>Member of 2004 National #1 Cross Country team<\/li>\n<li>Member of 2005 #2 National Cross Country team<\/li>\n<li>Member of 2002,2003,2004,2005 NY State Champion Cross Country Team<\/li>\n<li>4 times Suburban Council All-Star team<\/li>\n<li>2005 Times Union Athlete of the Year (fall)<\/li>\n<li>3 times competing in Foot Locker Nationals<\/li>\n<li>4 times all-American in Winter Track<\/li>\n<li>Member of 4 x 1 mile relay team which won the National Championship and which set a National record which still holds to this date<\/li>\n<li>Competed in NY State Championship meet 4 years<\/li>\n<li>3 times competed in the Millrose Games<\/li>\n<li>4 times All-American in Spring Track<\/li>\n<li>4 times Suburban Council All-star<\/li>\n<li>3 times Suburban Council and Sectional Champion in the steeplechase<\/li>\n<li>3 times NY State Champion in the Steeplechase<\/li>\n<li>2 times National champion in the Steeplechase, one time runner-up<\/li>\n<li>Penn Relays Champion in the 3000m run<\/li>\n<li>Member of the Penn Relays champion DMR team<\/li>\n<li>Member of US Junior team competing in Puerto Rico, and Steeplechase Champion in this meet<\/li>\n<\/ul>\n<p>College:<\/p>\n<ul>\n<li>Full Scholarship to Notre Dame University<\/li>\n<li>Notre Dame University Record holder in the Steeplechase<\/li>\n<li>All American in Cross Country<\/li>\n<li>Varsity athlete 4 years in each of the 3 sports in which she competed<\/li>\n<li>Team Leadership award<\/li>\n<li>Team Captain Cross Country<\/li>\n<\/ul>\n<h4>Thomas Healy <\/h4>\n<p>An accomplished basketball and baseball player, Thomas Healy, class of 1954, set the high school’s basketball scoring record in 1954 with 36 points, leading the team in points, rebounds and shooting percentage. As a freshman at Lehigh University, he was the leading scorer as a freshman, tied for top scorer as a sophomore, the second highest scorer as a junior, and during his senior year, served as co-captain and second highest scorer. Other accomplishments in athletics, business and community service include:<\/p>\n<ul>\n<li>1957-1958: Who’s Who Among Students in American Universities and Colleges<\/li>\n<li>1958: Listed in National Sports magazine as one of the top 100 players in Northeast (PA, NJ, NY and New England)<\/li>\n<li>1954: Section 2 Champions in Basketball<\/li>\n<li>1954 Section 2 Champions in Baseball<\/li>\n<li>Owned and operated Congress Gas &amp; Oil in Saratoga 1964-2003<\/li>\n<li>Saratoga Springs Planning Board member 1966-1986<\/li>\n<li>Director of the Adirondack Trust Co 1985-2005<\/li>\n<li>Served on Board of Directors for Saratoga Springs Chamber of Commerce<\/li>\n<li>Member of Elks, Knights and Lions Club for over 40 years<\/li>\n<\/ul>\n<h4>Kathleen Kauth <\/h4>\n<p>Kathleen Kauth, class of 1997, has had an outstanding ice hockey career, including membership in the women’s team that won a bronze medal in the 2006 Winter Olympics in Turin, Italy. During her years at Saratoga Springs High School, she participated in soccer with Coach Lyn King for four years, serving as a captain, and lacrosse for four years with Coach Sue Hoffman, including three years as captain. Her accomplishments include:<\/p>\n<ul>\n<li>All League in soccer and lacrosse<\/li>\n<li>Lacrosse League Champion<\/li>\n<li>Lacrosse State Finals 1996<\/li>\n<li>Member of the USA Junior Olympia Team while attending Saratoga Springs High School<\/li>\n<li>1997 &#8211; Named Female Athlete of the Year<\/li>\n<li>1997 &#8211; Attended Brown University on an ice hockey scholarship<\/li>\n<li>2000-2001 &#8211; Captain of her ice hockey team<\/li>\n<li>All Ivy League selection<\/li>\n<li>Played in the National Finals 2 times<\/li>\n<li>2001 – 2005 – Member of the USA National Team 2005 – Member of the USA World Champions winning a Bronze Medal in the Olympic Games at Turin, Italy<\/li>\n<li>2006 – Continued her hockey career playing for the Brampton Thunder in Canadian Women’s Hockey League, a league she helped spearhead with her Olympic teammates.<\/li>\n<li>Present – serves as an assistant coach with the University of Toronto Women’s Ice Hockey Team.<\/li>\n<\/ul>\n<h4>Marty Sherman <\/h4>\n<p>Marty Sherman, class of 1961, taught at Corinth High School for 33 years, where he served as athletic director. He coached wrestling for 33 years, baseball for 12 years, earning six northern championship. During high school, he played football for three years as an end\/linebacker; basketball for two years as a guard, and baseball for three years as a catcher. Other accomplishments include:<\/p>\n<ul>\n<li>Section 2 Wrestling Chairman &#8211; 10 years<\/li>\n<li>NYS Chairman (Wrestling) &#8211; presently serving<\/li>\n<li>NYS Wrestling Hall of Fame – 2003<\/li>\n<li>National Wrestling Hall of Fame &#8211; 2009<\/li>\n<\/ul>\n<h4>Bob Stulmaker (Former Athletic Director and Coach)<\/h4>\n<ul>\n<li>Bob Stulmaker served as director of physical education, athletics and health at Saratoga Springs High School from 1995 to 2007. His accomplishments include:<\/li>\n<li>Head Wrestling Coach, Saratoga Springs High School – 12 seasons. Overall record 125-49-2<\/li>\n<li>Coached four Section II Champions<\/li>\n<li>Won the Suburban Council Blue Division two times<\/li>\n<li>Section II Wrestling Coordinator – 9 years<\/li>\n<li>Director of the Saratoga Youth Wrestling and Tournament Program<\/li>\n<li>Organized and ran the Saratoga Summer Wrestling Camp<\/li>\n<li>NYSPHSSA Liaison to the State Wrestling Committee – 2007 – present<\/li>\n<li>Coached with football team -1978-1995<\/li>\n<li>Coached with baseball team &#8211; 1985-1987<\/li>\n<li>Section II Wrestling Coordinator &#8211; 1988-1997<\/li>\n<li>President Saratoga Springs Administrators Association &#8211; 2001-2003<\/li>\n<li>Section II Executive Committee &#8211; 2002-2007<\/li>\n<li>NYSAA Executive committee 2003-2007<\/li>\n<li>President of NYS Administrators Association &#8211; 2005-2006<\/li>\n<li>Assistant Director NYSPHSAA &#8211; 2007-2015, Albany YMCA Presidents Club Award 2009, Director of Saratoga Rec Dept. Summer Wrestling and Baseball Clinics, Saratoga Youth Wrestling Program and Tournament. Board of<\/li>\n<li>Directors, Southern Saratoga County YMCA 2008-present<\/li>\n<\/ul>\n<h4>Andrea Snyder-Pedersen (Former Coach)<\/h4>\n<p>Andrea Snyder-Pedersen served as a gymnastics coach at Saratoga Springs High School for 23 years, with a 237-38-0 record. Her other accomplishments include:<\/p>\n<ul>\n<li>Diving coach for 11 years<\/li>\n<li>JV Gymnastics\/Modified Field Hockey, JV Basketball and Modified Volleyball &#8211; one year each<\/li>\n<li>Saratogian Coach of the Year – 2006<\/li>\n<li>11 Sectional Titles<\/li>\n<li>11 Undefeated Seasons<\/li>\n<li>15 overall League Championship Titles \/10 Consecutive League Championship Titles<\/li>\n<li>10 wins – Shaker Invitations<\/li>\n<li>1 Win Lakeland Invitational<\/li>\n<li>Nationally rated woman’s gymnastics official.<\/li>\n<\/ul>\n<h4>2004 Girls Cross Country team (Coaches Art and Linda Kranick)<\/h4>\n<p>The 2004 girls cross country team at Saratoga Springs High School was considered by some running experts to be the best cross country team ever, and was measured against some collegiate powerhouses. <br \/>\n<span style=\"font-size: 1rem;\"><\/span><\/p>\n<ul>\n<li><span style=\"font-size: 1rem;\">Marc Bloom, editor of The Harrier magazine and creator of the Nike\/Foot Locker Super 25 National Rankings, had this to say about the outstanding team: &#8220;There&#8217;s just so much more to them than just the times and the championship titles. They are tremendous students, tremendously unselfish to their teammates, and the epitome of the excellence that can be achieved when youth works together.&#8221;<\/span><\/li>\n<li>An unprecedented four members of this record-breaking team qualified for the Foot Locker Nationals that year during the Northeast Regional’s competition in Van Cortland Park.<\/li>\n<\/ul>\n<h3 id=\"2012-inductees\">2012 Inductees<\/h3>\n<h4>Erin (Porter) Bembry<\/h4>\n<p>Speedskater Erin (Porter) Bembry, class of 1997, competed in the Olympics in 1998 and 2002 and was the USA Short Track Champion in 1997. Her other speedskating accomplishments include:<\/p>\n<ul>\n<li>1997 Bronze Medal World Short Track Championships 3000m Relay<\/li>\n<li>1997 World Cup Leeuwarden, Netherlands, Gold Medal<\/li>\n<li>1996 World Junior Short Track Championships, second overall<\/li>\n<li>U.S. Speedskating (Short Track) 1996 US Olympic Committee Athlete of the Year<\/li>\n<li>U.S. Short Track Traveling Team 1995-1996<\/li>\n<li>U.S. Olympic Festival Participant 1993-1995<\/li>\n<li>1995: Two Gold Medals, Two Silver Medals, One Bronze Medal.<\/li>\n<\/ul>\n<p>Erin competed as a world-class athlete while still maintaining an “A” level of academics at Saratoga Springs High School, where she was a member of the National Honor Society. She is currently pursuing her doctorate in physical therapy at the University at Washington. She has been a guest speaker at community functions speaking on dedication, commitment and sacrifice.<\/p>\n<h4>Amy (Thelen) DiPreta <\/h4>\n<p>Amy (Thelen) DiPreta, class of 1988, was a four-year starter in soccer at Villanova University, where she served as captain during her senior year. She was a member of the Empire State Team and the Olympic Development and Select Team. During her years at the high school, she played forward in soccer for four years, was a runner on the track team for four years and also played basketball for three years.<\/p>\n<p>In high school soccer, she was a Suburban Council player of the year, leading scorer and most valuable player, with the most goals scored in a game. She was a captain of the track team and an MVP for three years, participating in the state meet.<\/p>\n<h4>Bernard (Benny) Fasulo<\/h4>\n<p>Bernard Fasulo, who died in 1982, was a long-term coach and physical education teacher in the Saratoga Springs City School District. He contributed 35 years of service to the school district and the Saratoga Springs community.<\/p>\n<p>Mr. Fasulo played professional baseball as a player-manager in the Can-Am League from 1936 to 1942.<\/p>\n<p>In 1942, he began his career in Saratoga, where he served as varsity baseball coach for 20 years, collecting 246 wins, including eight Western B Championships, two Section II titles and two Eastern Conference Championships. He also coached junior varsity basketball from 1942-1966.<\/p>\n<p>Mr. Fasulo was the founder of Saratoga Springs Little League and served as its first president. He also served as the direction of the summer recreation program for over 20 years.<\/p>\n<h4>Ernest (Sonny) Gooden <\/h4>\n<p>Ernest (Sonny) Gooden, class of 1973, who scored 1,490 points during his career at Saratoga Springs High School, is regarded as the best basketball player ever to play in Saratoga. As a sophomore, he led the Blue Streaks to the sectional championship and was selected for Bob McNamara’s All-Star team for the first of two straight years. As a sophomore, Mr. Gooden led the Blue Streaks to the sectional championship. He was widely recognized in the Capital District, and remembered by “50 Years 50 Players.” Mr. Gooden, who was inducted into the Capital District Basketball Hall of Fame, now lives in Glens Falls with his wife and family.<\/p>\n<h4>Stephen Jones <\/h4>\n<p>During his years at Saratoga Springs High School, Stephen Jones, class of 1972,  participated in track for four years, cross country for three years (two years a captain), ski team for two years and bowling for two years.<br \/>\nHis athletic accomplishments include:<\/p>\n<ul>\n<li>Hutch Tibbetts Award 1972<\/li>\n<li>New York State Cross Country Qualifier – two years<\/li>\n<li>Top five finisher at sectionals – two years<\/li>\n<li>Northern Conference Champion two mile (1972)<\/li>\n<li>New York State champion – three mile – Union College, 1976<\/li>\n<li>NCAA Division III 10,000 meter – seventh place, 1976<\/li>\n<li>NCAA Division 3 top 30 – two years<\/li>\n<li>All American Metropolitan AAU Champion 1500 meter, 1978<\/li>\n<li>Empire State Games, Masters 5000 meter – Gold Medal, 1988<\/li>\n<li>NCAA Division III All American Cross Country, 1975<\/li>\n<\/ul>\n<h4>Erinn (Dennis) Kolligian (Class of 1998)<\/h4>\n<p>Erin (Dennis) Kolligan, class of 1998, was a four-year starter in lacrosse at Johns Hopkins University, where she was an All-American and was on the first team All-Conference and first team All-South. At Saratoga Springs High School, she played lacrosse for four years and soccer for three years. She was a lacrosse captain for three years, league MVP and NYSHS All-American. The team was a sectional champion all four years and a state semifinalist in 1998. Ms. Kolligan was second in all-time total points for goals and assists (109).<\/p>\n<p>Currently, Ms. Kolligan helps operate McGregor Links in Wilton and is a member of the Wilton Town Planning Board. She is also a member of the SUNY ACC Foundation. She coached at the high school from 2004 to 2007 and currently coaches in the Saratoga Youth Lacrosse Association.<\/p>\n<h4>Jenny (Whalen) Merrill <\/h4>\n<p>As a member of the girls’ varsity tennis team from seventh- through twelfth-grades, Jenny Whalen, class of 1989, redefined all previous tennis records. She played in the number one position for six years, winning 60 straight matches and finishing her high school career with a record of 96-6.<\/p>\n<p>She won four consecutive Section II singles titles and one runner-up as an eighth grader. She was twice named All-American.<\/p>\n<p>Ms. Whalen led Saratoga to two Section II team titles and as a seventh-grader teamed up with Erin Healy to finish sixth in New York State. During the remaining five years, she played singles and finished in the top four in the state for three consecutive years. She represented Section II at the state championships all 6 years.<\/p>\n<p>At the University of Alabama she played number one singles for her last three years, with an 87-65 record. In her junior year she earned a women’s world computer ranking, but a series of injuries forced her to abandon her professional aspirations at a young age. Playing a whole season on cortisone as a senior co-captain in 1993, she weathered the pain and led the Crimson Tide to its best record ever (16-5) and first NCAA Tournament appearance. She achieved an NCAA ranking of 31st in the country and was named All-Southeastern Conference and All-Academic.<\/p>\n<h4>Kevin Mulligan<\/h4>\n<p>Kevin Mulligan, class of 1975, was an outstanding member of the high school’s football and wrestling teams. A four-year football player, he served as captain of the freshman, junior varsity and varsity teams. In 1975, he was selected as All League Linebacker, All League Running Back, second team, and nominated for Prep All American. He was also captain of the varsity wrestling team, where he was undefeated in dual meet seasons 1973-74 and 1974-75.<br \/>\nOther wrestling accomplishments include:<\/p>\n<ul>\n<li>NYSPHSAA Section II Class A Champion (1975)<\/li>\n<li>NYSPHSAA Section II Class Champion (1975)<\/li>\n<li>NYSPHSAA 4th Place in NYS 1975<\/li>\n<li>NYS Federation III Champion (1975)<\/li>\n<li>1975 Most Valuable Wrestler<\/li>\n<li>1975 Hutch Tibbets Award<\/li>\n<li>1975 Selected to represent NYS vs. Polish Jr. Team and Russian Jr. Team<\/li>\n<li>Represented USA as a member of NYS Cultural exchange with West Germany<\/li>\n<li>National Prep School Champion<\/li>\n<li>Outstanding Wrestler Award (1976)<\/li>\n<li>Western New England Champion 1976<\/li>\n<li>1976 Bronze Medal – pre-Olympic games, USA Jr. National Sectional Team in Montreal<\/li>\n<li>New England College Wrestling Champion (1978)<\/li>\n<li>Honorable Mention All-American (1978)<\/li>\n<\/ul>\n<h4>Matthew Robbens (Class of 1996)<\/h4>\n<p>A football and basketball player at the high school, Matthew Robbens’ football career continued at RPI, where he held the record in seven categories by the time he graduated in 2000. His high school and college athletic awards include:<\/p>\n<ul>\n<li>1994 First Team All Star – Schenectady Gazette, Troy Record, Saratogian<\/li>\n<li>1995 Player of the Year &#8211; Schenectady Gazette, Troy Record, Saratogian<\/li>\n<li>Offensive Player of the Year – Times Union<\/li>\n<li>National Football Foundation and College Hall of Fame<\/li>\n<li>Scholar\/Athlete Award<\/li>\n<li>National Football Foundation Scholar Athlete Award<\/li>\n<li>George S. Perkins Award – Outstanding Athlete<\/li>\n<li>1994 Super Bowl Champions<\/li>\n<li>1995 League Champions 9-0 regular season<\/li>\n<li>Team Captain 1998 and 1999<\/li>\n<li>1996 MVP ECAC Championship Game<\/li>\n<li>Three Upstate College Athletic Association League Championship<\/li>\n<li>First undefeated season in RPI history<\/li>\n<li>First invitation to NCAA Playoff’s<\/li>\n<li>Election to Olympia – RPI’s Athletic Honorary Society for Contribution in Football<\/li>\n<li>UCAA and ECAC &#8211; First Team All Star Selection 1998 &amp; 1999<\/li>\n<li>RPI MVP 1999<\/li>\n<\/ul>\n<h4>Patricia Sutton <\/h4>\n<p>A four-year lacrosse and tennis player and two-year basketball player at Saratoga, Patricia Sutton, class of 2003, went on to an outstanding lacrosse career at the College of Holy Cross on a Division 1 team.<\/p>\n<p>At Saratoga, she was nominated for US Lacrosse All-American, won the high schools’ “Most Outstanding Girls’ Lacrosse Award”, was a member of the Saratogian’s Dream Team in lacrosse, and selected for the Suburban Council Girls’ Lacrosse All Star second team. In 2003 she served as team co-captain, was a US Lacrosse All-American, a US Lacrosse Academic All-American and was a member of the Suburban Council Girls’ Lacrosse All-Star first team. In tennis, she was undefeated during the 2000 and 2001 regular seasons, and in 2002 served as co-captain and won the high school’s “Most Outstanding Girls” Tennis Award.” Among her numerous other accolades are:<\/p>\n<ul>\n<li>Clayton Chubb Outstanding Athlete Award, US Marine Corp Distinguished Athlete Award<\/li>\n<li>George Pulver Scholarship for a senior who demonstrates honor grade and athletic promise<\/li>\n<li>Patriot League All-Academic Team 2004, 2006, 2007<\/li>\n<li>2007 Crusader of the Year (given to a student-athlete for excellence in academics, athletics and involvement in student organizations<\/li>\n<li>Holy Cross&#8217;s All Time leading Goal and Point Scorer with 291 points<\/li>\n<li>Northeast Region Second Team All-American (2006,2007)<\/li>\n<li>Patriot League Tournament MVP (2007)<\/li>\n<li>Patriot League Player of the Year (2006)<\/li>\n<li>Patriot League First Team (2005, 2006, 2007) 2nd Team (2004)<\/li>\n<li>Patriot League Rookie of the Year 2004<\/li>\n<\/ul>\n<p>\nMs. Sutton has worked as an assistant women’s lacrosse coach at the University at Albany and at Holy Cross.<\/p>\n<h4>Hutch Tibbetts <\/h4>\n<p>Hutch Tibbetts, who died in 1996, was a long-time physical education teacher and coach at Saratoga Springs High School who has been widely acclaimed for his outstanding contributions to the school’s athletics programs.<\/p>\n<p>Mr. Tibbetts, an Ithaca College graduate, joined the high school faculty in 1947, coaching football, basketball and track. In 1950 the program was expanded to include wrestling and bowling. He coached the basketball team to the Section II, Class B runner-ups in 1949 and 1950.<\/p>\n<p>Mr. Tibbetts received the NYS Association of Health, Physical Education and Recreation Award for his outstanding service to the field of health and physical education for men in 1984.<\/p>\n<p>He was chairman of Section II Basketball for 10 years and a member of the Section II football and wrestling committees. In honor of Mr. Tibbetts, an award is given annually at the high school’s All Sports Reception in June to a male athlete who has lettered in two or more varsity sports.<\/p>\n<p>Mr. Tibbetts was inducted into the Saratoga Springs City Sports Hall of Fame in 1993 and the Ithaca College Sports Hall of Fame in 1995.<\/p>\n<h4>Marge Tibbetts<\/h4>\n<p>Marge Tibbetts, who died in 2010, was, like her husband Hutch, a long-time physical education teacher and athletic coach at the high school. She graduated from Ithaca College in 1933.<\/p>\n<p>Before beginning her career as a physical teacher, she played three years of semi-professional basketball and baseball for the Rochester Collegiate women’s team.<\/p>\n<p>Mrs. Tibbetts was a teacher, coach and official who supported all women’s sports activities and numerous men’s sports activities from 1947-1967. Although the New York State Regents would not permit organized competitive sports for women, she established play days for Saratoga Springs High School female students to compete against other area high schools in field hockey, basketball and softball. She encouraged the development of women’s bowling and held weekly bowling sessions. She was the assistant coach for the men’s bowling team. She organized a women’s physical education demonstration for the public which was held at the Convention Hall or the high school, highlighting gymnastics, dance, rhythms, basketball, tennis and volleyball.<\/p>\n<p>Mrs. Tibbetts also co-sponsored a Women’s Sports Club. She helped organize and run the food concession stand, and the proceeds supported the men’s and women’s sports clubs. In 1951, she coached the varsity wrestling team when her husband was unable to.<\/p>\n<p>Mrs. Tibbetts was a renowned bicyclist. After she retired she was a member of the International Bicycle Tour Association and rode throughout the eastern United States on tours lasting one to two weeks. She continued to ride at the age of 88.<\/p>\n<h3 id=\"2011-inductees\">2011 Inductees<\/h3>\n<h4>Keith Cummings<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1974<\/li>\n<li>Received nine varsity letters\n<ul>\n<li>Baseball three years<\/li>\n<li>Basketball three years<\/li>\n<li>Soccer two years<\/li>\n<li>Football one year<\/li>\n<\/ul>\n<\/li>\n<li>1974 Foothills Council First Team, basketball<\/li>\n<li>1974 Times Union Honorable Mention Player of the Year<\/li>\n<li>1974 Captain Varsity Basketball<\/li>\n<li>1972 and 1974 Foothills Champions, baseball<\/li>\n<li>Received nine varsity letters<\/li>\n<li>Basketball: three-year starting player, 19.6 points per game, 20.0 rebounds per game<\/li>\n<li>Baseball: 13-2 pitching record, 0.17 ERA over 45 innings (record still stands).<\/li>\n<li>Played 3 Varsity sports – Football, Basketball &amp; Baseball @ Norwich University – graduating in 1978<\/li>\n<\/ul>\n<h4>Kevin Cummings<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1974<\/li>\n<li>Received nine varsity letters\n<ul>\n<li>Baseball three years<\/li>\n<li>Football three year<\/li>\n<li>Basketball three years<\/li>\n<\/ul>\n<\/li>\n<li>1973 and 1974 Alll Foothills First Team Receiver<\/li>\n<li>1974 Troy Record First Team Receiver<\/li>\n<li>1974 All State: Second Team Receiver<\/li>\n<li>1975 All American Receiver<\/li>\n<li>1974 Capitan Varsity Baseball<\/li>\n<li>Played Football and the University of Massachusetts-Amherst for Hall of Fame Coach Dick Mac Phearson<\/li>\n<li>1976 All Yankee &amp; All  New England Division II &#8211; First Team Wide Receiver<\/li>\n<li>1976 All ECAC Division IISecond Team Wide Receiver<\/li>\n<li>1977 All Yankee Conference\/All ECAC Division II, All American and Pepsi Cola Division II -First Team Tight End<\/li>\n<\/ul>\n<h4>William Dalrymple<\/h4>\n<p>Dalrymple coached high school basketball from 1948-1978. As the Saratoga Springs High School basketball coach, he guided the Blue Streaks to four sectional championships and numerous league titles in 10 years before moving across town to coach at St. Peter’s. Under his leadership, the Saints won the 1973 Class B State Championship. He was also the line coach for the football team and coached junior varsity baseball.<\/p>\n<h4>Erin Davis<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1997<\/li>\n<li>1997 cross-country\/indoor &amp; outdoor track – Foot Locker National cross-country champion (1993; fourth in 1994, seventh in 1996)<\/li>\n<li>NYS Federation cross-country champion (1992-94, 1996)<\/li>\n<li>NYSPHSAA Class A cross-country champion (1992-94, 1996; third in 1995)<\/li>\n<li>Section 2 Class A cross-country champion (1992-94, 1996; runner-up 1995) second fastest Class A time ever at graduation, second all-time Saratoga State Park (1994), 16:44; second best time in Section 2 indoor 3,000 (1994, all-time best at graduation), third best time in Section 2 outdoor 3,000 (1993, second at graduation [behind Goddard])<\/li>\n<li>Ran at Penn State University<\/li>\n<\/ul>\n<h4>Ed Meixler<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1961<\/li>\n<li>Three years of varsity football (offensive guard\/defensive end)<\/li>\n<li>Varsity basketball<\/li>\n<li>Varsity track<\/li>\n<li>Captain of Football team at Boston University in 1964<\/li>\n<li>Recipient of the Harry Agannis Memorial Award as BU’s MVP in 1964<\/li>\n<li>Named to New York Times Eastern Major College first team<\/li>\n<li>UPI &amp; AP All East recognition<\/li>\n<li>All New England – first team<\/li>\n<\/ul>\n<p>Following a successful career at Saratoga Springs High School, Meixler attended Boston University from 1961 to 1965 on a four-year football scholarship. A linebacker for the Boston Patriots in 1965 (the same draft class as Joe Namath and Dick Butkus), he was possibly the first player from the high school to get drafted and play pro ball. His career was cut short due to recurrent concussions.<\/p>\n<p>John Nichols<\/p>\n<ul>\n<li>Saratoga Springs High School, Class of 1962<\/li>\n<li>Junior varsity football one year<\/li>\n<li>Varsity football two years<\/li>\n<li>Wrestling three years<\/li>\n<li>Track three years<\/li>\n<\/ul>\n<p>Nichols went to the U.S. Naval Academy and graduated in 1966. While there, he continued to wrestle at the heavyweight class. In 1996, he finished second at Nationals. After attending flight school, he flew search and rescue missions for three years as a Navy helicopter pilot in Viet Nam, and received the Distinguished Flying Cross in 1968. In 1973, Nichols became a commercial airline pilot for Northwest\/Delta Airline. He died in 1999 of amyotrophic lateral sclerosis (ALS).<\/p>\n<h4>Don Pepper<\/h4>\n<p>Pepper is a Saratoga Springs High School class of 1961 graduate. Pepper played first base for the Detroit Tigers in 1966, and also played in the minor leagues from 1962 to 1968. In March 1968, he was featured on the cover of Sports Illustrated with Johnny Bench and Mike Torrez as “Some Hot Rookies for a New Season.” He retired after being sold to the Montreal Expos in 1968. In the minor leagues, Pepper hit .265 with 78 home runs (66 in the final four years).<\/p>\n<h4>George S. Perkins<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1969<\/li>\n<li>Football four years<\/li>\n<li>Wrestling four years<\/li>\n<li>Baseball four years<\/li>\n<li>Captain: football, wrestling, baseball 1968-1969<\/li>\n<li>Saratoga Springs High School Northern Conference Wrestling Champion: 1969<\/li>\n<li>Eastern Lightweight Football League: 1972<\/li>\n<li>West Point Brigade Open Wrestling Champion:1971<\/li>\n<li>Section II Baseball Champion: 1967<\/li>\n<li>United States Military Academy &#8211; Undefeated Eastern Lightweight Football League Champions: 1972<\/li>\n<li>1st Team all League – Defensive Tackle in the ELFL<\/li>\n<li>Graduated US Military Academy at West Point: 1973<\/li>\n<li>MBA Harvard University 1982<\/li>\n<\/ul>\n<p>George Perkins passed away in 1984 while playing in an athletic contest at West Point.<\/p>\n<h4>Scott Perkins<\/h4>\n<ul>\n<li>Saratoga Springs High School, Class of 1972<\/li>\n<li>Wrestling four years<\/li>\n<li>Football three years<\/li>\n<li>Baseball three years<\/li>\n<li>Soccer one year<\/li>\n<li>Tennis one year<\/li>\n<li>Saratoga Springs High School Team Captain, 1971-1972: wrestling<\/li>\n<li>Northern Conference Champion, 1972: wrestling<\/li>\n<li>NYSPHSAA Section 2 Class A Champion, 1972: wrestling<\/li>\n<li>Two undefeated high school dual meet seasons, 1970-1971, 1971-1972: wrestling<\/li>\n<li>Member-undefeated Northern A Conference Team Champions, 1972: wrestling<\/li>\n<li>Participant in 1972 U.S. Olympic Team wrestling trials<\/li>\n<li>Junior World District Freestyle Champion, 1973: Outstanding Wrestler Award<\/li>\n<li>AAU Eastern Wrestling Championships, All East, 1973<\/li>\n<li>Colgate University: NCAA Division I<\/li>\n<li>Four year Varsity Letter winner in wrestling, 1973-1977; Three times elected team captain 1974-1977<\/li>\n<li>Two-time New York State Intercollegiate Champion (1975, 1976)<\/li>\n<li>Two-time New York State East-West College All Star Wrestling Team (1976, 1977)<\/li>\n<li>Participant in 1976 US Olympic Team wrestling trials-training camp invitee<\/li>\n<li>Nationally ranked by Amateur Wrestling News in top 12 in weight class (1975): Mid-Season All-American (Honorable Mention) 1975<\/li>\n<li>Named Colgate University’s Most Outstanding Wrestler (1975, 1976, 1977); Participant in 1980 US Olympic Team wrestling trials<\/li>\n<li>1968 &#8211; 1991 won over 30 individual wrestling championship titles<\/li>\n<\/ul>\n<h4>Katherine &amp; Ralph Stacey<\/h4>\n<p>Katherine Stacey made all of the championship banners that were displayed in the old gym. Both Katherine and Ralph Stacey were members and presidents of the all-sports booster club, with involvement from the late 60’s to the early 80’s. They worked with community businesses to support the awards ceremonies and the purchases of jackets for the basketball and football teams. Mr. and Mrs. Stacey were huge supporters of their three sons, who played baseball, basketball and football.<\/p>\n<h3 id=\"2010-inductees\">2010 Inductees<\/h3>\n<h4>Clayton Chubb<\/h4>\n<p>Clayton Chubb is honored for the countless time and energy he has devoted to athletic programs in Saratoga Springs, from his years playing football, basketball and baseball at Saratoga Springs High School through decades of service as a coach, umpire, and a leader in booster clubs for several high school sports.<\/p>\n<p>Mr. Chubb started coaching Babe Ruth baseball in 1957, right after high school, and continued with 30 years of coaching Little League in Saratoga, as well as coaching football, softball, soccer and basketball. He was an umpire for several of those sports and was previously honored by the City of Saratoga Springs for his many years of service to the community’s youth.<\/p>\n<h4>Kailynne (Ross) Neverett<\/h4>\n<p>A 1995 graduate of Saratoga Springs High School, Ms. Neverett participated in soccer, basketball and lacrosse during her high school career. An outstanding lacrosse player, she was a first-team All-Star during all five years of playing, and served as captain during the 1993, 1994 and 1995 seasons. In 1995, she was the high school’s first-ever All American in lacrosse.<\/p>\n<p>Ms. Neverett was awarded an athletic scholarship to attend Old Dominion University in Virginia, where she led the lacrosse team with 42 goals in 1999. She was named an Academic All American after the 1999 season, one of only 17 women’s lacrosse players in Lady Monarch history to achieve that honor. She is the recipient of multiple other honors, and in 1999 was invited to try out for the U.S. Women’s Lacrosse Team. A resident of Wilton, Ms. Neverett is a committee member for the Saratoga Palio 5k and half-marathon.<\/p>\n<h4>Richard Gibney<\/h4>\n<p>A 1962 graduate of Saratoga Springs High School, Mr. Gibney was an outstanding athlete who participated during all four years in football, wrestling and track and field. Mr. Gibney, who died in 1986, was a former athletic director at Lehigh University. He was honored during his wrestling career at Springfield College as New England Collegiate Champion. He was program director of the Cape Cod School of Wrestling, was honored as Coach of the Year for wrestling in 1969 at Boston University, and served as associate athletic director at Syracuse University.<\/p>\n<h4>John Traver<\/h4>\n<p>A 1957 graduate of Saratoga Springs High School, Mr. Traver was an outstanding basketball player who scored 1,082 points during his high school career, earning a school record that wasn’t surpassed until 1973. Mr. Traver, who died in 2008, was best known for his run and shoot offense that was years ahead of his time. He coached for Greenwich and Granville, earning eight league championships and five sectional championships, and reached the NYSPHSAA semifinals in 1980. He was named to the New York State Basketball Hall of Fame and the Capital District Basketball Hall of Fame. Mr. Traver attended SUNY Cortland.<\/p>\n<h4>Cheri Goddard-Kenah<\/h4>\n<p>A 1989 graduate of Saratoga Springs High School, Ms. Goddard-Kenah followed up her outstanding high school career in cross country and indoor and outdoor track with more accolades during her years at Villanova University. A world-class runner, she was a strong finisher in U.S. Olympic trials, the U.S. National Cross-Country Championships and many other signature running events. During her high school years, she was the individual New York State champion for 3000 meters and participated on cross country teams that won state championships. Her cross country team at Villanova won four NCAA championships.<\/p>\n<h4>Len Tyler<\/h4>\n<p>Mr. Tyler graduated in 1962 from Saratoga Springs High School, where he was on the basketball, track, baseball and football teams, serving as captain of the latter two. He served as college president of the Maine Maritime Academy for 15 years, and was a football coach at Ithaca College and Maine Maritime Academy. He was inducted into the Ithaca College and Maine Maritime Halls of Fame, was a Little All American for football and a first draft choice for the Continental Football League.<\/p>\n<h4>Victor Hazard<\/h4>\n<p>A 1936 graduate of Saratoga Springs High School, Mr. Hazard was an award-winning athlete who participated in track, basketball and football during his high school years. He was selected as the most valuable player in basketball in 1935, was the leading scorer on the 1935 track team, served as president of the Varsity Club, and was the 1935 recipient of a Yaddo Award for physical education. At graduation, he held records in the high jump, broad jump and low hurdle. For his academic and athletic accomplishments, Mrs. Hazard received a full scholarship to Colgate University, where he played basketball and was a member of the track team. Mr. Hazard passed away in 1992.<\/p>\n<h4>Anthony Weaver<\/h4>\n<p>A 1998 graduate of Saratoga Springs High School, Mr. Weaver followed his outstanding high school football career with a highly successful college program at Notre Dame and a career with the NFL. Mr. Weaver played for the Baltimore Ravens from 2002-2005, whose coaches drafted him in the second round. He started in 54 games, making 114 tackles, 22 assists, 14.5 sacks and three interceptions. From 2006-2008, he played for the Houston Texans, starting in 44 games, making 86 tackles, 35 assists, one sack and two interceptions. While in high school, Mr. Weaver gained national recognition from USA Today, the Chicago Sun-Times, and The Sporting News.<\/p>\n<p>Mr. Weaver keeps in touch with teachers and coaches in Saratoga, and has offered financial support to the football program and reached out to needy children in the community.<\/p>\n<h4>Blaise Iuliano<\/h4>\n<p>Mr. Iuliano was the legendary football coach at Saratoga Springs High School for 37 years, with an overall record of 223-113-7. He was named Coach of the Year eight times during his tenure, which included nine Super Bowl appearances, four Section II championships, four regional appearances, and 18 titles and championships. One hundred and seventy-five of his players went on to play college football, including Anthony Weaver, who played for the NFL. Mr. Iuliano also served as Saratoga’s wrestling coach for 13 years, including one year as the undefeated Class A champions. Mr. Iuliano graduated from Ithaca College in 1964 with six letters in football and wrestling. He also played professional football with the Atlantic Coast League. Iuliano retired as Saratoga’s football coach after the 2006 season, but has served since then as assistant football coach at Union College.<\/p>\n<h4>Deshaya Williams<\/h4>\n<p>A 1998 graduate of Saratoga Springs High School, Deshaya Williams was a standout in indoor and outdoor track. She was a three-time All-American at Penn State and the NCAA Division 1 discus champion in 2003. Other tributes include two-time Big 10 champion; eighth place at the U.S. Olympic Trials in 2004; the all-time best outdoor shot put in 1998; all time-best indoor shot put and all-time best outdoor discus in 1997.<\/p>\n<h4>Dottie Pepper<\/h4>\n<p>A golfing legend at Saratoga Springs High School who graduated in 1983, Ms. Pepper is the winner of 17 championships on the LPGA Tour (thirtieth most in LPGA history). Her wins include two majors (Nabisco Dinah Shore, 1992 and 1999, with a 19-under par score – the lowest in LPGA history – in the latter). She was an LPGA Player of the Year, Vare Trophy winner, and money winnings leader in 1992, and finished in the top 10 ten times from 1991 to 2001. Ms. Pepper was named All-American three times at Furman University, and was a standout on Saratoga’s golf team beginning in eighth grade. She won the New York State Amateur (1981) and New York Junior Amateur (1981 and 1983) titles, was a member of the 1981 Junior World Cup team, and was low amateur at the 1984 U.S. Women’s Open.<\/p>\n<h3 id=\"2009-inductees\">2009 Inductee<\/h3>\n<h4>Raymond Waldron Sr.<\/h4>\n<p>In June 2009, former athletics director Raymond Waldron Sr. became the first person to be inducted into the new Blue Streak Athletic Hall of Fame. Waldron, who died in August 2012, was an outstanding community leader, volunteer and advocate who worked for the school district from 1958 through 1996 as a physical education teacher and later as athletic director. He coached several sports during his tenure.<\/p>\n<p>Waldron took a leadership role in many sports organizations. He was the founder of the Saratoga Springs Pop Warner Football program and a 20-year chairman of Boys State. He directed Saratoga&#8217;s Punt, Pass and Kick program and the Elks Hoop Shoot, and served as chairman of Biddy Basketball for 10 years.<\/p>\n<p>He was named New York State Athletic Director of the Year in 1988, Capital District Athletic Director of the Year in 1990, and man of the year by the Capital District Wrestling Officials Association in 1992.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Blue Streak Hall of Fame honors individuals and teams for their extraordinary contributions to athletics on an annual basis. The program was established to recognize and celebrate the accomplishments of outstanding athletes, coaches, administrators, and supporters. A committee composed of current and former coaches, high school administrators, community members and current and retired athletic &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Blue Streak Hall of Fame&#8221;<\/span><\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":18,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-476","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Blue Streak Hall of Fame - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Blue Streak Hall of Fame - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"The Blue Streak Hall of Fame honors individuals and teams for their extraordinary contributions to athletics on an annual basis. The program was established to recognize and celebrate the accomplishments of outstanding athletes, coaches, administrators, and supporters. A committee composed of current and former coaches, high school administrators, community members and current and retired athletic &hellip; Continue reading &quot;Blue Streak Hall of Fame&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-10-23T17:16:53+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"69 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\",\"url\":\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\",\"name\":\"Blue Streak Hall of Fame - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2021-12-16T21:09:00+00:00\",\"dateModified\":\"2024-10-23T17:16:53+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Athletics\",\"item\":\"https:\/\/www.saratogaschools.org\/athletics\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Blue Streak Hall of Fame\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Blue Streak Hall of Fame - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/","og_locale":"en_US","og_type":"article","og_title":"Blue Streak Hall of Fame - Saratoga City School District","og_description":"The Blue Streak Hall of Fame honors individuals and teams for their extraordinary contributions to athletics on an annual basis. The program was established to recognize and celebrate the accomplishments of outstanding athletes, coaches, administrators, and supporters. A committee composed of current and former coaches, high school administrators, community members and current and retired athletic &hellip; Continue reading \"Blue Streak Hall of Fame\"","og_url":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-10-23T17:16:53+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"69 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/","url":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/","name":"Blue Streak Hall of Fame - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2021-12-16T21:09:00+00:00","dateModified":"2024-10-23T17:16:53+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/athletics\/blue-streak-hall-of-fame\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Athletics","item":"https:\/\/www.saratogaschools.org\/athletics\/"},{"@type":"ListItem","position":3,"name":"Blue Streak Hall of Fame"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/476","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=476"}],"version-history":[{"count":31,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/476\/revisions"}],"predecessor-version":[{"id":9243,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/476\/revisions\/9243"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/18"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=476"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}