{"id":667,"date":"2022-01-14T09:55:15","date_gmt":"2022-01-14T14:55:15","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=667"},"modified":"2025-08-11T13:13:05","modified_gmt":"2025-08-11T17:13:05","slug":"code-of-conduct","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/","title":{"rendered":"Code of Conduct"},"content":{"rendered":"<h1>2025-2026 Code of Conduct<\/h1>\n<p><a href=\"#Why\">Why a Code of Conduct<\/a> | <a href=\"#Definitions\">Definitions<\/a> | <a href=\"#RightsRespon\">Student Rights &amp; Responsibilities<\/a> | <a href=\"#EssPartners\">Essential Partners<\/a> | <a href=\"#DressCode\">Dress Code<\/a> | <a href=\"#ProhibitedCond\">Prohibited Conduct<\/a> | <a href=\"#ReportViols\">Reporting Violations<\/a> | <a href=\"#Referrals\">Disciplinary Consequences, Procedures &amp; Referrals<\/a> | <a href=\"#AltInstr\">Alternative Instruction<\/a> | <a href=\"#DiscipDisab\">Discipline of Students with Disabilities<\/a> | <a href=\"#CorpPunish\">Prohibition of Corporal Punishment<\/a> | <a href=\"#Transp\">Transportation<\/a> | <a href=\"#AhtleticCoC\">Athletic Code of Conduct<\/a> | <a href=\"#SearchInterr\">Searches &amp; Interrogations<\/a> | <a href=\"#Visitors\">Visitors<\/a> | <a href=\"#PublCond\">Public Conduct on School Property<\/a> | <a href=\"#DissmRev\">Dissemination &amp; Review<\/a><\/p>\n<h2><strong>Code of Conduct Committee<\/strong><\/h2>\n<p><strong><u>Central Administration<\/u><\/strong><\/p>\n<ul>\n<li>David L’Hommedieu, Assistant Superintendent<\/li>\n<li>Dr. Joseph Greco, Director of Personnel Development<\/li>\n<li>Mary Alice Hipwell, District Coordinator of Special Education  <\/li>\n<li>Diane Woodard, Secretary, IT Department<\/li>\n<\/ul>\n<p><strong><u>Transportation<\/u><\/strong><\/p>\n<ul>\n<li>Jerry Keenan, Director of Transportation<\/li>\n<li>Kim Ross, Asst. Director of Transportation<\/li>\n<\/ul>\n<p><strong><u>High School<\/u><\/strong><\/p>\n<ul>\n<li>Michelle Tsao, Principal<\/li>\n<li>Johanna Friedman, Assistant Principal<\/li>\n<li>Kevin Wolpert, Assistant Principal<\/li>\n<li>Erin Bell, Teacher<\/li>\n<li>Jennifer Vacchio, Teacher<\/li>\n<li>Theresa Merchant, Parent<\/li>\n<li>Mary Peyton, Parent<\/li>\n<li>Linnea Aldridge, Student-24\/25 Grade 9<\/li>\n<li>Amelia Covey, Student 24\/25-Grade 9<\/li>\n<\/ul>\n<p><strong><u>Maple Avenue<\/u><\/strong><\/p>\n<ul>\n<li>Tim Harris, Assistant Principal<\/li>\n<li>Maria Emanuele, Teacher<\/li>\n<li>Denise Reilly, Teacher<\/li>\n<li>Robert Terry, Teacher<\/li>\n<li>Christine Vilardo, Parent<\/li>\n<\/ul>\n<p><strong><u>Elementary<\/u><\/strong><\/p>\n<ul>\n<li>Cody Conley, Principal<\/li>\n<li>Erin Kelly, Teacher-GF<\/li>\n<li>Emily Mopsik, Teacher<\/li>\n<li>Alyssa Pollock, Parent <\/li>\n<\/ul>\n<h2><a id=\"TopPage\"><\/a>Introduction<\/h2>\n<p><span>The Board of Education of the Saratoga Springs City School District, in support of the aims of public education, believes that the behavior of students attending the public schools should reflect acceptable standards of responsibility and the degree of good citizenship demanded of members of a democratic society. The Board of Education’s objective is to provide all students with an equal opportunity to grow intellectually, socially, emotionally, and physically. Parents, students and school personnel must work together to ensure the maintenance of the proper atmosphere to achieve this goal.<\/span><span> <\/span><\/p>\n<p><span>To achieve this goal, all members of the school community and visitors must act responsibly. School personnel will use restorative (mediation, counseling, and education) and\/or punitive (detention, suspension) measures to address violations of the Code of Conduct, as appropriate under the circumstances. <\/span><span> <\/span><\/p>\n<p><span>The District has a long-standing set of expectations for conduct on school property and at school functions.  These expectations are based on the principles of civility, mutual respect, citizenship, character, tolerance, honesty, and integrity.<\/span><\/p>\n<p>The Board of Education recognizes the need to clearly define these expectations for acceptable conduct on school property, to identify the possible consequences of unacceptable conduct and to ensure that discipline, when necessary, is administered promptly and fairly.  To this end, the Board of Education adopts this Code of Conduct.<\/p>\n<p>***New York State School Boards Association (NYSSBA) defines parents <span>as &#8220;parent, guardian or person in parental relation to a student&#8221;.<\/span><\/p>\n<h2><a id=\"Why\"><\/a>II. Why Do We Have a Code of Conduct? <\/h2>\n<ol>\n<li>Students need to be supported and engaged in school in order to promote strong character and appropriate conduct. It is also essential that students are able to take age-appropriate responsibility for their own behavior.<\/li>\n<\/ol>\n<p>Student engagement is developed when students are provided with multiple opportunities to participate in a wide- range of positive social activities while interacting with caring, supportive adults. This helps to ensure that students are better able to:<\/p>\n<ul>\n<li>recognize and manage emotions;<\/li>\n<li>develop caring and concern for others;<\/li>\n<li>establish positive relationships;<\/li>\n<li>make responsible decisions; and<\/li>\n<li>handle challenging situations constructively and ethically.<\/li>\n<\/ul>\n<ol start=\"2\">\n<li>Effective and engaging instruction and positive behavioral supports are the foundations of a positive school climate. School teachers, administrators, and other staff are encouraged to set high expectations for student success, build positive relationships with students as well as teach and model appropriate behaviors for success. Modeling respectful, positive behavior is especially critical during disciplinary interventions.<\/li>\n<li>All adults, teachers, principals, administrators, school staff, parents, Board of Education, and the larger community have an obligation to help students become good citizens and lead productive lives by modeling desired behaviors and cultivating those behaviors in students.<\/li>\n<li>Appropriate conduct and strong character are reflected in a civil, respectful, healthy and caring environment.<\/li>\n<\/ol>\n<p>Student discipline and support will be implemented in a manner which is caring, equitable, respectful, based on trust among administration, staff, students, and families while holding all individuals accountablebut aims to be balanced between restorative practices and traditional consequences. This will help students:<\/p>\n<ul>\n<li>learn from their mistakes;<\/li>\n<li>understand why their behavior was unacceptable;<\/li>\n<li>acknowledge the harm they caused or the negative impact of their actions;<\/li>\n<li>understand what they could have done differently;<\/li>\n<li>take responsibility for their actions;<\/li>\n<li>learn pro-social strategies and skills to use in the future; and<\/li>\n<li>understand that further consequences and\/or interventions will be implemented if their unacceptable behavior persists.<\/li>\n<\/ul>\n<ol start=\"5\">\n<li>The District will continuously monitor results in an effort to determine strategies for improvement.<\/li>\n<\/ol>\n<p>\n<a href=\"#TopPage\">Top of Page<\/a><\/p>\n<ul><\/ul>\n<h2><a id=\"Definitions\"><\/a>III. Definitions<\/h2>\n<p><strong>A. <\/strong><strong>Behavior: <\/strong>The way in which one acts or conducts oneself, especially towards others. It is expected that students, staff, and visitors will conduct themselves in such a way that is in line with this Code of Conduct.<\/p>\n<p><strong>B. Bullying: <\/strong> The creation of a hostile environment by conduct or by threats, intimidation or abuse, including cyberbullying (as defined below), that (a) has or would have the effect of unreasonably and substantially interfering with a student&#8217;s educational performance, opportunities or benefits, or mental, emotional or school property and creates physical well-being; or (b) reasonably causes or would reasonably be expected to cause a student to fear for their physical safety; or (c) reasonably causes or would reasonably be expected to cause physical injury or emotional harm to a student; or (d) occurs off or would foreseeably create a risk of substantial disruption within the school environment, where it is foreseeable that the conduct, threats, intimidation or abuse might reach school property, or impact, or reasonably be expected to impact the student’s attendance and\/or participation in school activities. Acts of harassment and bullying may include, but not be limited to, those acts based on a person&#8217;s actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, gender or sex. For the purposes of this definition the term “threats, intimidation or abuse” shall include verbal and non-verbal actions.<\/p>\n<p><strong>C. Cyberbullying:  <\/strong>Harassment or bullying (of students and\/or staff) as defined above, where harassment or bullying occurs through any form of electronic communication, including but not limited to internet, cell phone, email, personal digital assistant wireless handheld device, social media, blogs, chat rooms, and gaming systems.  <\/p>\n<p><strong>D. Disability:<\/strong><\/p>\n<ol>\n<li>A physical, mental, or medical impairment resulting from anatomical, physiological, genetic, or neurological conditions which prevents the exercise of a normal bodily function or is demonstrable by medically accepted clinical or laboratory diagnostic techniques; or<\/li>\n<li>A record of such an impairment; or<\/li>\n<li>A condition regarded by others as such impairment.<\/li>\n<\/ol>\n<p><strong>E. Discrimination:<\/strong> Discrimination against any student by a student or students and\/or employee or employees on school property or at a school function including, but not limited to, discrimination based on a person’s actual or perceived race, color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, gender, or sex.  <\/p>\n<p><strong>F. Emotional Harm:<\/strong> Harm to a student’s emotional well-being through the creation of a hostile school environment.<\/p>\n<p><strong>G. Employee:  <\/strong>Any person receiving compensation from a District or employee of a contracted service provider or worker placed within the school under a public assistance employment program, pursuant to title nine-B of article five of the Social Services Law, and consistent with the provisions of such title for the provision of services to such District, its students or employees, directly or through contract, whereby such services performed by such person involve direct student contact. <\/p>\n<p><strong>H. Gender Related Definitions: As defined by NYSED.<\/strong><\/p>\n<ol>\n<li><strong>Gender:<\/strong> Socially constructed roles, behaviors, activities, and attributes that a given society considers appropriate. Includes a person’s gender identity or expression.<\/li>\n<li><strong>Gender Expression:<\/strong>  The way a person communicates their gender identity through behavior, clothing, hairstyle, name, pronouns, and activities. External appearance of one’s gender identity, usually expressed through behavior, clothing, body characteristics, or voice and which may or may not conform to socially defined behaviors and characteristics typically associated with being either masculine or feminine.<\/li>\n<li><strong>Gender Identity:  <\/strong>One’s innermost concept of self, how one perceives and identifies themselves, including, but not limited to, male, female, trans, transgender, queer, nonbinary, gender nonconforming, or gender expansive. Gender identity can exist on a spectrum where some individuals feel entirely male, some entirely female, some somewhere in between, some a blend of both, and some neither. One’s gender identity can be the same or different from their sex assigned at birth. Gender identity is a mental, emotional, and spiritual state, which is not determined by a person’s external anatomy. <\/li>\n<li><strong>Gender Non-Conforming (“GNC”): <\/strong>A term used to describe people whose gender expression differs from stereotypic expectation. GNC terms include but are not limited to: “gender variant” or “gender atypical” or “gender fluid”. GNC individuals may identify as male, female, some combination of both, or neither. An umbrella term for those who do not follow gender stereotypes, or who expand ideas of gender expression or gender identity. Gender nonconforming does not mean nonbinary. Cisgender people can be GNC as well.<\/li>\n<li><strong>Transgender (person): <\/strong>An adjective describing persons whose gender identity, expression or behavior does not correspond to their assigned sex at birth. A transgender person is an individual who has a gender identity different from the sex assigned to that individual at birth. For example, someone who was assigned male at birth and grew up to be a female, might describe herself as transgender, a transgender female, or a female. Someone who was assigned female at birth and grew up to be a male, might describe himself as transgender, a transgender male, or a male. Sometimes this is shortened to “trans.”<\/li>\n<\/ol>\n<p><strong>I. Harassment:<\/strong> The creation of a hostile environment by conduct or by verbal threats, intimidation or abuse that has or would have the effect of unreasonably and substantially interfering with a student’s educational performance, opportunities, or benefits, or mental, emotional, or physical well-being; or conduct, verbal threats, intimidation or abuse that reasonably causes or would reasonably be expected to cause a student to fear for their physical safety. Includes, but is not limited to, conduct, verbal threats, intimidation, or abuse based on a person’s actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin ethnic group, religion, religious practice, disability, sexual orientation, gender or sex.<\/p>\n<p><strong>J. Hazing:<\/strong> Committing an act against a student or group of students, or encouraging, or coercing a student into committing an act that creates a risk of harm to a person in order for the student to be initiated into or affiliated with a student organization, or for any other purpose.  The term hazing includes, but is not limited to:<\/p>\n<ol>\n<li>Any humiliating or dangerous activity expected of a student to join a group, regardless of the student’s willingness to participate (conduct has the potential to endanger the mental or physical health or safety of a student).<\/li>\n<li>Any hurtful, aggressive, destructive or disruptive behavior such as, but not limited to, striking, stripping, sleep deprivation, confinement in a restricted area, calisthenics or other activity that subjects the student to a risk of harm or that adversely affects the mental or physical health or safety of the student.<\/li>\n<li>Any use or abuse of Tobacco\/Nicotine, alcohol, drugs or other substances that subjects the student to a risk of harm or that adversely affects the mental or physical health or safety of that student.<\/li>\n<li>Any activity that intimidates or threatens the student with ostracism; subjects a student to mental stress, embarrassment, shame or humiliation; or adversely affects the mental health or dignity of the student or group of students.<\/li>\n<li>Any activity that causes or requires the student to perform a task that involves violation of state or federal law or of school District policies and regulations.<\/li>\n<\/ol>\n<p><strong>K. Hostile School Environment:<\/strong> An environment that is so severe or pervasive as to unreasonably and substantially interfere with a student’s access to their education.<\/p>\n<p><strong><\/strong><strong>L. Illicit:  <\/strong>Forbidden by law, rules, or custom.<\/p>\n<p><strong>M. Insubordination:  <\/strong>Failing to comply with the reasonable directions or rules of all staff, or otherwise demonstrating belligerence or disrespect.<\/p>\n<p><strong>N.  Material Incident of Harassment, Bullying, and\/or Discrimination: <\/strong>Is a single verified incident or a series of related verified incidents where a student is subject to harassment, bullying and\/or discrimination by a student and\/or employee on school property or at a school function.  Such term shall include a verified incident or series of related incidents of harassment or bullying that occur off school property, meets the definition of set forth above for harassment, bullying and\/or discrimination and is the subject of a written or oral complaint to the Superintendent, Principal or their designee, or other school employee.<\/p>\n<p><strong>O. Off-Campus Misconduct:<\/strong> Misconduct occurring in locations other than the District’s facilities, properties and school buses that nevertheless endangers the health and safety of students or staff within the school or can reasonably be forecast to substantially disrupt the educational process is prohibited.  (Examples of off campus misconduct include, but are not limited to cyberbullying, the use of electronic devices to threaten, harass, or bully.) <\/p>\n<p><strong>P. Parent:<\/strong> A parent, guardian, or person in parental relation to a student.<\/p>\n<p><strong>R. Race: <\/strong>Race is a way of grouping people based on shared physical or social traits. It is a social construct that is often used to categorize people into distinct groups within a society.<\/p>\n<p><strong><\/strong><strong>S. Relationships: <\/strong>The way in which two or more people regard and behave toward each other.<\/p>\n<p><strong> T. <\/strong><strong>Respect: <\/strong>Treating everyone in the school community with dignity. This is demonstrated by: understanding cultural norms, differing ability levels, treating others with kindness and care, being polite and using manners, expressing thoughts and opinions in ways that are polite and courteous, using a polite tone of voice and body language, listening to others who are speaking to you, keeping one’s hands to oneself and not violating others’ personal space.<\/p>\n<p><strong>U. Restorative Practices:<\/strong>A process that proactively builds healthy relationships and a sense of community to prevent and address conflict and wrongdoing.<\/p>\n<p><strong>V. School Bus:<\/strong> Every motor vehicle owned or contracted by a public or governmental agency or private school and operated for the transportation of pupils, children of pupils, teachers and other persons acting in a supervisory capacity, to or from school or school activities, or, privately owned and operated for compensation for the transportation of pupils, children of pupils, teachers and other persons acting in a supervisory capacity to or from school or school activities.<\/p>\n<p><strong>W. School Function:<\/strong> A school-sponsored or school-authorized extra-curricular event or activity regardless of where such event or activity takes place, including any event or activity that may take place in another state or country.<\/p>\n<p><strong>X. School Property:<\/strong> In or within any building, structure, athletic playing field, playground, parking lot or land contained within the real property boundary line of a public elementary or secondary school, or in\/on a school bus, as defined in Vehicle and Traffic Law, Section 142.<\/p>\n<p><strong>Y. Sexual Orientation:<\/strong> Actual or perceived heterosexuality, homosexuality or bisexuality.<\/p>\n<p><strong>Z. Student (Disruptive)  <\/strong>An elementary or secondary student who is substantially disruptive of the educational process or substantially interferes with the normal operating procedures of a teacher’s authority over the classroom, building or anywhere on school property or during an extra-curricular event.<\/p>\n<p><strong>AA. Student (Violent):<\/strong> means a student who:<\/p>\n<ol>\n<li>Commits or attempts to commit, while on school property or at a school function, an act of violence upon another student, school employee, or any other person lawfully on school property or at a school function.<\/li>\n<li>Possesses, while on school property or at a school function, a weapon such as a gun, knife, explosive or incendiary bomb, or other dangerous instrument capable of causing physical injury or death.<\/li>\n<li>Displays, while on school property or at a school function, what appears to be a weapon.<\/li>\n<li>Threatens, while on school property or at a school function, to use a weapon or commit an act of violence upon another student, school employee, or any other person lawfully on school property or at a school function.<\/li>\n<li>Knowingly and intentionally damages or destroys the personal property of any student, school employee or any person lawfully on school property or at a school function.<\/li>\n<li>Knowingly and intentionally damages or destroys District property.<\/li>\n<\/ol>\n<p><strong>BB. Student Organization:<\/strong> Group, club or organization having students as its primary members or participants. It includes grade levels, classes, team activities or particular school events. A student organization does not have to be an official school organization to come within the terms of this definition.<\/p>\n<p><strong>CC. Tobacco\/Nicotine and\/or Smoking Related Products:<\/strong> Tobacco\/nicotine or tobacco\/nicotine-related products are defined as any cigarette, cigar, pipe, bidi, clove cigarette, E-cigarettes, personal vaporizers, cartridges, pods, or any other smoking product and related paraphernalia as well as spit tobacco, dip, chew, and snuff, and any other spit tobacco product in any form.<\/p>\n<p><strong>DD. Violent Act:<\/strong> A term that includes, but is not limited to, aggression towards another person with the intent to cause harm through kicking, hitting, biting, punching, scratching or other aggressive behavior.<\/p>\n<p><strong>EE. Weapon:<\/strong> A firearm as defined in 18 USC §921 for purposes of the Gun-Free Schools Act. It also means any other gun, BB gun, pistol, revolver, shotgun, rifle, machine gun, disguised gun, dagger, dirk, razor, stiletto, switchblade knife, gravity knife, brass knuckles, sling shot, metal knuckle knife, box cutters, cane sword, electronic dart gun, Kung Fu star, electronic stun gun, pepper spray or other noxious spray, explosive or incendiary bomb, or other device, instrument, material or substance that can cause physical injury or death when used to cause physical injury or death.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"RightsRespon\"><\/a>IV. Student Rights and Responsibilities<\/h2>\n<p>The district is committed to safeguarding the rights given to all students under federal and state law and District policy.<\/p>\n<p><strong>A. Student Rights<\/strong><br \/>\nIn addition, to promote a safe, healthy, orderly, and supportive <span style=\"text-decoration: line-through;\">civil<\/span> school environment, all District students have the right to:<\/p>\n<ol>\n<li>Take part in all District activities on an equal basis, regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), weight, color, creed, national origin, religion, gender, sexual orientation or disability.<\/li>\n<li>Be respected as an individual and treated fairly and with dignity by other students and school staff.<\/li>\n<li>Present their version of the relevant events to school personnel authorized to impose a disciplinary consequence in connection with the imposition of the consequence.<\/li>\n<li>Access school rules and, when necessary, receive an explanation of those rules from school personnel and seek changes in District policies and regulations in an orderly fashion through discussions with the administrative staff.<\/li>\n<li>Freedom of expression, which includes:\n<ol>\n<li>Expressing their opinions verbally, as long as such opinions, Students are entitled to express their opinions, do not interfere with the freedom of others to express themselves or to impede the educational process. Slander, racism, sexism, obscenity, and personal attacks are prohibited.<\/li>\n<li>Participating in meetings in the school buildings or on school grounds that must function only as part of the formal educational process or as authorized by the school principal.<\/li>\n<li>Expressing, in writing, their personal opinions. Such written opinions must be signed by the author(s). Libel, racism, sexism, obscenity and personal attacks are prohibited in all publications.\n<ol>\n<li>Student participation and opinions are encouraged through the publication of student newspapers, yearbooks, and literary magazines. These publications have qualified faculty advisors.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>An education provided they do not interfere with or threaten the education of others. Students have the right to seek changes in school policies and regulations in an orderly manner by using those channels provided for this purpose.<\/li>\n<li>Privacy. It is the responsibility of the school to protect a student’s privacy. The school will not disclose any information from the student’s permanent records except when such disclosures are authorized by law, or with permission of a parent, guardian, or when directed by legal authorities. To that end, the school will comply with the provisions of the Family Educational Rights and Privacy Act.<\/li>\n<li>Contact their parents\/guardians in the event that they find themselves subject to school discipline.<\/li>\n<li>To be protected from intimidation, harassment or discrimination based on actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, sex, gender, including gender identity, sexual orientation, or disability, by employees or students on school property or at a school sponsored event, function or activity.<\/li>\n<\/ol>\n<p><strong>B. Student Responsibilities<\/strong><br \/>\nStudents attend and participate in the schools’ programs so that they may develop to their fullest potential. It shall be the responsibility of students to:<\/p>\n<ol>\n<li>Be familiar with and abide by all District policies, rules and regulations dealing with student conduct.<\/li>\n<li>Attend school every day; be in class on time and prepared to learn, unless they are legally excused.<\/li>\n<li>Work to the best of their ability in all academic and extracurricular pursuits and strive toward their highest possible level of achievement.<\/li>\n<li>React to direction given by teachers, administrators and other school personnel in a respectful, positive manner.<\/li>\n<li>Ask questions when they do not understand.<\/li>\n<li>Seek help in solving problems that might lead to discipline.<\/li>\n<li>Dress appropriately for school and school functions.<\/li>\n<li>Accept responsibility for their actions.<\/li>\n<li>Conduct themselves in accordance with the Code of Conduct as representatives of the District when participating in or attending school functions, whether held on School District property or off school grounds<\/li>\n<li>Promptly report all concerns for any school person’s health and safety, such as potential violence or self-inflicted injury, to a responsible school employee.<\/li>\n<li>Respect one another and treat each other fairly and civilly in accordance with the District’s Code of Conduct and provisions of the Dignity for All Students Act, including the responsibility to conduct themselves in a manner that fosters an environment free from intimidation, harassment, or discrimination.<\/li>\n<li>Follow all school health and safety procedures when on school property or in attendance at school-sponsored programs.<\/li>\n<li>Be open to active participation in resolving conflicts through a restorative process.<\/li>\n<li>Students will follow all school health and safety procedures when on school property or in attendance at school-sponsored programs.<\/li>\n<li>Respect personal space.\n<p><a href=\"#TopPage\">Top of Page<\/a><\/li>\n<\/ol>\n<h2><a id=\"EssPartners\"><\/a>V. Essential Community Partners<\/h2>\n<p>All members of our learning community-including students, staff, parents, and engaged service providers have a responsibility to promote behavior that enhances academic and social success thus providing a positive climate in the learning community.<\/p>\n<p><strong>A. Parents<\/strong><br \/>\nTo achieve this goal, all parents are expected to:<\/p>\n<ol>\n<li>Recognize that the education of their child(ren) is a joint responsibility of the parents\/guardians and the school community.<\/li>\n<li>Become acquainted with their child’s school, its staff, curriculum, and activities by attending parent-teacher conferences and school functions.<\/li>\n<li>Promote prompt and regular school attendance and make certain that all absences and tardiness are properly excused in writing.<\/li>\n<li>Promote in their child a desire to learn and encourage good study habits.<\/li>\n<li>Help their child to give proper attention to health, safety, personal cleanliness, acceptable dress and grooming in a manner consistent with the student dress code.<\/li>\n<li>Support their child’s participation in school activities.<\/li>\n<li>Bring concerns regarding educational or social-emotional issues to school authorities.<\/li>\n<li>Convey to their child a supportive attitude toward education and the District.<\/li>\n<li>Help their child understand that appropriate rules are required to maintain a safe, orderly environment.<\/li>\n<li>Know and understand the rules their child is expected to observe at school, on school property or at a school function, be aware of the consequences for any violation of these rules and accept legal responsibility for their child’s actions.<\/li>\n<li>Recognize that school personnel deserve the same consideration and respect that parents expect from their child in order to build good relationships.<\/li>\n<li>Help their child deal effectively with peer pressure.<\/li>\n<li> Inform school officials of changes in the home situation that may affect student conduct or performance.<\/li>\n<li>Provide a place for study and ensure homework assignments are completed.<\/li>\n<li>Support school goals to maintain safe, non-violent atmosphere.<\/li>\n<li>Obey school rules and procedures when visiting school or attending school functions.<\/li>\n<li>Whenever possible, utilize technology provided by the school District to stay informed about their child.<\/li>\n<li> Educate and supervise children in the misuse of electronic devices that may be used to bully, harass, and\/or sexually offend others.<\/li>\n<li>Teach their children respect and dignity for themselves and for other students, regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion or religious practice, disability, sexual orientation, gender or gender identity or sex, which will strengthen their child’s confidence and help promote learning in accordance with the Dignity for All Students Act.<\/li>\n<li>Be open to active participation in resolving conflicts through a restorative process.<\/li>\n<\/ol>\n<p><strong>B. Teachers and Support Personnel<\/strong><br \/>\nIn recognition of their charge in educating children, it shall be the responsibility of the teachers and support personnel to:<\/p>\n<ol>\n<li>Reflect a personal enthusiasm for teaching, learning, and a genuine concern for each student and colleague.<\/li>\n<li>Maintain a climate of mutual respect and dignity for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, gender (including gender identity and expression) or sex, which will strengthen students&#8217; self-worth and promote confidence to learn.<\/li>\n<li>Know school policies and rules and enforce them in a fair and consistent manner.<\/li>\n<li>Enable students to discuss their problems by listening, remaining open-minded, consulting and acting on student recommendations in the decision-making process.<\/li>\n<li>Establish and maintain positive, effective, and consistent classroom management techniques that result in involving and motivating students.<\/li>\n<li>Demonstrate, by work and personal example, respectful, responsible and caring behaviors.<\/li>\n<li>Refer to a parent\/guardian, counselor or administrator any student whose behavior requires special attention.<\/li>\n<li>Be prepared to carry out your professional responsibilities.<\/li>\n<li>Communicate to students and parents\/guardians:\n<ol>\n<li>Class objectives and requirements.<\/li>\n<li>Marking\/grading procedures.<\/li>\n<li>Assignment deadlines.<\/li>\n<li>Expectations for students.<\/li>\n<li>Classroom discipline plan.<\/li>\n<\/ol>\n<\/li>\n<li>Communicate regularly with students, parents\/guardians and other teachers concerning growth and achievement.<\/li>\n<li>Assist students in coping with peer pressure and emerging personal, social and emotional problems.<\/li>\n<li>Encourage students to benefit from the curriculum and extracurricular programs.<\/li>\n<li>Initiate and participate in teacher\/student\/counselor conferences and parent\/teacher\/student\/ counselor conferences, as necessary.<\/li>\n<li>Educate and supervise students in the misuse of electronic devices that may be used to bully, harass or sexually offend other students.<\/li>\n<li>Educate students to help create a climate of mutual respect and dignity for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion or religious practice, disability, sexual orientation, gender (including gender identity or expression, actual or perceived) or sex which will help strengthen student’s confidence and promote learning.<\/li>\n<li>Confront issues of discrimination and harassment or any situation that threatens the emotional or physical health or safety of any student, school employee, or any person who is lawfully on school property or at a school function.<\/li>\n<li>Address personal biases that may prevent equitable treatment of every student in the school or classroom setting.<\/li>\n<li>Report incidents of discrimination, bullying, and\/or harassment that are witnessed or otherwise brought to a teacher’s attention. Such reports shall be made orally within one (1) school day to the building administrator, Dignity for All Students Act Coordinator (DASA), and\/or the Superintendent of Schools or their designee. In addition, a written report regarding such incident(s) must be filed within two (2) school days after making the oral report to the appropriate individual.<\/li>\n<li>Be open to active participation in resolving conflicts through a restorative process.<\/li>\n<\/ol>\n<p><strong>C. Building Administrators<\/strong><br \/>\nAs the schools’ educational leaders who set the educational climate, principals are responsible to:<\/p>\n<ol>\n<li>Promote a sound and healthy atmosphere of mutual trust and respect within their schools.<\/li>\n<li>Promote a safe, orderly, and stimulating school environment, supporting active teaching and learning for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, (including gender identity and expression) or sex.<\/li>\n<li>Evaluate the staff and program of instruction to achieve a meaningful educational program.<\/li>\n<li>Assist the staff in evaluating their own procedures in relation to the interactions within their classrooms.<\/li>\n<li>Attend to referrals of students.<\/li>\n<li>Promote communication with students, staff, and parents.<\/li>\n<li>Maintain a wholesome relationship between home and school.<\/li>\n<li>Ensure fairness, reasonableness and consistency in all decisions affecting students, parents, and staff.<\/li>\n<li>Utilize all appropriate auxiliary staff and outside agencies when necessary.<\/li>\n<li>Coordinate pupil personnel staff and\/or other agencies and services on behalf of the student.<\/li>\n<li>Assume responsibility for the dissemination and enforcement of the District’s Code of Conduct and ensuring that all cases are resolved promptly and fairly.<\/li>\n<li>Comply with pertinent state laws governing hearings, suspension and student’s rights.<\/li>\n<li>Assist in developing in-service programs for staff members.<\/li>\n<li>Ensure that students and staff have the opportunity to communicate regularly with the principal and approach the principal for redress of grievances.<\/li>\n<li>Support the development of and student participation in appropriate extracurricular activities.<\/li>\n<li>Educate and supervise students in the misuse of electronic devices that may be used to bully, harass or sexually offend other students.<\/li>\n<li>Address personal biases that may prevent equitable treatment of every student in the school or classroom setting.<\/li>\n<li>Educate students and staff to help create a climate of mutual respect and dignity for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion or religious practice, disability, sexual orientation, gender (including gender identity or expression, actual or perceived) or sex which will help strengthen student’s confidence and promote learning.<\/li>\n<li>Follow up on any incidents of discrimination, bullying and harassment that are witnessed or otherwise brought to the principal’s attention in a timely manner in collaboration with the Dignity for All Students Act Coordinator (DASA).<\/li>\n<li>Maintain and encourage a climate of mutual respect and dignity for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), , color, weight, national origin, ethnic group, religion and religious practice, disability, sexual orientation, gender and gender identity or sex, with an understanding of appropriate appearance, language, and behavior in a school setting, which will strengthen students’ self-image and promote confidence to learn.<\/li>\n<li>Promptly lead or supervise and complete a thorough investigation of all written reports of discrimination, bullying and\/or harassment that are witnessed or otherwise brought to the principal’s or their designee’s attention. Such investigation may be performed in collaboration with the Dignity Act Coordinator (DAC).<\/li>\n<li>When an investigation verifies a material incident of harassment, bullying and\/or discrimination, the principal and\/or their designee shall take prompt action, consistent with the District’s Code of Conduct, including but not limited to the provisions of 100.2(l)(2)(ii)(h), reasonably calculated to end the harassment, bullying and\/or discrimination, eliminate any hostile environment and create a more positive school culture and climate.<\/li>\n<li>Ensure the safety of the student or students against whom harassment, bullying or discrimination was directed.<\/li>\n<li>Promptly notify the appropriate local law enforcement agency when it is believed that any harassment, bullying, or discrimination constitutes criminal conduct.<\/li>\n<li>Provide a regular report on data and trends related to harassment, bullying and\/or discrimination to the Superintendent. A “regular report” shall mean at least once during each school year in a manner proscribed by the District.<\/li>\n<li>Be open to active participation in resolving conflicts through a restorative process.<\/li>\n<\/ol>\n<p><strong>D. Superintendent and District Administration<\/strong><br \/>\nAs the chief executive officer, the superintendent fulfills the key role in the maintenance of discipline. It shall be the responsibility of the superintendent to:<\/p>\n<ol>\n<li>Promote a safe, orderly, and stimulating school environment, supporting active teaching and learning for all students regardless of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, national origin, ethnic group, religion, religious practice, disability, sexual orientation, gender (including gender identity and expression) or sex.<\/li>\n<li>Take such steps as necessary to develop, publicize and carry out the rules and regulations of the students.<\/li>\n<li>Be well informed about all school programs.<\/li>\n<li>Keep the Board of Education informed about matters related to discipline.<\/li>\n<li>Inform the Board of Education about educational trends relating to student discipline.<\/li>\n<li>Listen and be responsive to the views of the total community.<\/li>\n<li>Address personal biases that may prevent equitable treatment of every student in the school or classroom setting.<\/li>\n<li>Encourage and provide for the development of innovative, educational programs.<\/li>\n<li>Review with the administrators the policies of the Board of Education and state and federal laws relating to discipline.<\/li>\n<li>Work to create instructional programs that minimize problems of misconduct and are sensitive to student and teacher needs.<\/li>\n<li>Work with District administrators in enforcing the Code of Conduct and ensuring that all cases are resolved promptly and fairly.<\/li>\n<li>Educate and supervise students in the misuse of electronic devices that may be used to bully, harass or sexually offend other students.<\/li>\n<li>Educate students and staff to help create a climate of mutual respect and dignity for all students regardless of actual or perceived race ,, color, weight, national origin, ethnic group, religion or religious practice, disability, sexual orientation, gender (including gender identity or expression, actual or perceived) or sex which will help strengthen student’s confidence and promote learning.<\/li>\n<\/ol>\n<p><strong>E. Board of Education<\/strong><br \/>\nA primary task of the Board of Education is to establish District policy. It shall be the responsibility of the Board of Education to:<\/p>\n<ol>\n<li>Collaborate with student, teacher, administrator and parent organizations, school safety personnel and other school personnel to develop a code of conduct that clearly defines expectations for the conduct of students, District personnel and visitors on school property and at school functions.<\/li>\n<li>Adopt and review, at least annually, the District’s Code of Conduct to evaluate the code’s effectiveness and the fairness and consistency of its implementation.<\/li>\n<li>Address personal biases that may prevent equitable treatment of every student in the school or classroom setting.<\/li>\n<li>Approve a procedure for hearing grievances related to disciplinary action.<\/li>\n<li>Listen and be responsive to the views of the total community.<\/li>\n<li>Employ and retain high quality, qualified personnel.<\/li>\n<li>Support high quality in-service programs for all school employees.<\/li>\n<li>Lead by example by conducting Board of Education meetings in a professional, respectful and courteous manner.<\/li>\n<li>Appoint Dignity for All Students Act Coordinator (DASA) in each school building. The Dignity Act Coordinator will be trained to handle human relations in areas of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), , color, weight, national origin, ethnic group, religion or religious practices, disability, sexual orientation, gender and gender identity and sex. The Dignity Act Coordinator must be accessible to students and other staff members for consultation and advice as needed on the Dignity Act.<\/li>\n<\/ol>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"DressCode\"><\/a>VI. Student Dress Code\/Grooming<\/h2>\n<p>All students are expected to give proper attention to personal hygiene and dress appropriately for school and school functions. Students and their parents have the primary responsibility for acceptable student dress and appearance, provided such dress and grooming does not disrupt the educational process of the school or endanger the health or safety of the individual student or others. District personnel should exemplify and reinforce acceptable student dress and help students develop an understanding of appropriate appearance in the school setting.<\/p>\n<p>A student’s dress, grooming and appearance, including hair style\/color, jewelry, make-up, nails, and accessories shall:<\/p>\n<ol>\n<li>Be safe and appropriate and not disrupt or interfere with the educational process.<\/li>\n<li>Include footwear at all times. Based on the classroom setting, footwear that is deemed “unsafe” by the building principal or designee will not be permitted.<\/li>\n<li>Ensure that undergarments are completely covered with outer clothing.<\/li>\n<li>Not include the wearing of hats in the elementary buildings except for a medical or religious purpose. Approved, building-wide activities are exempt.<\/li>\n<li>Not include wearing garments, jewelry or other forms of symbolism associated with gangs or gang membership.<\/li>\n<li>Not include items that are vulgar, obscene, libelous, or denigrate, harass, or discriminate against others on account of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, weight, religion, religious practice, disability, creed, national origin, ethnic group, gender (including gender identity and expression), sex, sexual orientation, or disability.<\/li>\n<li>Not promote and\/or endorse the use of alcohol, tobacco\/nicotine or drugs and\/or encourage other illicit or violent activities.<\/li>\n<li>Not cause injury to themselves or others.<\/li>\n<li>Not conceal a student’s identity, except for a medical, cultural or religious purposes.<\/li>\n<\/ol>\n<p>Nothing in this policy will be construed to limit the ability of students to express their gender identity through clothing, jewelry, makeup, or nail color or styles, or to discipline students for doing so.  Likewise, nothing in this policy will be construed to restrict students from wearing hairstyles as a trait historically associated with race (such as hair texture and protective hairstyles like braids, locks, and twists) or to discipline them for doing so.<\/p>\n<p>Each Building Principal and\/or their designee shall be responsible for informing all students and their parents of the student dress code at the beginning of the school year and any revisions to the dress code made during the school year.<\/p>\n<p>Students who violate the student dress code may be required to modify their appearance. Any student who fails to comply with the dress code may be subject to discipline, up to and including out-of-school suspension.<\/p>\n<h2><a id=\"ProhibitedCond\"><\/a>VII. Prohibited Student Conduct<\/h2>\n<p>The Board of Education expects all students to conduct themselves in an appropriate and civil manner, with proper regard for the rights and welfare of other students, District personnel and other members of the school community, and for the care of school facilities and equipment with the goal of making school a community free of violence intimidation, bullying, harassment, and discrimination. Exclusion from the school environment and suspension will only be used when necessary to protect the safety of students and staff or when all other measures have been exhausted.<\/p>\n<p>Students must learn to assume and accept responsibility for their own behavior, as well as the consequences of their mistakes or misbehavior.  District personnel who interact with students are expected to use disciplinary action only when necessary and to place emphasis on educating students so that they may learn from their behavior and grow in self-discipline.<\/p>\n<p>The Board recognizes the need to make its expectations for student behavior while on school property or engaged in a school function specific and clear. The rules of conduct listed below are intended to do that and focus on safety and respect for the rights and property of others.  Students who will not accept responsibility for their own behavior and who violate these school rules will be required to accept the consequences for their behavior.<\/p>\n<p>Students may be subject to disciplinary action, up to and including, suspension from school, when they:<\/p>\n<p>A. Engage in conduct that is disorderly. Examples of this type of behavior include, but are not limited to:<\/p>\n<ol>\n<li>Running or otherwise unsafe behavior in hallways.<\/li>\n<li>Making unreasonable noise.<\/li>\n<li>Using language or gestures that are profane, lewd, vulgar, or abusive, or discriminatory, including when such language or gestures are used because of a belief or perception regarding the race, color, national origin, ancestry, gender, gender identity or expression, religion, religious practice, age, disability or sexual orientation of a person.<\/li>\n<li>Obstructing vehicular or pedestrian traffic.<\/li>\n<li>Engaging in any willful act which disrupts the normal operation of the school community.<\/li>\n<li>Trespassing. Students are not permitted in any school building, other than the one they regularly attend, without permission from the administrator in charge of the building whether during or outside of school hours.<\/li>\n<li>Computer\/electronic communications misuse, including any unauthorized use of computers, social media and messaging applications, software, or internet\/intranet account; accessing inappropriate websites; or any other violation of the district’s acceptable use policy.<\/li>\n<li><span style=\"font-size: 1rem;\">Destruction or negligence of district issued\/<\/span><span style=\"font-size: 1rem; text-decoration-line: line-through;\">owed<\/span><span style=\"font-size: 1rem;\"> owned computer devices (This may result in paying for a repair\/replacement of a device).<\/span><\/li>\n<li><span style=\"font-size: 1rem;\"><\/span><span style=\"font-size: 1rem;\">Filming, creating, and distributing inappropriate images and videos.<\/span><\/li>\n<\/ol>\n<p>B. Engage in conduct that is considered insubordinate. This includes refusal to follow directions and failure to be in the correct place at any given time.<\/p>\n<p>C. Engage in conduct that is considered disruptive and prevents others from being able to learn, focus, or engage in their work.<\/p>\n<p>Examples of this type of behavior include, but are not limited to:<\/p>\n<ol>\n<li>Inappropriate sexual contact.<\/li>\n<li>Display or use of personal electronic devices, such as, but not limited to, cell phones, ear buds\/headphones, music or video players, cameras, in a manner that is in violation of District policy.   Students’ personal internet-enabled devices must be off, put away, and cannot be accessed during the school day, in accordance with Policy 5695. Violation of Policy 5695 will not be the sole grounds for out-of-school suspension but may result in other consequences under this Code.<\/li>\n<li>Use of electronic devices for unauthorized recording of other students, staff, and school community members.  Use of electronic device in a manner consistent with viewing, recording, or documentation of other students, staff, and\/or school community members.<\/li>\n<\/ol>\n<ol><\/ol>\n<p>D. Engage in conduct that is violent. Examples of this type of behavior include, but are not limited to:<\/p>\n<ol>\n<li>Committing an act of violence (such as biting, hitting, kicking, punching, and scratching) upon a staff member, another student or any other person lawfully on school property.<\/li>\n<li>Possessing a weapon. Authorized law enforcement officials are the only people permitted to have a weapon in their possession while on school property or at a school function.<\/li>\n<li>Displaying what appears to be a weapon.<\/li>\n<li>Threatening to use any weapon on school grounds<\/li>\n<li>Intentionally damaging or destroying the personal property of a student, a staff member, or any person lawfully on school property, including graffiti or arson.<\/li>\n<li>Intentionally damaging or destroying District property.<\/li>\n<\/ol>\n<p>E. Engage in any conduct that endangers the safety, physical or mental health or welfare of others. Examples of such this type of behavior include, but are not limited to<\/p>\n<ol>\n<li>Attempting to engage in or perform an act of violence noted in Section D.<\/li>\n<li>Subjecting other students, school personnel or any other person lawfully on school property or attending a school function to danger by recklessly engaging in conduct which creates a substantial risk of physical injury.<\/li>\n<li>Stealing or attempting to steal the property of other students, school personnel or any other person lawfully on school property or attending a school function.<\/li>\n<li>Defamation, which includes making false or unprivileged statements or representations about an individual or identifiable group of individuals that harm the reputation of the person or the identifiable group by demeaning them.<\/li>\n<li>Discrimination, which includes using race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, creed, national origin, ethnic group, religion, religious practice, sex, gender (identity and expression), sexual orientation, weight or disability to deny rights, equitable treatment or access to facilities available to others.<\/li>\n<li>Harassment (or bullying) is defined as the creation of a hostile environment by conduct or threats, intimidation or abuse. (See policy, 0115, Student Harassment and Bullying Prevention and Intervention for a more complete definition.)<\/li>\n<li>The creating, sharing, or posting of content used to bully, discriminate, threaten, harass, or denigrate other students or school personnel.<\/li>\n<li>Intimidation, which includes engaging in actions or statements that causes an individual fear of bodily harm.<\/li>\n<li>Hazing, which includes an induction, initiation or membership process involving harassment (see policy 0115 for a more complete definition).<\/li>\n<li>Selling, using, distributing, or possessing obscene material.<\/li>\n<li>Using vulgar or abusive language, cursing, or swearing.<\/li>\n<li>Possessing, consuming, selling, offering, manufacturing or  being in the presence presence of tobacco\/nicotine products\/paraphernalia of any kind on school grounds, in school buildings, or in school owned or leased vehicles used to transport children or school personnel, or at school sponsored events at any time. Examples include, but are not limited to cigarette, cigar, pipe, electronic cigarette (i.e., vape), or using chewing or smokeless tobacco.<span style=\"text-decoration: line-through;\"><\/span><\/li>\n<li>Possessing, consuming, selling, offering, manufacturing, or being in the presence of, distributing or exchanging alcoholic beverages or illegal\/illicit substances, or being under the influence of either. &#8220;Illegal substances&#8221; include, but are not limited to, inhalants, marijuana\/THC, cocaine, LSD, PCP, amphetamines, heroin, steroids, look-alike drugs, and any synthetic version thereof, whether specifically illegal or not, commonly referred to as &#8220;designer drugs&#8221; which are substances designed and synthesized to mimic the intended effects and usages of, which are chemically substantially similar to, illicit drugs, which may or may not be labeled for human consumption.<\/li>\n<li>Inappropriately possessing, consuming, or sharing prescription and over-the-counter drugs.<\/li>\n<li>Gambling for personal gain\/profit.<\/li>\n<li>Indecent exposure, that is, exposure to sight of the private parts of the body in a lewd or indecent manner.<\/li>\n<li>Initiating a report warning of fire or other catastrophe without valid cause, misuse of 911, or discharging a fire extinguisher.<\/li>\n<li>Knowingly making false statements or knowingly submitting false information to school staff during a disciplinary process.<\/li>\n<\/ol>\n<p>F. Engage in misbehaviors otherwise prohibited by sections A-E of this section while on a school bus. Students will remain seated, keep objects and body parts inside the bus, and obey directions from the bus driver or monitor.  It is crucial for students to behave appropriately while riding on District buses to avoid distracting the bus driver, which ensures their safety and the safety of the passengers. Students are required to conduct themselves on the bus in a manner consistent with established standards for classroom behavior. Excessive noise, pushing, shoving, and fighting will not be tolerated.<\/p>\n<p>G. Engage in any form of academic misbehavior. Examples of academic misbehavior include, but are not limited to:<\/p>\n<ol>\n<li>Plagiarism;<\/li>\n<li>Cheating;<\/li>\n<li>Copying;<\/li>\n<li>Altering records;<\/li>\n<li>Assisting another student in any of the above actions.<\/li>\n<li>\n<p>Inappropriate use of Artificial Intelligence tools.<\/p>\n<\/li>\n<\/ol>\n<p>H. Engage in off-campus misbehavior that interferes with or can reasonably be expected to substantially disrupt the educational process in the school or a school function. Such misbehavior includes, but is not limited to, threatening or harassing students or school personnel through any means off-campus, including cyberbullying (for a complete definition of harassment, bullying and cyberbullying refer to policy 0115, Student Harassment and Bullying Prevention and Intervention).<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"ReportViols\"><\/a>VIII. Reporting Violations<\/h2>\n<p>All members of the school community are expected to promptly report violations of the Code of Conduct to a teacher, school personnel, the Building Principal, or their designee.  Anyone observing a student possessing a weapon, alcohol or illicit substance on school property or at a school function shall report this information immediately to a teacher or the Building Principal, the Principal’s designee, Superintendent, or other responsible adult. <\/p>\n<p>Anyone observing harassment or discrimination against another member of the educational community shall report this information immediately to a teacher, the Principal or Principal’s designee, the Superintendent of schools or the Dignity for All Students Act Coordinator.  Following the report, the District shall investigate or otherwise determine what occurred and should take prompt and effective steps reasonably calculated to end the harassment or discrimination, eliminate any hostile environment, and prevent the conduct from occurring.     <\/p>\n<p>All District staff who are authorized to impose disciplinary sanctions are expected to do so in a prompt, fair and lawful manner.  District staff who are not authorized to impose disciplinary sanctions are expected to promptly report violations of the Code of Conduct to their supervisor, who shall, in turn, impose an appropriate disciplinary sanction, if so authorized, or refer the matter to a staff member who is authorized to impose an appropriate sanction.<\/p>\n<p>Any weapon, alcohol or illicit substance found shall be confiscated immediately, if possible, followed by notification to the parent of the student involved and the appropriate disciplinary sanction, if warranted, which may include long-term suspension and referral to local authorities.<\/p>\n<p>The Building Principal or their designee must notify the appropriate local authorities of those code violations that constitute a crime and substantially affect the order or security of a school as soon as practical.  <span style=\"text-decoration: line-through;\"><\/span><\/p>\n<h3>Dignity for All Students Act (DASA)<\/h3>\n<p>School employees who witness harassment, bullying, and\/or discrimination or receive an oral or written report of harassment, bullying, and\/or discrimination shall promptly orally notify the Principal, the Dignity Act Coordinator, the Superintendent, or their designee not later than one (1) school day after such employee witnesses or receives a report of harassment, bullying, and\/or discrimination, and:<\/p>\n<p>Such school employee shall also file a written report in a manner prescribed by the District with the Principal, the Dignity Act Coordinator, the Superintendent, or their designee no later than two (2) school days after making an oral report.<\/p>\n<p>The Superintendent, Principal, Dignity Act Coordinator, or any assigned designee shall lead or supervise the thorough investigation of all reports of harassment, bullying and\/or discrimination, and ensure that such investigation is completed promptly after receipt of any written reports made under Education Law section 13.<\/p>\n<p>When an investigation verifies a material incident of harassment, bullying, and\/or discrimination, the Superintendent, Principal, Dignity Act Coordinator or designee shall take prompt action, consistent with the District’s Code of Conduct including but not limited to the provisions of section 100.2(l)(2)(ii)(h), reasonably calculated to end the harassment, bullying, and\/or discrimination, eliminate any hostile environment, create a more positive school culture and climate, prevent recurrence of the behavior, and ensure the safety of the student or students against whom such behavior was directed.<\/p>\n<p>Should a student or parent disagree with the determination of the Dignity Act Coordinator or their designee, they may appeal the decision as outlined in the suspension appeal section of this document.<\/p>\n<p>The Principal, Superintendent, or their designee shall notify promptly the appropriate local law enforcement agency when it is believed that any harassment, bullying, or discrimination constitutes criminal conduct.<\/p>\n<p>The Principal shall provide a regular report on data and trends related to harassment, bullying, and\/or discrimination to the Superintendent or the Dignity Act Coordinator. For the purpose of this subdivision, the term “regular report” shall mean at least once during each school year, and in a manner prescribed by the District.<\/p>\n<h4>Reporting of material incidents to the Commissioner of Education<\/h4>\n<p>The District shall submit to the Commissioner of Education an annual report of material incidents of harassment, bullying, and\/or discrimination, that occurred in such school year, in accordance with Education Law section 15 and this subdivision. Such report shall be submitted in a manner prescribed by the commissioner, on or before the basic educational data system (BEDS) reporting deadline or such other date as determined by the commissioner.<\/p>\n<p>Members of the school community can file an anonymous written complaint through our online Dignity for all Students Act (DASA) Bullying Reporting Form found on the school website.<a href=\"https:\/\/forms.office.com\/pages\/responsepage.aspx?id=enMV6dTl3E-FtexZHCsUDePSZ983yT5MnBfo-hoaMoZUOTQ5NjI2NUtRR1ZMTEhFTVFYU1dLUktBQy4u \" rel=\"nofollow noreferrer\">Report Dignity for All Students Act (DASA) violations here<\/a>,<\/p>\n<h3>Retaliation Prohibited<\/h3>\n<p>Any act of retaliation against any person who reports or has filed a complaint of harassing or discriminatory behavior, is strictly prohibited and illegal, and therefore subject to disciplinary action. Likewise, retaliation against any person who has testified, assisted, or participated in any manner in an investigation, proceeding, or hearing of a harassment or discrimination complaint is prohibited. For purposes of this policy, retaliation includes but is not limited to verbal or physical threats, intimidation, ridicule, bribes, destruction of property, spreading rumors, stalking, harassing phone calls, and any other form of harassment. Any person who retaliates is subject to immediate disciplinary action, up to and including suspension or termination, as applicable.<\/p>\n<p>Where incidents involve violations of civil rights, the victim and the alleged perpetrator have the right to be represented by a person of their choice, at their own expense, during investigations and hearings. In addition, victims have the right to register complaints with the U.S. Department of Education&#8217;s Office for Civil Rights.<\/p>\n<p>Employee victims also have the right to register complaints with the Federal Equal Employment Opportunity Commission and the New York State Division of Human Rights. Nothing in these regulations shall be construed to limit the right of the complainant to file a lawsuit in either state or federal court.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"Referrals\"><\/a>IX. Disciplinary Consequences, Procedures and Referrals<\/h2>\n<p><strong>PBIS Philosophy &amp; Background<\/strong><\/p>\n<p>PBIS (Positive Behavioral Interventions and Supports) is a multi-tiered framework for implementing evidence-based practices. It is focused on meeting the needs of ALL students through tiers of supports. It is a continuous improvement model with prevention-focused supports, data-based decision-making, universal screening and progress monitoring, professional development and coaching and using evidence-based practices in learning. (Horner, Sugai, &amp; Anderson, 2010)<\/p>\n<p><strong><u>School-Wide Positive Behavioral Support<\/u><\/strong><\/p>\n<ul><\/ul>\n<p>District-Wide Expectations:<\/p>\n<ol>\n<li>Students will know what is expected of them.<\/li>\n<li>Students will be taught the expected way to behave.<\/li>\n<li>Expected student behavior will be encouraged and acknowledged.<\/li>\n<\/ol>\n<p>An important part of PBIS is clear and consistent expectations. We have adopted three basic expectations.<\/p>\n<ol>\n<li>Be Safe<\/li>\n<li>Be Respectful<\/li>\n<li>Be Responsible<\/li>\n<\/ol>\n<p>Please see the link below to the SSCSD PBIS Staff Handbook.<\/p>\n<p><a href=\"https:\/\/saratogaschools-my.sharepoint.com\/:w:\/g\/personal\/d_lhommedieu_saratogaschools_org\/EXR3MlNXKXxJkdlQGEs5RZUBte0nyarj9mVh1uu95QMPHg?e=nxalGG\"> 2023-2024 PBIS Handbook-District.docx<\/a><\/p>\n<p><strong>Appropriate remedial measures may include, but are not limited to: <\/strong><\/p>\n<ul>\n<li>Restitution and restoration<\/li>\n<li>Restorative practices<\/li>\n<li>Peer support group<\/li>\n<li>Corrective instruction or other relevant learning or service experience<\/li>\n<li>Changes in class schedule<\/li>\n<li>Supportive intervention<\/li>\n<li>Behavioral assessment or evaluation<\/li>\n<li>Behavioral management plan, with benchmarks that are closely monitored<\/li>\n<li>Student counseling<\/li>\n<li>Parent conferences<\/li>\n<li>Student treatment or therapy<\/li>\n<\/ul>\n<p><strong>Environmental remediation may include, but is not limited to: <\/strong><\/p>\n<ul>\n<li>School and community surveys or other strategies for determining the conditions contributing to the relevant behavior<\/li>\n<li>Modification of schedules<\/li>\n<li>Adjustment in hallway traffic and other student routes of travel<\/li>\n<li>Targeted use of monitors<\/li>\n<li>Parent education seminars\/workshops<\/li>\n<li>Peer support groups<\/li>\n<\/ul>\n<p>Consequences, and if needed, discipline are most effective when they deal directly with the problem at the time and place it occurs, and in a way that students view as fair and impartial.  School personnel who interact with students are expected to use disciplinary action only when necessary and place emphasis on the students’ ability to grow in self-discipline.<\/p>\n<p>Consequences and disciplinary action, when necessary, will be firm, fair and consistent so as to be the most effective in changing student behavior.  As a general rule, discipline will be progressive.  In determining the appropriate disciplinary action, school personnel authorized to impose disciplinary consequences will consider the following:<\/p>\n<ol>\n<li>The student’s age<\/li>\n<li>The nature of the offense and the circumstances which led to the offense<\/li>\n<li>The student’s prior disciplinary record<\/li>\n<li>The effectiveness of other forms of discipline<\/li>\n<li>Information from parents, teachers and\/or others, as appropriate<\/li>\n<li>Other factors<\/li>\n<\/ol>\n<p>Any individual who engages in harassment, bullying and\/or discrimination will be subject to appropriate action, which may include disciplinary action. Remedial responses to bullying include measures designed to correct the problem behavior, prevent another occurrence of the behavior, and protect the target of the act.<\/p>\n<p><strong>A. Consequences<\/strong><\/p>\n<p>Students who are found to have violated the District’s Code of Conduct may be subject to the following consequences, either alone or in combination.  The school personnel identified after each consequence are authorized to impose that consequence, consistent with the student’s right to due process.<\/p>\n<ol>\n<li>Oral and written warnings may be used as a consequence of student’s  violations of the Code of Conduct.\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Bus Driver\/Dir. of Transportation or designee<\/li>\n<li>Student service personnel<\/li>\n<li>Instructional Staff<\/li>\n<li>Principal or designee<\/li>\n<li>Superintendent<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Written notification to parent\/guardian\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Instructional Staff<span style=\"text-decoration: line-through;\"><\/span><\/li>\n<li>Principal or designee<\/li>\n<li>Superintendent or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li><span style=\"font-size: 1rem;\">Classroom, lunch, and a school detention<\/span>\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Instructional Staff<\/li>\n<li>Principal or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Suspension from transportation\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Superintendent or designee<\/li>\n<li>Principal<\/li>\n<li>Director of Transportation (or their designee) in cooperation with building\/district administration<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Suspension from social or extracurricular activities\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Club advisor<\/li>\n<li>Principal or designee <\/li>\n<li>Superintendent or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Suspension from athletic participation and\/or attendance at athletic events\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>Responsible Parties\n<ol>\n<li>School personnel not limited to:\n<ol>\n<li>Principal or designee<\/li>\n<li>Athletic Director<\/li>\n<li>Superintendent or designee<\/li>\n<li>Coach<\/li>\n<li>Individuals serving in a supervisory capacity<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Suspension of other privileges\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Principal or designee<\/li>\n<li>Superintendent or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>In-school suspension, or similar as designated by an administrator\n<ol>\n<li>Responsible Parties: \n<ol>\n<li>Principal or designee<\/li>\n<li>Superintendent or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Removal from classroom\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Teachers<\/li>\n<li>Principal or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Short-term (five days or less) suspension from school\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Principal<\/li>\n<li>Superintendent or designee<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Long-term (more than five days) suspension from school\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Superintendent<\/li>\n<li>Board of Education<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Permanent suspension from school\n<ol>\n<li>Responsible Parties\n<ol>\n<li>Superintendent<\/li>\n<li>Board of Education<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p><strong>B. Procedures<br \/>\n<\/strong><\/p>\n<p>The amount of due process a student is entitled to receive before a consequence is imposed depends on the conduct engaged in and\/or the consequence being imposed.  In all cases, regardless of the consequence imposed, the school personnel authorized to impose the consequence must inform the student of the alleged misconduct and must investigate, to the extent necessary, the facts surrounding the alleged misconduct. <\/p>\n<p>All students will have an opportunity to present their version of the facts to the school personnel imposing the disciplinary consequence in connection with the imposition of the consequence.<\/p>\n<p>Students who are to be given consequences other than an oral warning, written<\/p>\n<ol>\n<li>Suspension from transportation \n<p>If a student does not conduct themself properly on a bus, the bus driver is expected to bring such misconduct to the Director of Transportation’s attention.  The Director of Transportation (or their designee) may recommend that a student who has become a disciplinary problem have their riding privileges suspended.  The Director of Transportation (or their designee) in cooperation with the Building Principal, Principal’s designee or Superintendent may carry out suspension of riding privileges.  In such cases, the student’s parent is responsible for getting the suspended student to and from school safely.  If the parent is unable to transport due to a hardship (resulting in a suspension from school), then alternative disciplinary actions may need to be considered for getting the suspended student to and from school safely.  <\/p>\n<p>A student subjected to a suspension from transportation is not entitled to a full hearing pursuant to Education Law §3214.  However, the student and the student’s parent will be provided with a reasonable opportunity for an informal conference with the Building Principal or the Principal’s designee to discuss the conduct and the consequence involved.<\/p>\n<p>\nSuspension from athletic participation, extra-curricular activities, and other privileges <br \/>\nA student subjected to a suspension from athletic participation, extra-curricular activities, or other privileges is not entitled to a full hearing pursuant to Education Law §3214.  However, the student and the student’s parent will be provided with a reasonable opportunity for an informal conference with the District official imposing the suspension to discuss the conduct and the consequence involved.<\/p>\n<\/li>\n<li>In-school suspension <br \/>\nThe Board of Education recognizes the school must balance the need of students to attend school and the need for order in the classroom to establish an environment conducive to learning.  As such, the Board of Education authorizes Building Principals or the Principal’s designee or the Superintendent to place students who would otherwise be suspended from school as the result of a Code of Conduct violation in “in-school suspension.”<\/p>\n<p>A student subjected to an in-school suspension is not entitled to a full hearing pursuant to Education Law §3214.  However, the student and the student’s parent will be provided with a reasonable opportunity for an informal conference and the District official imposing the in-school suspension to discuss the conduct and the consequence involved.<\/p>\n<\/li>\n<li>Teacher disciplinary removal of disruptive student \n<p>A student’s behavior can affect a teacher’s ability to teach and can make it difficult for other students in the classroom to learn.  In most instances, the classroom teacher can control a student’s behavior and maintain or restore control over the classroom by using responsive classroom management techniques.  These techniques may include practices that involve the teacher directing a student to briefly leave the classroom to give the student an opportunity to regain their composure and self-control in an alternative setting.  Such practices may include but are not limited to (1) short-term “time-out” in an elementary classroom or in an administrator’s office; (2) sending a student to the Principal’s office for the remainder of the class time only; or (3) sending a student to another building staff member for counseling.  Time-honored classroom management techniques such as these do not constitute disciplinary removals for purposes of this code.<\/p>\n<p>On occasion, a student’s behavior may become increasingly disruptive.  For purposes of this Code of Conduct, a disruptive student is a student who substantially interferes with the educational process or with the teacher’s authority over the classroom.  This occurs when a student demonstrates a persistent                <\/p>\n<p>unwillingness to comply with the teacher’s instructions or repeatedly violates the teacher’s classroom behavior rules.<\/p>\n<p>A teacher may remove a student from the classroom due to inappropriate behavior, and follow-up with the Principal or designee.  Based on the severity of the student’s inappropriate behavior, the Principal or Principal’s designee will determine the length of time the student is removed from class.  The Principal or the Principal’s designee may overturn the removal of the student from class if one of the following is found:<\/p>\n<ol>\n<li>The allegations against the student are not supported by substantial evidence.<\/li>\n<li>The student’s removal is otherwise in violation of law, including the District’s Code of Conduct.<\/li>\n<li>The conduct warrants suspension from school pursuant to Education Law 3214 and a suspension will be imposed.<\/li>\n<\/ol>\n<p>If the disruptive student does not pose a danger or ongoing threat of disruption to the academic process, the teacher must provide the student with an explanation for why they are being removed and an opportunity to explain their version of the relevant events before the student is removed.  Only after the informal discussion may a teacher remove a student from class.<\/p>\n<p>If the student poses a danger or ongoing threat of disruption, the teacher may order the student to be removed immediately.  The teacher must, however, explain to the student why they were removed from the classroom and give the student a chance to present their version of the relevant events by the end of the next school day.  Every effort will be made to contact the parent by telephone as soon as the removal occurs.<\/p>\n<p>The teacher must contact the Principal or their designee as soon as possible.  If the Principal or designee is not available by the end of the same school day, the teacher must submit written documentation of the<span style=\"text-decoration: line-through;\"> <\/span>incident in an office referral.<span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p>Within one school day after the student’s removal, the Principal, or another District administrator designated by the Principal, must notify the student’s parents, that the student has been removed from class and why.  The notice must also inform the parent that they have the right, upon request, to meet informally with the Principal or the Principal’s designee to discuss the reason(s) for the removal.<\/p>\n<p>The Principal may require the teacher who ordered the removal to attend the informal conference.  If, at the informal meeting, the student denies the allegations, the Principal or the Principal’s designee must explain why the student was removed and give the student and the student’s parents a chance to present the student’s version of the relevant events.  The informal meeting must be held within two school days of the student’s removal.  The timing of the informal meeting may be extended by mutual agreement of the parent and Principal.<\/p>\n<p>Removal of a student with a disability, under certain circumstances, may constitute a change in the student’s placement.  Accordingly, no teacher may remove a student with a disability from their class until they have verified with the Principal or the chairperson of the Committee on Special Education that the removal will not violate the student’s rights under state or federal law or regulation.<\/p>\n<\/li>\n<\/ol>\n<p>5. Suspension from school<\/p>\n<p>Suspension from school is a severe consequence, which may be imposed only upon students who are insubordinate, disorderly, violent, or disruptive or whose conduct otherwise endangers the safety, morals, health or welfare of others.<\/p>\n<p>The Board of Education retains its authority to suspend students, but places primary responsibility for the suspension of students with the Superintendent and the building Principals.<\/p>\n<p>Any staff member may recommend to the Superintendent, their designee, or the Principal that a student be suspended. All staff members must immediately report and refer a violent student to the Principal for a violation of the Code of Conduct.  All recommendations and referrals shall be made in writing unless the conditions underlying the recommendation or referral warrant immediate attention.  In such cases, a written report is to be prepared as soon as possible by the staff member recommending the suspension.<\/p>\n<p>The suspending authority or Principal, upon receiving a recommendation or referral for suspension or when processing a case for suspension, shall gather the facts relevant to the matter and record them for subsequent presentation, if necessary.<\/p>\n<p>5.1 Short-term (5 days or less) suspension from school<\/p>\n<p>When the Superintendent or Principal (referred to as the “suspending authority”) proposes to suspend a student charged with misconduct for five days or less pursuant to Education Law §3214(3), the suspending authority must immediately notify the student orally.  If the student denies the misconduct, the suspending authority must provide an explanation of the basis for the proposed suspension.  The suspending authority must also notify the student’s parents in writing that the student may be suspended from school. <\/p>\n<p>The written notice must be provided by personal delivery, express mail delivery or some other means that is reasonably calculated to assure receipt of the notice within 24 hours of the decision to propose suspension at the last known address for the parents.  Where possible, notice should also be provided by telephone if the school has been provided with a telephone number(s) for the purpose of contacting the parents.<\/p>\n<p>The notice shall provide a description of the charges against the student and the incident for which suspension is proposed and shall inform the parents of the right to request an immediate, informal conference with the Principal. Both the notice and informal conference shall be in the dominant language or mode of communication used by the parents.  At the conference, the parents shall be permitted to ask questions of complaining witnesses under such procedures as the Principal may establish.<\/p>\n<p>The notice and opportunity for an informal conference shall take place before the student is suspended unless the student’s presence in school poses a continuing danger to persons or property or an ongoing threat of disruption to the academic process.  If the student’s presence does pose such a danger or threat of disruption, the notice and opportunity for an informal conference shall take place as soon as possible after the start date of the suspension.<\/p>\n<p>After the conference, the Principal shall promptly advise the parents in writing of their decision.  The Principal shall advise the parents that if they are not satisfied with the decision and wish to pursue the matter, they must file a written appeal to the Superintendent within five business days, unless they can show extraordinary circumstances precluding them from doing so. <\/p>\n<p>The Superintendent shall issue a written decision regarding the appeal within ten business days of receiving the appeal.  If the parents are not satisfied with the Superintendent’s decision, they must file a written appeal to the Board of Education with the District clerk within ten business days of the date of the Superintendent’s decision, unless they can show extraordinary circumstances precluding them from doing so. Final decisions of the Board of Education may be appealed to the Commissioner within 30 days of the decision.<\/p>\n<p>5.2 Long-term (more than 5 days) suspension from school<\/p>\n<p>When the Superintendent determines that a suspension for more than five days may be warranted, the Superintendent shall give reasonable notice to the student and the student’s parents of their right to a fair hearing.  At the hearing, the student shall have the right to be represented by counsel, the right to question witnesses against them, and the right to present witnesses and other evidence on their behalf.<\/p>\n<p>The Superintendent shall personally hear and determine the proceeding or may, in their discretion, designate a hearing officer to conduct the hearing.  The hearing officer shall be authorized to administer oaths and to issue subpoenas in conjunction with the proceeding before them.  A record of the hearing shall be maintained, but no stenographic transcript shall be required.  An audio recording shall be deemed a satisfactory record.  The hearing officer shall make findings of fact and recommendations as to the appropriate measure of discipline to the Superintendent.  The report of the hearing officer shall be advisory only and the Superintendent may accept all or any part thereof.<\/p>\n<p>An appeal of the decision of the Superintendent may be made to the Board of Education that will make its decision based solely upon the record before it.  All appeals to the Board of Education must be in writing and submitted to the District clerk within ten business days of the date of the Superintendent’s decision, unless the parents can show that extraordinary circumstances precluded them from doing so.  The Board of Education may adopt in whole or in part the decision of the Superintendent.  Final decisions of the Board of Education may be appealed to the Commissioner within 30 days of the decision.<\/p>\n<p><strong>C. Minimum Periods of Suspension<\/strong><\/p>\n<ol>\n<li>Students who bring a weapon to school<\/li>\n<\/ol>\n<p>Any student found guilty of bringing a weapon onto school property may be subject to suspension from school for one calendar year.  Before being suspended, the student will have an opportunity for a hearing pursuant to Education Law §3214. The Superintendent has the authority to modify the one-year suspension on a case-by-case basis. In deciding whether to modify the consequence, the Superintendent may consider the following:<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>The student’s age.<\/li>\n<li>The student’s grade in school.<\/li>\n<li>The student’s prior disciplinary record.<\/li>\n<li>The superintendent’s belief that other forms of discipline may be more effective.<\/li>\n<li> Input from parents\/guardians, teachers and\/or others.<\/li>\n<li>Other extenuating circumstances.<\/li>\n<li>A student with a disability may be suspended only in accordance with the requirements of state and federal law.<\/li>\n<\/ol>\n<\/li>\n<li>Students who commit violent acts other than bringing a weapon to school<strong><br \/>\n<\/strong><\/li>\n<\/ol>\n<p>Any student, other than a student with a disability, who is found to have committed a violent act, other than bringing a weapon onto school property, may be subject to suspension from school for a minimum of one to five days.  If the proposed consequence is the minimum five-day suspension, the student and the student’s parents will be given the same notice and opportunity for an informal conference given to all students subject to a short-term suspension.<\/p>\n<p> If the proposed consequence exceeds the minimum five-day suspension, the student and the student’s parents will be given the same notice and opportunity for a hearing given to all students subject to a long-term suspension.  The Superintendent has the authority to modify the minimum five-day suspension on a case-by-case basis.  In deciding whether to modify the consequence, the Superintendent may consider the same factors considered in modifying a one-year suspension for possessing a weapon.<\/p>\n<p>3. Students who are repeatedly substantially disruptive of the educational<br \/>\nprocess or repeatedly substantially interferes with the teacher’s authority over the classroom<\/p>\n<p>Any student, other than a student with a disability, who repeatedly is substantially disruptive of the educational process or substantially interferes with the teacher’s authority over the classroom may be suspended from school for a minimum of one to five days.  For purposes of this Code of Conduct, “repeatedly is substantially disruptive,” means engaging in conduct that results in the student being removed from the classroom by teacher(s) pursuant to Education Law §3214 (3-a) and this code on four or more occasions during a semester will be suspended from school. <\/p>\n<p>The student and the student’s parent will be given the same notice and opportunity for an informal conference given to all students subject to a short-term suspension.  If the proposed consequence exceeds a five-day suspension, the student and the student’s parent will be given the same notice and opportunity for a hearing given to all students subject to a long-term suspension.  The Superintendent has the authority to modify suspension on a case-by-case basis.  In deciding whether to modify the consequence, the Superintendent may consider the same factors considered in modifying a one-year suspension for possessing a weapon.<\/p>\n<p><strong>D. Referrals<\/strong><\/p>\n<ol>\n<li>Counseling and\/or Support Services, as indicated by teacher, principal and\/or student support team.<\/li>\n<\/ol>\n<p>PINS Diversion\/Petitions – The District may file a PINS (person in need of supervision) petition in Family Court on any student under the age of 16 who demonstrates that they require supervision and treatment by:<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>Being habitually truant and\/or absent for ten or more days without a valid excuse as well as, at the secondary level, failing two or more subjects as a result of the absences.<\/li>\n<li>Engaging in an ongoing or continual course of conduct which makes the student ungovernable or habitually disobedient and beyond the lawful control of the school.<\/li>\n<li>Knowingly and unlawfully possesses marijuana in violation of Penal Law §221.05.  A single violation of §221.05 will be a sufficient basis for filing a PINS petition.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>Juvenile Delinquents and Juvenile Offenders – The superintendent is required to refer the following students to the county attorney for a juvenile delinquency proceeding before the Family Court:\n<ol>\n<li>\n<p>Any student under the age of 16 who is found to have brought a weapon to school, or<\/p>\n<\/li>\n<li>\n<p>Any student 14 or 15 years old who qualifies for juvenile offender status under the Criminal Procedure Law §1.20 (42).<\/p>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>The Superintendent is required to refer students aged 16 and older or any student 14 or 15 years old who qualifies for juvenile offender status to the appropriate law enforcement authorities.<\/p>\n<p>\n<a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"AltInstr\"><\/a>X. Alternative Instruction<\/h2>\n<p>When a student of any age is removed from class by a teacher or a student of compulsory attendance age is suspended from school pursuant to Education Law §3214, the District will take immediate steps to provide alternative means of instruction for the student. Removal for suspension will be immediately followed by arrangements for alternative instruction.<\/p>\n<h2><a id=\"DiscipDisab\"><\/a>XI. Discipline of Students With Disabilities<\/h2>\n<p>The Board of Education recognizes that it may be necessary to suspend, remove or otherwise discipline students with disabilities to address disruptive or problem behavior.  The Board of Education also recognizes that students with disabilities are entitled to certain procedural protections whenever school authorities intend to impose discipline upon them.  The Board of Education is committed to ensuring that the procedures followed for suspending, removing or otherwise disciplining students with disabilities are consistent with the procedural safeguards required by applicable laws and regulations.<\/p>\n<p>This Code of Conduct affords students with disabilities subject to disciplinary action no greater or lesser rights than those expressly afforded by applicable federal and state law and regulations.<\/p>\n<p><strong>A. Authorized Suspensions or Removals of Students with Disabilities<\/strong><\/p>\n<ol>\n<li>For purposes of this section of the Code of Conduct, the following definitions apply:\n<ol>\n<li>A “suspension” means a suspension pursuant to Education Law §3214.<\/li>\n<li>A “removal” means a removal for disciplinary reasons from the student’s current educational placement other than a suspension and change in placement to an interim alternative educational setting (IAES) ordered by an impartial hearing officer because the student poses a risk of harm to themself or others.<\/li>\n<li>An Interim Alternative Educational Setting (IAES) means temporary educational placement for a period of up to forty-five days, other than the student’s current placement at the time the behavior precipitating the IAES placement occurred, that enables the student to continue to progress in the general curriculum, although in another setting, to continue to receive those services and modifications, including those described on the student’s current individualized education program (IEP), that will enable the student to meet the goals set out in such IEP, and include services and modifications to address the behavior which precipitated the IAES placement that are designed to prevent the behavior from recurring.<\/li>\n<\/ol>\n<\/li>\n<li>School personnel may order the suspension or removal of a student with a disability from their current educational placement as follows:\n<ol>\n<li>The Board of Education, the District (BOCES) Superintendent of schools or a Building Principal may order the placement of a student with a disability into an IAES, another setting or suspension for a period not to exceed five consecutive school days and not to exceed the amount of time a non-disabled student would be subject to suspension for the same behavior.<\/li>\n<li>The superintendent may order the placement of a student with a disability into an IAES, another setting or suspension for up to ten consecutive school days, inclusive of any period in which the student has been suspended or removed under subparagraph (1.1) above for the same behavior, if the superintendent determines that the student has engaged in behavior that warrants a suspension and the suspension or removal does not exceed the amount of time non-disabled student would be subject to suspension for the same behavior.<\/li>\n<li>The Superintendent may, directly or upon the recommendation of a designated hearing officer, order additional suspensions of not more than ten consecutive school days in the same school year for separate incidents of misconduct, as long as those removals do not constitute a change of placement.<\/li>\n<li>Students with disabilities who have been suspended or removed from their current placement for more than ten school days may, as determined by the CSE, be placed in an IAES which is the temporary education setting other than the student’s current placement at the time the behavior precipitating the IAES placement occurred.<\/li>\n<\/ol>\n<\/li>\n<li>Additionally, the District may seek an order from a hearing officer for a change in placement of a student with a disability to an appropriate IAES for up to forty-five school days if the District established, in accordance with law, that such student is substantially likely to injure themself or others.  There are three specific instances when a student with a disability may be placed in an IAES for up to forty-five school days without regard to a manifestation determination.\n<ol>\n<li>Where the student carries or possesses a weapon to or at school, on school premises, or to or at a school function under the jurisdiction of the District; or\n<p><strong>“Weapon”<\/strong> means the same as <strong>“dangerous weapon”<\/strong> under 18 U.S.C. §930(g)(w) which includes “a weapon, device, instrument, material, or substance, animate or inanimate, that is used for, or is readily capable of causing death or serious bodily injury, except…[for] a pocketknife with a blade of less than 2-1\/2 inches in length.<\/p>\n<\/li>\n<li>Where a student knowingly possesses or uses illegal drugs or sells or solicits the sale of a controlled substance while at school, on school premises, or a school function under the jurisdiction of the District; or<br \/>\n<strong>“Controlled substance”<\/strong> means a drug or other substance identified in certain provisions of the federal Controlled Substances Act specified in both federal and state law and regulations applicable to this policy.<br \/>\n<strong>“Illegal drugs”<\/strong> means a controlled substance except for those legally possessed or used under the supervision of a licensed health-care professional or that is legally possessed or used under any other authority under the Controlled Substances Act or any other federal law.<\/li>\n<li>Where a student has inflicted serious bodily injury upon another person while at school, on school premises, or at a school function under the jurisdiction of the District.  Serious bodily harm has been defined in law to refer to one of the following:\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>Substantial risk of death; or<\/li>\n<li>Extreme physical pain; or<\/li>\n<li>Protracted and obvious disfigurement or protracted loss or impairment of the function of a bodily member, organ or mental faculty.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<li>School personnel may consider any unique circumstances on a case-by-case basis when determining whether to order a change in placement for a student with a disability who violates a code of student conduct.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>Subject to specified conditions required by both federal and state law and regulations, an impartial hearing    student or others. officer may order the placement of a student with a disability in an IAES setting for up to forty-five days at a time, if maintaining the student in their current education placement poses a risk of harm to the student or others.<\/p>\n<p>\n<strong>B. Change of Placement Rule<\/strong><\/p>\n<ol>\n<li>A disciplinary change in placement means a suspension or removal from a student’s current educational placement that is either:\n<ol>\n<li>For more than ten consecutive school days; or<\/li>\n<li>For a period of ten consecutive school days or less if the student is subjected to a series of suspensions or removals that constitute a pattern because they cumulate to more than ten school days in a school year and because of such factors as the length of each suspension or removal, the total amount of time the student is removed and the proximity of the suspensions or removals to one another.<\/li>\n<\/ol>\n<\/li>\n<li>\n<p>School personnel may not suspend or remove a student with disabilities if imposition of the suspension or removal would result in a disciplinary change in placement based on a pattern of suspension or removal.<\/p>\n<\/li>\n<\/ol>\n<p>However, the District may impose a suspension or removal, which would otherwise result in a disciplinary change in placement, based on a pattern of suspensions or removals if the CSE has determined that the behavior was not a manifestation of the student’s disability, or the student is placed in an IAES for behavior involving weapons, illegal drugs, or controlled substances.<span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p><strong>C. Special Rules Regarding the Suspension or Removal of Students with Disabilities<\/strong><\/p>\n<ol>\n<li>The District’s Committee on Special Education shall:<\/li>\n<\/ol>\n<p>Conduct functional behavioral assessments to determine why a student engages in a particular behavior and develop or review behavioral intervention plans whenever the District is first suspending or removing a student with a disability for more than ten school days in a school year or imposing a suspension or removal that constitutes a disciplinary change in placement, including a change in placement to an IAES for misconduct involving weapons, illegal drugs or controlled substances.<\/p>\n<p>If, subsequently, a student with a disability who has a behavioral intervention plan and who has been suspended or removed from their current educational placement for more than ten school days in a school year is subject to a suspension or removal that does not constitute a disciplinary change in placement, the members of the CSE shall review the behavioral intervention plan and its implementation to determine if modifications are necessary.<\/p>\n<p>If one or more members of the CSE believe that modifications are needed, the school District shall convene a meeting of the CSE to modify such plan and its implementation to the extent the committee determines necessary.<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li><strong>Manifestation Determination<\/strong><br \/>\nA review of the relationship between the student’s disability and the behavior subject to disciplinary action to determine if the conduct is a manifestation of the disability must be made by a manifestation team immediately, if possible, but in no case later than ten school days after a decision is made:<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<ul>\n<li style=\"list-style-type: none;\">\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>By the superintendent to change the placement to an Interim Alternative Educational Setting (IAES)<\/li>\n<li>By an Impartial Hearing Officer (IHO) to place the student in an IAES<\/li>\n<li>By the Board of Education, District (BOCES) superintendent, superintendent, or building principal to impose a suspension that constitutes a disciplinary change of placement.\n<p>The manifestation team shall include a representative of the District knowledgeable about the student and the interpretation of information about child behavior, the parent, and relevant members of the CSE as determined by the parent and the District.  The parent must receive written notice prior to the meeting to ensure that the parent has an opportunity to attend.  This notice must include the purpose of the meeting, the names of those expected to attend and notice of the parent’s right to have relevant members of the CSE participate at the parent’s request.<\/p>\n<p>The manifestation team shall review all relevant information in the student’s file including the student’s IEP, any teacher observations, and any relevant information provided by the parents to determine if the conduct in question was caused by or had a direct and substantial relationship to the student’s disability, or the conduct in question was the direct result of the District’s failure to implement the IEP.<\/p>\n<\/li>\n<\/ol>\n<\/li>\n<li><strong style=\"font-size: 1rem;\">Finding of Manifestation<br \/>\n<\/strong><\/p>\n<p>If it is determined, as a result of this review, that the student’s behavior is a manifestation of their disability, the CSE shall conduct a functional behavioral assessment and implement or modify a behavioral intervention plan.  Unless the change in placement was due to behavior involving serious bodily injury, weapons, illegal drugs or controlled substances, the student must be returned to the placement as part of the modification of the behavioral intervention plan.<\/p>\n<\/li>\n<li><strong style=\"font-size: 1rem;\">No Finding of Manifestation<br \/>\n<\/strong><\/p>\n<p>If it is determined that the student’s behavior is <u>not<\/u> a manifestation of their disability, the relevant disciplinary procedures applicable to students without disabilities may be applied to the student in the same manner in which they would be applied to students without disabilities, subject to the right to the parent\/person in parental relation to request a hearing objecting to the manifestation determination and the District’s obligation to provide a free, appropriate public education to such student.<\/p>\n<\/li>\n<li><strong style=\"font-size: 1rem;\">Provision of Services Regardless of the Manifestation Determination<br \/>\n<\/strong><\/p>\n<p>Regardless of the manifestation determination for subsequent suspensions or removals for ten consecutive school days or less that in the aggregate total more than ten school days in a school year but do <u>not<\/u> constitute a disciplinary change of placement, and for suspensions or other disciplinary removals in excess of ten school days in a school year which <u>do<\/u> not constitute a disciplinary change.<\/p>\n<p>2. The parents of a student who is facing disciplinary action, but who has not been determined to be eligible for services under IDEA and Article 89 at the time of misconduct, shall have the right to invoke applicable procedural safeguards set forth in federal and state law and regulations if, in accordance with federal and state statutory and regulatory criteria, the District is deemed to have had knowledge that their child was a student with a disability before the behavior precipitating disciplinary action occurred. If the District is deemed to have had such knowledge, the student will be considered a student presumed to have a disability for discipline purposes.<\/p>\n<ol>\n<li>The Superintendent, Building Principal or other school official imposing a suspension or removal shall be responsible for determining whether the student is a student presumed to have a disability.<\/li>\n<li>A student will not be considered a student presumed to have a disability for discipline purposes if, upon receipt of information supporting a claim that the District had knowledge the student was a student with a disability, the District either:\n<ol>\n<li><span style=\"font-size: 1rem;\">Conducted an individual evaluation and determined that the student is not a student with a disability; or<\/span><\/li>\n<li>\n<p>Determined that an evaluation was not necessary and provided notice to the parents of such determination, in the manner required by applicable law and regulations.<\/p>\n<p>If there is no basis for knowledge that the student is a student with a disability prior to taking disciplinary measures against the student, the student may be subjected to the same disciplinary measures as any other non-disabled student who engaged in comparable behaviors.<\/p>\n<p><strong>STUDENTS PRESUMED TO HAVE A DISABILITY<\/strong><\/p>\n<p>If a request for an individual evaluation is made while such non-disabled student is subjected to a disciplinary removal, an expedited evaluation shall be conducted and completed in the manner prescribed by applicable federal and state law and regulations.  Until the expedited evaluation is completed, the non-disabled student who is not a student presumed to have a disability for discipline purposes shall remain in the educational placement determined by the District, which can include suspension.<\/p>\n<\/li>\n<li>\n<p>The District shall provide parents with notice of disciplinary removal no later than the date on which a decision is made to change the placement of a student with a disability to an IAES for either misconduct involving weapons, illegal drugs or controlled substances or because maintaining the student in their current educational setting poses a risk of harm to the student or others; or a decision is made to impose a suspension or removal that constitutes a disciplinary change in placement.<\/p>\n<\/li>\n<li>\n<p>The parents of a student with disabilities subject to a suspension of five consecutive school days or less shall be provided with the same opportunity for an informal conference available to parents of non-disabled students under the Education Law,<\/p>\n<\/li>\n<li>\n<p>Superintendent hearings on disciplinary charges against students with disabilities subject to a suspension of more than five school days shall be divided into a guilt phase and a consequence phase in accordance with the procedures set forth in the Commissioner’s regulations incorporated into this code.<\/p>\n<\/li>\n<li>\n<p>The removal of a student with disabilities other than a suspension or placement in an IAES shall be conducted in accordance with the due process procedures applicable to such removals of non-disabled students, except that school personnel may not impose such removal for more than ten consecutive days or for a period that would result in a disciplinary change in placement, unless the Committee on Special Education has determined that the behavior is not a manifestation of the student’s disability.<\/p>\n<\/li>\n<li>\n<p>During any period of suspension or removal, including placement in an IAES, students with disabilities shall be provided services as required by the Commissioner’s regulations incorporated into this code.<\/p>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<\/li>\n<\/ul>\n<p><strong>D. Expedited Due Process Hearings<\/strong><br \/>\n1. An expedited due process hearing shall be conducted in the manner specified by the Commissioner’s regulations incorporated into this code, if:<br \/>\n1.1 The District requests such a hearing to obtain an order of an impartial hearing officer placing a student with a disability in an IAES where school personnel maintain that it is dangerous for the student to be in their current educational placement, or during the pendency of due process hearings where school personnel maintain that it is dangerous for the student to be in their current education placement during such proceedings.<br \/>\n1.2 The parent requests such a hearing from a determination that the student’s behavior was not a manifestation of the student’s disability, or relating to any decision regarding placement, including but not limited to, any decision to place the student in an IAES.<br \/>\n1.2.1.1 During the pendency of an expedited due process hearing or appeal regarding the placement of a student in an IAES for behavior involving weapons, illegal drugs or controlled substances, or on grounds of dangerousness, or regarding a determination that the behavior is not a manifestation of the student’s disability for a student who has been placed in an IAES, the student shall remain in the IAES pending the decision of the impartial hearing officer or until expiration of the IAES placement, whichever occurs first, unless the parents and the District agree otherwise.<\/p>\n<p>1.2.2 If school personnel propose to change the student’s placement after expiration of an IAES placement, during the pendency of any proceeding to challenge the proposed change in placement, the student shall remain in the placement prior to removal to the IAES, except where the student is again placed in an IAES.<\/p>\n<p>2. An expedited due process hearing shall be completed within fifteen business days of receipt of the request for a hearing.  Although the impartial hearing officer may grant specific extensions of such time period, the impartial hearing officer must mail a written decision to the District and the parents within five business days after the last hearing date, and in no event later than forty-five calendar days after receipt of the request for a hearing, without exceptions or extensions.<\/p>\n<p><strong>E. Referral to Law Enforcement and Judicial Authorities<\/strong><br \/>\nIn accordance with the provisions of IDEA and its implementing regulations:<\/p>\n<ol>\n<li>The District will report a crime committed by a child with a disability to appropriate authorities, and such action will not constitute a change of the student’s placement.<\/li>\n<li>The Superintendent shall ensure that copies of the special education and disciplinary records of a student with disabilities are transmitted for consideration to the appropriate authorities to whom a crime is reported.<\/li>\n<\/ol>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"CorpPunish\"><\/a>XII. Prohibition of Corporal Punishment<\/h2>\n<p>Corporal punishment is any act of physical force upon a student for the purpose of punishing that student.  Corporal punishment of any student by any District employee is strictly forbidden.<\/p>\n<p>Corporal punishment does not include the use of physical restraint to protect the student, another student, teacher or any other person from physical injury, when alternative procedures and methods not involving the use of physical restraint cannot reasonably be employed to achieve these purposes.<\/p>\n<p>Physical restraint will not be used to prevent property damage, except in situations where there is imminent danger of serious physical harm to the student or others, and the student has not responded to positive intervention strategies.<\/p>\n<p>The authorized use of timeout and physical restraint is addressed in Policy 4321.12 and Regulation 4321.12-R.<\/p>\n<p>The District will file all complaints about the use of corporal punishment with the Commissioner of Education in accordance with Commissioner’s regulations.<\/p>\n<h2><a id=\"Transp\"><\/a>XIII. Transportation<\/h2>\n<p>\n<strong>A. Transportation Purpose and Objective<\/strong><\/p>\n<p>Pupil transportation is a necessary service and integral part of the total educational program.  The major objectives of the pupil transportation program are to provide safe transportation, operate an efficient and economical transportation system, adapt transportation to the requirements of the instructional program, and maintain conditions on the buses which are conducive to the best interests of students.<\/p>\n<p><strong>B. Rationale<\/strong><br \/>\nThe school bus is considered an extension of the school; therefore, the safety and welfare of all pupils riding school buses is a major responsibility of the District.  Bus discipline, in order to be effective, must be a cooperative effort involving the transportation department, administrators, parents and pupils.<strong><em>   <\/em><\/strong><\/p>\n<p><strong>C. Roles and Responsibilities<\/strong><\/p>\n<ol>\n<li>Transportation personnel will receive orientation on a regularly scheduled basis regarding general discipline, pupil behavior, pupil rights, bus rules and disciplinary procedures.<\/li>\n<li>Bus drivers, teachers and administrators will be responsible for orienting pupils on a regularly scheduled basis regarding bus behavior.<\/li>\n<li>Pupils will be under the authority and supervision of the bus driver while on the bus and will always be expected to adhere to the posted bus expectations and driver directions.<\/li>\n<li>Bus expectations and regulations will be published and distributed to parents, pupils, and bus drivers, and they will be posted on every bus.<\/li>\n<li>Pupils who are disorderly and insubordinate will be subject to disciplinary actions.<\/li>\n<li>Disciplinary action for misbehavior on buses will be the responsibility of building administrators, in collaboration with the Director of Transportation (or their designee).<\/li>\n<li>Disciplinary action will be reasonable and administered in a progressive manner with pupil’s rights to due process guaranteed.<\/li>\n<li>The Principal or the Director of Transportation (or their designee) will be responsible for notifying parents of disciplinary actions resulting from bus referrals in order to obtain their support and cooperation.<\/li>\n<\/ol>\n<p><strong>D. Student RFID (Radio-frequency identification) Cards<\/strong><\/p>\n<p>Students are issued RFID Cards that are used for attendance and accountability purposes on school buses.  When the student boards and leaves the school bus, they are required to scan their card on the card reader in the bus.  This will verify that the student has boarded or left the school bus, as well as display on the driver’s Mobile Data Terminal and at the transportation dispatch office. <\/p>\n<p>The following pertains to the use of the RFID Cards:<\/p>\n<ol>\n<li>Students are required to use their RFID Card when boarding and leaving the bus each day. The bus driver will remind students of this requirement if they fail to use their card.<\/li>\n<li>If a student repetitively fails to scan their card when entering\/exiting the bus, or consistently loses their card, drivers may submit written discipline referrals.<\/li>\n<li>If a student has not received an RFID Card, or their card is lost or stolen, please go to the district website and select <em>Family Links and<\/em> <em>Resources<\/em> at the top of the page, then scroll down to <em>Student ID Replacement<\/em> and click on the MYSchoolBucks.com link to request a new card.<\/li>\n<\/ol>\n<p><strong>E. Bus Expectations<br \/>\n<\/strong>Students are required to conduct themselves on the bus in a manner consistent with established standards for classroom behavior in accordance with the Code of Conduct.<\/p>\n<ol>\n<li>In addition, students are required to adhere to the following expectations while riding the school bus:\n<ol>\n<li>Follow the directions of the driver<\/li>\n<li>Stay in your seat<\/li>\n<li>No foul language or rude behavior<\/li>\n<li>Keep all body parts and objects to yourself and inside the bus<\/li>\n<li>No eating or drinking on the bus<\/li>\n<li>No tobacco\/nicotine products, illegal substances, vaping devices or paraphernalia, or hazardous materials on the bus<\/li>\n<li>D.O.T. regulations prohibit aerosol cans, glass containers and flammable substances on the bus<\/li>\n<li>Perfumes\/colognes shall not be applied on school buses<\/li>\n<li>Cell phones and other electronic communication devices shall not be used to bully, discriminate, threaten, harass, or denigrate other students or school personnel.<\/li>\n<li>Devices may not be used while boarding\/discharging or crossing, and during emergency situations or school bus safety drills unless authorized by the driver.<\/li>\n<li>Video\/audio recordings and pictures are not allowed to be taken by students riding District buses<\/li>\n<li>Laser pointers and other objects that can obstruct or impair the vision of the driver are not allowed to be used on school buses at any time<\/li>\n<li>Headphones must be used when listening to music, playing games or viewing content on devices. For student safety reasons headphones must be removed when entering\/exiting the bus or crossing at bus stops<\/li>\n<li>Any devices that is being used inappropriately may be confiscated by bus drivers and returned to the students when they depart the bus. If a student continues to use their device inappropriately, a discipline referral may be submitted, and the device may be confiscated and returned only to a parent\/guardian.<\/li>\n<li>The school District will not be held responsible for the loss or theft of any personal electronic device.<\/li>\n<li>Hockey and lacrosse sticks are allowed to be transported on the bus but must be stored at all times behind the driver’s seat. Other athletic equipment, musical instruments, school projects or other objects larger than 36 inches (length) by 12 inches (width) by 8 inches (depth) will not be transported on school buses.  This includes skis, ski poles, sleds, skateboards, bicycles, and fishing poles.<\/li>\n<li>Unless the bus driver has received prior authorization informing them of a transportation change, all students shall be picked up and discharged at their assigned bus stop.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p><strong>F. Discipline Referrals<\/strong><\/p>\n<ol>\n<li>Upon receipt of a written referral, the principal or Director of Transportation (or their designee) will conduct a pupil conference.<\/li>\n<li>If a pupil denies the allegations against themself, the Principal or Director of Transportation (or their designee) will conduct an investigation into the matter.<\/li>\n<li>A conference with the Building Principal, the Director of Transportation (or their designee), and the parent may be scheduled for chronic bus discipline infractions to develop an intervention plan for the student.<\/li>\n<li>The District reserves the right to assign student seating on school buses for safety, efficiency or disciplinary reasons.<\/li>\n<li>Violations of the expectations above may result in the following consequences:\n<ol>\n<li>warning<\/li>\n<li>assigned seat<\/li>\n<li>parent phone call<\/li>\n<li>bus suspension<\/li>\n<li>restitution for damages or cost of replacement for RFID Cards<\/li>\n<\/ol>\n<\/li>\n<li>Parents may request a transportation conference if a bus suspension is assigned. Transportation conferences may also be utilized for students accumulating 10 bus referrals and 20 days of bus suspension during a school year.<\/li>\n<li>Requests for long-term suspensions from school transportation (more than five days) will require a transportation conference conducted by the Superintendent or designee (e.g., Assistant Superintendent for Business, building principal, or Director of Transportation).<\/li>\n<li>A copy of the bus discipline referral, along with a bus disciplinary letter, will be sent home to explain the situation, outline the consequences, and ask for parent\/guardian support.<\/li>\n<\/ol>\n<p><strong>G. Unauthorized Entry on Buses<\/strong><br \/>\nFor safety and security reasons, unauthorized persons are not allowed to board or ride a school bus at any time, unless prior approval has been received from the transportation department. This includes parents, daycare providers, siblings and underage children.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"AhtleticCoC\"><\/a>XIV. Athletic Code of Conduct<\/p>\n<\/h2>\n<p>Student athletes must adhere to the Athletic Code of Conduct which is a separate document.  The Athletic Code of Conduct is in addition to and does not replace the Students Code of Conduct.  Any discipline imposed under the Athletic Code of Conduct does not preclude additional discipline or consequences under the Student Code of Conduct<\/p>\n<h2><a id=\"SearchInterr\"><\/a>XV. Student Searches and Interrogations<\/h2>\n<p>The Board of Education is committed to ensuring an atmosphere on school property and at school functions that is safe and orderly.  To achieve this kind of environment, any school official authorized to impose a disciplinary consequence on a student may question a student about an alleged violation of law or the District Code of Conduct.  School officials are not required to contact a student’s parent before questioning the student.<\/p>\n<p>In addition, the Board of Education authorizes the Superintendent or their designee, Building Principals or their designee, the school nurse and District security officials to conduct searches of students, their vehicles, and their belongings if the authorized school official has reasonable suspicion to believe that the search will result in evidence that the student violated the law or the District Code of Conduct. For students found to be in possession of drugs, drug paraphernalia, e-cigarettes or vaping devices, or vaping paraphernalia, the search may include conducting a field test to ascertain the chemical nature of the contents found.  This is done, in part, due to the safety risks posed by the contents if ingested.<\/p>\n<p>An authorized school official may conduct a search of a student’s belongings.<\/p>\n<p>An authorized school official may search a student, their vehicle or the student’s belongings based upon information received from a reliable informant.  Individuals, other than the District employees, will be considered reliable informants if they have previously supplied information that was accurate and verified, they make an admission against their own interest, they provide the same information that is received independently from other sources, or they appear to be credible and the information they are communicating relates to an immediate threat to safety.  District employees will be considered reliable informants unless they are known to have previously supplied information that they knew was not accurate.<\/p>\n<p>Before searching a student, their vehicle or the student’s belongings, the authorized school official should allow the student an opportunity to admit that they possess physical evidence that they violated the law or the District Code of Conduct or get the student to voluntarily consent to the search.  Searches will be limited to the extent necessary to locate the evidence sought.  Whenever practicable, searches will be conducted in the privacy of administrative offices and students will be present when their possessions are being searched.<\/p>\n<p><strong>A. Student Lockers, Desks and Other School Storage Placed<\/strong><\/p>\n<p>The rules in this Code of Conduct regarding searches of students and their belongings do not apply to student lockers, desks and other school storage places.  Students have no reasonable expectation of privacy with respect to these places and school officials retain complete control over them.  This means that student lockers, desks and other school storage places may be subject to search at any time by school officials, without prior notice to students and without their consent.<\/p>\n<p><strong>B. Documentation of Searches<\/strong><\/p>\n<p>The authorized school official conducting the search shall be responsible for creating a record of investigation.  <span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p>The Building Principal or the Principal’s designee shall be responsible for the custody, control and disposition of any illegal or dangerous item taken from a student.  The Principal or their designee shall clearly label each item taken from the student and retain control of the item(s), until the item(s) are turned over to the police.  This Principal or their designee shall be responsible for personally delivering dangerous or illegal items to police authorities.<\/p>\n<p><strong>C. Police Involvement in Searches and Interrogations of Students<\/strong><br \/>\nDistrict officials are committed to cooperating with police officials and other law enforcement authorities to maintain a safe school environment.  Police officials, however, have limited authority to interview or search students in schools or at school functions or to use school facilities in connection with police work.  Police officials may enter school property or a school function to question or search a student or to conduct a formal investigation involving students only if they have<\/p>\n<ol>\n<li>A search or an arrest warrant; or<\/li>\n<li>Probable cause to believe a crime has been committed on school property or at a school function; or<\/li>\n<li>Been invited by school officials<\/li>\n<\/ol>\n<p>Before police officials are permitted to question or search any student, the Building Principal or their designee shall first try to notify the student’s parent to give the parent the opportunity to be present during the police questioning or search.  If the student’s parent cannot be contacted prior to the police questioning or search, the questioning or search shall not be conducted. <\/p>\n<p><em>The above requirement does not apply to a School Resource Officer acting to assist the school administration in any school investigation.<\/em><\/p>\n<p>The Principal or designee will also be present during any police questioning or search of a student on school property or at a school function.<\/p>\n<p>Students who are questioned by police officials on school property or at a school function will be afforded the same rights they have outside the school.  This means:<\/p>\n<ol>\n<li>They must be informed of their legal rights<\/li>\n<li>They may remain silent if they so desire<\/li>\n<li>They may request the presence of an attorney<\/li>\n<\/ol>\n<p><strong>D. Child Protective Services Investigations<\/strong><\/p>\n<p>Consistent with the District’s commitment to keep students safe from harm and the obligation of school officials to report to Child Protective Services when they have reasonable cause to suspect that a student has been abused or maltreated, the District will cooperate with local Child Protective Services workers who wish to conduct interviews of students on school property relating to allegations of suspected child abuse and\/or neglect or custody investigations.<\/p>\n<p>All requests by Child Protective Services to interview a student on school property shall be made directly to Building Principal or their designee. The Principal or their designee shall set the time and place of the interview.  The Principal or their designee shall decide if it is necessary and appropriate for a school official to be present during the interview, depending on the age of the student being interviewed and the nature of the allegations.<\/p>\n<p>If the nature of the allegations is such that it may be necessary for the student to remove any of their clothing in order for the Child Protective Services worker to verify the allegations, the school nurse or other District medical personnel must be present during that portion of the interview.  No student may be required to remove their clothing in front of a Child Protective Services worker or District official of the opposite sex.<\/p>\n<p>A Child Protective Services worker may not remove a student from school property without a court order, unless the worker reasonably believes that the student would be subject to danger of abuse if they were not removed from school before a court order can reasonably be obtained.   If the worker believes the student would be subject to danger of abuse, the worker may invoke any rights and procedures to remove the student without a court order and without the parent’s consent.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"Visitors\"><\/a>XVI. Visitors to Schools<\/h2>\n<p>The Board of Education encourages parents and other District community members or District personnel to visit the District’s schools and classrooms to support the work of students, teachers and other staff.  Since schools are a place of work and learning, however, certain limits must be set for such visits.  The Building Principal or their designee is responsible for all persons in the building and on the grounds.  For these reasons, the following rules apply to visitors to the schools:<\/p>\n<ol style=\"list-style-type: upper-alpha;\">\n<li>Anyone who is not a regular staff member or student of the school will be considered a visitor.<\/li>\n<li>All employees in school buildings will wear their SSCSD ID badges.<\/li>\n<li>All visitors to the school must report to the main office or designated area upon arrival at the school.  All visitors must present photo identification which will be screened by our visitor management system.   Each visitor will be required to sign the visitor’s register and will be issued a visitor’s identification badge, which must be worn at all times while in the school or on school grounds.  The visitor must sign out at the main office or designated area before leaving the building.<\/li>\n<li>Visitors attending school functions that are open to the public, such as parent-teacher organization meetings or public gatherings, are not required to register, but are required to remain in the location of the activity.<\/li>\n<li>Parents or citizens who wish to visit a classroom while school is in session are required to arrange such visits in advance with the classroom teacher(s) and will be permitted at the discretion of the Building Principal or designee in order to keep class disruption to a minimum.<\/li>\n<li>Teachers are not expected to take class time to discuss individual matters with visitors.<\/li>\n<li>Any unauthorized person on school property will be reported to the principal or their designee. Unauthorized persons will be asked to leave. The police may be called if the situation warrants.<\/li>\n<li> All visitors are expected to abide by the rules for public conduct on school property contained in this Code of Conduct. Any violation will be reported to the Principal or their designee.<\/li>\n<li>No students will leave school prior to the end of the school day unless they are signed out in the office as per school procedures.<\/li>\n<li>Administrative permission must be granted to meet with a student during the school day or at school sponsored events.<\/li>\n<li>Visitors who are volunteers must have a completed and approved application form, including contact information and references, on file in the building&#8217;s main office prior to volunteering.   A volunteer shall be defined as a person willing to donate their time and skills to assist school personnel in the implementation of various programs and activities within the District.<\/li>\n<\/ol>\n<h2><a id=\"PublCond\"><\/a>XVII. Public Conduct on School Property<\/h2>\n<p>The District is committed to providing an orderly, respectful environment that is conducive to learning.  To create and maintain this kind of an environment, it is necessary to regulate public conduct on school property and at school functions.  For purposes of this section of the code, “public” shall mean all persons on school property or attending a school function including students, teachers, and District personnel.<\/p>\n<p>The restrictions on public conduct on school property and at school functions contained in this code are not intended to limit freedom of speech or peaceful assembly.  The District recognizes that free inquiry and free expression are indispensable to the objectives of the District.  The purpose of this code is to maintain public order and prevent abuse of the rights of others.<\/p>\n<p>All persons on school property or attending a school function shall conduct themselves in a respectful and orderly manner.  In addition, all persons on school property or attending a school function are expected to be properly attired for the purpose they are on school property.<\/p>\n<p><strong>A. Prohibited Conduct<\/strong><br \/>\nNo person, either alone or with others, shall:<\/p>\n<ol>\n<li>Intentionally injure any person or threaten to do so<\/li>\n<li>Intentionally damage or destroy District property or the personal property of a teacher, administrator, other District employee or any person lawfully on school property, including graffiti or arson<\/li>\n<li>Disrupt the orderly conduct of classes, school programs or other school activities<\/li>\n<li>Distribute or wear materials on school grounds or at school functions that are obscene, advocate illegal action, appear libelous, obstruct the rights of others or are disruptive to the school program<\/li>\n<li>Intimidate, harass, or discriminate against any person on the basis of actual or perceived race (including traits historically associated with race, such as hair texture and protective hairstyles like braids, locks, and twists), color, creed, national origin, religion, age, gender, sexual orientation or disability on school grounds or at a school function<\/li>\n<li>Enter any portion of the school premises or remain in any building or facility without authorization<\/li>\n<li>Obstruct the free movement of any person in any place to which this code applies<\/li>\n<li>Violate the traffic laws, parking regulations or other restrictions on vehicles<\/li>\n<li>Possess, consume, sell, distribute, or exchange alcoholic beverages, controlled substances or be under the influence of either on school property or at a school function<\/li>\n<li>Possess or use weapons in or on school property or at a school function, except in the case of law enforcement officers or as specifically authorized by the District<\/li>\n<li>Loiter on school property<\/li>\n<li>Gamble on school property or at school functions<\/li>\n<li>Refuse to comply with any reasonable order of identifiable District officials performing their duties<\/li>\n<li>Willfully incite others to commit any of the acts prohibited by this code<\/li>\n<li>Violate any federal or state statute, local ordinance, or Board of Education policy while on school property or while at the school functions<\/li>\n<\/ol>\n<p><strong>B. Consequences<\/strong><br \/>\nPersons who violate this code shall be subject to the following consequences:<\/p>\n<ol>\n<li><strong>Visitors:<\/strong> Their authorization, if any, to remain on school grounds or at the school function shall be withdrawn and they shall be directed to leave the premises. If they refuse to leave, they shall be subject to arrest.<\/li>\n<li><strong>Students:<\/strong> They may be subject to counseling, or to disciplinary action as the facts may warrant.<\/li>\n<\/ol>\n<p><strong>C. Enforcement<\/strong><\/p>\n<p>The Building Principal and all staff members are responsible for enforcing the conduct required by this code.  When the Building Principal or any other staff member sees an individual engaged in prohibited conduct, which in their judgment does not pose any immediate threat of injury to persons or property, the Principal or their designee shall tell the individual that the conduct is prohibited and attempt to persuade the individual to stop. <\/p>\n<p>The Principal or their designee shall also warn the individual of the consequences for failing to stop.  If the person refuses to stop engaging in the prohibited conduct, or if the person’s conduct poses an immediate threat of injury to persons or property, the Principal or their designee shall have the individual removed immediately from school property or the school function.  If necessary, local law enforcement authorities will be contacted to assist in removing the person.<\/p>\n<p>The District shall initiate disciplinary action against any student, as appropriate, with the “Consequences” section above.  In addition, the District reserves the right to pursue a civil or criminal legal action against any person violating the code.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n<h2><a id=\"DissmRev\"><\/a>XVIII. Dissemination and Review<\/h2>\n<p><strong>A. Dissemination of Code of Conduct<\/strong><br \/>\nThe Board of Education will work to ensure that the community is aware of this Code of Conduct by:<\/p>\n<ol>\n<li>Providing the Code of Conduct Summary Document to each student\/parent of the District via the Parent\/Student Handbook, or other similar document, at the start of each school year<\/li>\n<li>Providing a link on the District website (<a href=\"http:\/\/www.saratogaschools.org\">www.saratogaschools.org<\/a>) to the Code of Conduct document (Link to a translation tool is available on website).<\/li>\n<li>Make available a summary of the Code of Conduct written in plain language to all parents of District students before the beginning of the school year and making this summary available later upon request<\/li>\n<li>Providing all current teachers and other staff members with a copy of the Code of Conduct and a copy of any amendments to the code as soon as practicable after adoption<\/li>\n<li>Providing all new employees with a copy of the current Code of Conduct<\/li>\n<li>Making copies of the Code of Conduct available for review by students, parents, and other community members<\/li>\n<\/ol>\n<p>The Board of Education will sponsor an in-service education program for all District staff members to ensure the effective implementation of the Code of Conduct including but not limited to, guidelines for promoting a safe and supportive school climate while discouraging, among other things, discrimination, or harassment against students by students and\/or school employees and including safe and supportive school climate concepts in the curriculum and classroom. Such training shall be designed to raise staff awareness and sensitivity to potential discrimination or harassment and provide strategies and responses to assist staff in responding to reports and incidents of discrimination and harassment and to help discourage their reoccurrence. The Superintendent may solicit the recommendations of the District staff, particularly teachers and administrators, regarding in-service programs pertaining to the management and discipline of students.<\/p>\n<p><strong>B. Review of Code of Conduct<\/strong><\/p>\n<p>The Board of Education will review this Code of Conduct every year and update it as necessary.  In conducting the review, the Board of Education will review relevant data to determine the effectiveness of the code’s provisions and whether the code has been applied fairly and consistently.<\/p>\n<p>The Board of Education may appoint an advisory committee to assist in reviewing the code and the District’s response to Code of Conduct violations.  The committee will be made up of representatives of student, teacher, administrator, parent organization, school safety personnel and other school personnel.<\/p>\n<p>Before adopting any revisions to the code, the Board of Education will hold at least one public hearing at which school personnel, parents, students, and any other interested party may participate. A change in the name and\/or contact information of any Dignity Act Coordinator will not constitute a revision of the Code of Conduct so as to require public hearing.<\/p>\n<p>The Code of Conduct and any amendments to it will be filed with the Commissioner of Education, in a manner prescribed by the Commissioner, no later than 30 days after adoption.<\/p>\n<p>The final approved Code of Conduct is Board of Education Policy.<\/p>\n<p><a href=\"#TopPage\">Top of Page<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>2025-2026 Code of Conduct Why a Code of Conduct | Definitions | Student Rights &amp; Responsibilities | Essential Partners | Dress Code | Prohibited Conduct | Reporting Violations | Disciplinary Consequences, Procedures &amp; Referrals | Alternative Instruction | Discipline of Students with Disabilities | Prohibition of Corporal Punishment | Transportation | Athletic Code of Conduct &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Code of Conduct&#8221;<\/span><\/a><\/p>\n","protected":false},"author":14,"featured_media":0,"parent":359,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-667","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Code of Conduct - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Code of Conduct - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"2025-2026 Code of Conduct Why a Code of Conduct | Definitions | Student Rights &amp; Responsibilities | Essential Partners | Dress Code | Prohibited Conduct | Reporting Violations | Disciplinary Consequences, Procedures &amp; Referrals | Alternative Instruction | Discipline of Students with Disabilities | Prohibition of Corporal Punishment | Transportation | Athletic Code of Conduct &hellip; Continue reading &quot;Code of Conduct&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-08-11T17:13:05+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"86 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\",\"url\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\",\"name\":\"Code of Conduct - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-01-14T14:55:15+00:00\",\"dateModified\":\"2025-08-11T17:13:05+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"About Us\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Policies and Procedures\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Code of Conduct\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Code of Conduct - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/","og_locale":"en_US","og_type":"article","og_title":"Code of Conduct - Saratoga City School District","og_description":"2025-2026 Code of Conduct Why a Code of Conduct | Definitions | Student Rights &amp; Responsibilities | Essential Partners | Dress Code | Prohibited Conduct | Reporting Violations | Disciplinary Consequences, Procedures &amp; Referrals | Alternative Instruction | Discipline of Students with Disabilities | Prohibition of Corporal Punishment | Transportation | Athletic Code of Conduct &hellip; Continue reading \"Code of Conduct\"","og_url":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-08-11T17:13:05+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"86 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/","url":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/","name":"Code of Conduct - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-01-14T14:55:15+00:00","dateModified":"2025-08-11T17:13:05+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/code-of-conduct\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"About Us","item":"https:\/\/www.saratogaschools.org\/about-us\/"},{"@type":"ListItem","position":3,"name":"Policies and Procedures","item":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/"},{"@type":"ListItem","position":4,"name":"Code of Conduct"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/667","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=667"}],"version-history":[{"count":39,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/667\/revisions"}],"predecessor-version":[{"id":11028,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/667\/revisions\/11028"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/359"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}