{"id":669,"date":"2022-01-14T10:49:23","date_gmt":"2022-01-14T15:49:23","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=669"},"modified":"2022-03-08T15:02:15","modified_gmt":"2022-03-08T20:02:15","slug":"k-12-counseling-plan","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/","title":{"rendered":"K-12 Counseling Plan"},"content":{"rendered":"<h2>Saratoga Springs City School District K – 12 School Counseling Plan 2021 – 2022<\/h2>\n<h3>Introduction<\/h3>\n<p>\nThe Saratoga Springs City School District developed this comprehensive school counseling plan based on the district vision statement, “Pathways.” This document is a statement of where we believe our district should be in the future. The SSCSD School Counseling Committee was formed to develop our core beliefs surrounding the school counseling needs of our students. In addition, the committee utilized the American School Counselor Association National Model as a framework to create the district school counseling plan.<\/p>\n<h3>Saratoga Springs CSD Board of Education Policy<\/h3>\n<p>\nThe Saratoga Springs City School District Board of Education fully supports the SSCSD School Counseling Program and has established the need to form the program through BOE policy.<\/p>\n<h4>Guidance and Counseling<\/h4>\n<p>The Board of Education shall establish a guidance and counseling program. The program shall be concerned with the mental and physical health and personality development of every pupil. The guidance and counseling program shall assist the instructional staff in helping students become responsible, self‐adjusted, productive, contributing citizens of our democratic society.<\/p>\n<p>We would like to thank the committee members responsible for developing this plan, and for their efforts to ensure its implementation.<\/p>\n<h3>Committee Members 2021-22<\/h3>\n<p>Mellisa Allen: School Counselor – Saratoga Springs High School<br \/>\nSophia Anzaroot: Student – Saratoga Springs High School<br \/>\nJudy Brust: Social Worker ‐ Saratoga Springs High School<br \/>\nMelissa Conyers: School Counselor ‐ Maple Avenue Middle School<br \/>\nLisa Cutting: Assistant Superintendent of Curriculum, Instruction, and Assessment<br \/>\nDiane Davis: Social Worker\/McKinney Vento Liaison<br \/>\nChristine Elliot: School Psychologist – Division Street Elementary School<br \/>\nJamie Hansen: Teacher – Division Street Elementary School<br \/>\nJennifer Kelly: School Attendance Officer ‐ District<br \/>\nDarlene King: Director for Pupil Services<br \/>\nLisa Meade: Teacher ‐ Maple Avenue Middle School<br \/>\nJosh Muldner: Maple Avenue Middle School Counseling Department Head<br \/>\nLaurie Newcomer: School Psychologist ‐ District<br \/>\nMaura O’Connell: School Counselor – Saratoga Springs High School<br \/>\nDr. Daniel Packard: Principal – Caroline Street Elementary School<br \/>\nDr. Michael Patton: Superintendent of Schools<br \/>\nBrittany Pfaff: School Counselor – Saratoga Springs High School<br \/>\nIsabelle Pipino: Student ‐ Saratoga Springs High School<br \/>\nStacey Ralston: Saratoga High School Assistant Principal<br \/>\nNicole Sano: Teacher – Division Street Elementary School<br \/>\nScott Singer: Saratoga Springs Middle School Assistant Principal<br \/>\nSarah Sullivan: Social Worker – Division Street &amp; Caroline Street Elementary Schools<br \/>\nAndrea Takacs: School Counselor ‐ Maple Avenue Middle School<br \/>\nCynthia Teplitzky: Social Worker – Dorothy Nolan Elementary School<br \/>\nMichelle Tsao: Principal – Saratoga Springs High School<br \/>\nAndrea Varecka: Teacher – Caroline Street Elementary School<br \/>\nMargaret Wainwright: Teacher – Caroline Street Elementary School<br \/>\nMichele Whitley: Principal – Geyser Road Elementary<\/p>\n<h3>Pathways Vision<\/h3>\n<h4>Equity of Opportunity<\/h4>\n<p>Overcoming barriers to equity, all learners will have the support they need intellectually, creatively, and socially.<\/p>\n<p>District Targets: <\/p>\n<ol>\n<li>Champion efforts to foster and facilitate growth in becoming a culturally competent school district with respect for all.<\/li>\n<li>Promote access and opportunity for all students, exemplified by parity in student participation and performance across all subgroups.<\/li>\n<\/ol>\n<h4>Collaboration<\/h4>\n<p>Working cooperatively, our culture of learning will motivate all to be innovative, productive, creative and inquisitive.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Cultivate shared leadership through purposeful interactions, data-driven decisions, and a focus on improved student learning within Professional Learning Communities<\/li>\n<li>Expand project-based learning, multi-disciplinary programming, and technology across K-12 learning environments<\/li>\n<\/ol>\n<h4>Community<\/h4>\n<p>Providing opportunities at all schools for families, community, and business to be active partners in supporting learner success.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Strengthen the SSCSD community through family outreach and community partnerships.<\/li>\n<li>Utilize proactive communications strategies with all stakeholders.<\/li>\n<\/ol>\n<h4>Personalization<\/h4>\n<p>Teaching and learning will meet the individual needs of all learners, developing meaningful connections to support personal growth.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Develop student ownership of their learning, personal goal setting, and career exploration.<\/li>\n<li>Engage learners in relevant, flexible and innovative learning experiences that adapt to meet individual needs.<\/li>\n<\/ol>\n<h3>Philosophy- ASCA Framework<\/h3>\n<p>To create a structure for our school counseling program we have adopted the American School Counselor Association’s National Model. Philosophically, the ASCA National Model provides a framework to develop a comprehensive school counseling program. The model accounts for planning, mission, objectives, accountability, professional development, and evaluation. This model emphasizes four main components:<\/p>\n<ol>\n<li>The Foundation: School counselors create comprehensive school counseling programs that focus on student outcomes, teach student competencies, and are delivered with identified professional competencies. This is the basis for the program. It is the declaration of the beliefs, mission, and vision for the Saratoga Springs Comprehensive School Counseling Program. The foundation for this at SSCSD was the district goal as established in the Pathways Vision.<\/li>\n<li>The Management Structure: School counselors incorporate organizational assessments and tools that are concrete, clearly delineated and reflective of the school’s needs. It describes the process for planning, and the process and tools necessary to deliver the program. It focuses on program assessment, use‐of‐time assessment, and the use of data. Additional assessments and tools include annual and weekly calendars, annual agreements, and an advisory council.<\/li>\n<li>The Delivery System: School counselors provide services to students, parents, school staff and the community in the following areas: direct and indirect student services, school counseling curriculum, individual student planning and responsive services. This portion of the framework concentrates on the variety of delivery modalities used to implement the comprehensive school counseling program. These structures, including both direct and indirect services, range from the codified, or mapped curriculum to the instructional delivery methodologies (i.e. classroom instruction, group counseling, individual student planning, and responsive services)<\/li>\n<li>The Accountability System: To demonstrate the effectiveness of the school counseling program in measurable terms, school counselors analyze school and school counseling program data to determine how students are different because of the school counseling program. School counselors use data to show the impact of the school counseling program on student achievement, attendance and behavior and analyze school counseling program assessments to guide future action and improve future results for all students. This section helps to coordinate the ways in which the school counselors quantify the added value they provide to the entire system and individual students. This is to be done using data and the evaluation of programs as they provide the personal social supports students need to be academically successful, and to be college and career ready by the time they graduate from the Saratoga Springs City School District.<\/li>\n<\/ol>\n<h2>The Saratoga Springs CSD Foundation for School Counseling<\/h2>\n<h3>We Believe:<\/h3>\n<h4>Everyone has a role<\/h4>\n<ul>\n<li>All members of the school community play a vital role in guiding the development of our children. This includes educators, students, parents and other members of the larger community<\/li>\n<\/ul>\n<h4>In Access and Opportunity<\/h4>\n<ul>\n<li>All students are entitled to a solid educational foundation with access to appropriate levels of academic rigor<\/li>\n<li>All students K-12 should be able to access the social\/emotional support services needed for their success<\/li>\n<li>It is our responsibility to remove obstacles so that all students can achieve at high levels with the appropriate academic supports<\/li>\n<li>Our responsibility is to provide students with the necessary resources to achieve their individual goals<\/li>\n<\/ul>\n<h4>In meeting the need for lifetime skills<\/h4>\n<ul>\n<li>All students should have access to explore career pathways by the time they graduate.<\/li>\n<li>We should teach life skills as guided by the College &amp; Career Life Ready Framework.<\/li>\n<li>All students should be encouraged to pursue their interests<\/li>\n<\/ul>\n<h4>The community is vital to help guide students<\/h4>\n<ul>\n<li>Collaboration with all parties is the key to success.<\/li>\n<li>We need to bridge the gap between school and home.<\/li>\n<li>Each student should have an adult advocate.<\/li>\n<\/ul>\n<h4>Personalization is the key to a strong education<\/h4>\n<ul>\n<li>Students have their own unique learning styles and abilities.<\/li>\n<li>Each person has their own story and their differences should be acknowledged and respected.<\/li>\n<li>In the personal qualities of resilience, perseverance and determination.<\/li>\n<\/ul>\n<h4>In innovation and creativity<\/h4>\n<ul>\n<li>In utilizing data to uncover new opportunities for our students.<\/li>\n<li>Students should be self‐directed, creative, and inquisitive learners.<\/li>\n<\/ul>\n<h3>SSCSD School Counseling Vision<\/h3>\n<p>Saratoga Springs City School District graduates are prepared to enter the military, workforce or higher education. Graduates are resilient, empathetic<br \/>\nadvocates who act with integrity, and are productive, collaborative and motivated contributors to their communities<\/p>\n<h3>SSCSD School Counseling Mission<\/h3>\n<p>It is the mission of the school counseling program to provide the best possible education to every student to facilitate the growth and development of academic, personal, social and career readiness skills. Through the implementation of a comprehensive school counseling program, we will empower students to reach their full potential. Every student will be provided access to support services for individual student needs to foster high academic achievement, to promote lifelong learning and to encourage students to become responsible citizens.<\/p>\n<h3>The Saratoga Springs CSD Management System for a Comprehensive School Counseling Program<\/h3>\n<ul>\n<li>Piloting SCUTA software 2021-2022 school year<\/li>\n<\/ul>\n<h3>SSCSD School Counseling Advisory Structure<\/h3>\n<h4>District School Counseling Committee<\/h4>\n<ul>\n<li>Includes teachers, parents, students, counselors, community members, building administrators, trustees, social workers, and district administrators<\/li>\n<li>Helps provide structured feedback on the overall school counseling program<\/li>\n<\/ul>\n<h4>District Advisory Council<\/h4>\n<ul>\n<li>Includes administrators, teachers, counselors, social workers and psychologists<\/li>\n<li>Meets twice annually to discuss developing counseling initiatives<\/li>\n<\/ul>\n<h4>Building Counseling Committees<\/h4>\n<ul>\n<li>Includes counselors, social workers and administrators<\/li>\n<li>Meets monthly to discuss program<\/li>\n<li>Joint high school and middle school counseling meetings will be held annually<\/li>\n<\/ul>\n<h4>School Counseling Center Meetings<\/h4>\n<ul>\n<li>Weekly center meeting<\/li>\n<li>Updates on current programming<\/li>\n<li>Office logistics – Review Program Calendar<\/li>\n<li>Possible new initiatives<\/li>\n<\/ul>\n<h3>Role of the School Counselor<\/h3>\n<p>School Counselors design and deliver comprehensive school counseling programs that promote student achievement. These programs are comprehensive in scope, preventative in design and developmental in nature. (ASCA National Model 2012)<\/p>\n<p>School Counselors<\/p>\n<ul>\n<li>Must maintain their professional skills through P. D. &amp; recertification. (not only school counselors)<\/li>\n<li>The main role of a school counselor is to be a student advocate.<\/li>\n<li>The role of the counselor is to be an active participant in supporting students as they identify &amp; work to achieve their dreams.<\/li>\n<li>Counselor must stay informed &amp; consistent with student contact.<\/li>\n<li>Programs aligned with ASCA (personal\/social, academic, career).<\/li>\n<li>Educational reform requires school counselor involvement.<\/li>\n<li>Referrals to outside agencies.<\/li>\n<\/ul>\n<h2>The Saratoga Springs CSD Delivery Model for a Comprehensive School Counseling Program<\/h2>\n<h3>SSCSD Elementary Program (K-5)<\/h3>\n<p><strong>Second Step (SEL Curriculum), Continued Summer Curriculum Work 2020<\/strong><br \/>\nGrade Level: K-5<br \/>\nDomain: Academic core curriculum, Personal\/Social<br \/>\nDuration: September-June<br \/>\nStudents: 2100, All K-5 students<br \/>\nAssessment &amp; Evaluation Methods: Use of Second Step surveys, assessment materials, qualitative and quantitative data tracking.<br \/>\nStaff &amp; Resources: Social workers and classroom teachers; second step program resources.<\/p>\n<h3>SSCSD Middle School Program (6-8)<\/h3>\n<p><strong>Mandatory Development of Principal-Counselor Agreement<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic<br \/>\nDuration: September<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Departmental goals and objectives for the year.<br \/>\nStaff &amp; Resources: DH and Principal<\/p>\n<p><strong>504 Case Managers<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Annual meetings, initial eligibility, reviews, support of teachers and families.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Scheduling Changes\/Conflicts<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Addressing student needs through the student schedule builder.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Build Master Schedule<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: February-August<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Accurate schedules delivered to students and parents.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Master Schedule Consultation<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect Services<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Meet with stakeholders about potential program changes.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Second Step Homebase (Social\/Emotional Curriculum)<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Improved attendance and behavior in the building. Less referrals.<br \/>\nStaff &amp; Resources: Staff<\/p>\n<p><strong>New Family Orientation<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: August<br \/>\nStudents: 150<br \/>\nAssessment &amp; Evaluation Methods: Survey results<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>School walk throughs<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: August<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Students\/parents feel more comfortable with transition to Middle School<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Sixth Grade House Presentation<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Academic, Career<br \/>\nDuration: September<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Students become aware of school rules, introduction to school counselors and school expectations.<br \/>\nStaff &amp; Resources: Principals, Counselors, Teachers, Support Staff<\/p>\n<p><strong>Naviance Classroom Lessons<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Career<br \/>\nDuration: September &amp; January<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Strengths Explorer Assessment and complete a SMART goal<br \/>\nStaff &amp; Resources: Counselors<\/p>\n<p><strong>Open House<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: NA<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Sixth Grade Individual Annual Meetings<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September-October<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Review individual survey results, discuss transition to middle school, the role of the counselor and how to access services.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Naviance Classroom Lessons<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Career<br \/>\nDuration: October<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Road Trip Nation Activity and Survey<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Seventh Grade Individual Annual Meetings<br \/>\n<\/strong>Grade Level: 7<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: November-January<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Review survey results, academics and support students personal\/social\/emotional<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>High School Program of Studies Review<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September-October<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: NA<br \/>\nStaff &amp; Resources: Department Heads, Counselors, Administrators<\/p>\n<p><strong>Naviance Classroom Lessons<br \/>\n<\/strong>Grade Level: 7<br \/>\nDomain: Career<br \/>\nDuration: November<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Holland&#8217;s Codes and Career Key<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>First Quarter Grade Reporting<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect Services<br \/>\nDuration: November<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Review all report cards and examine for errors and inconsistencies<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Reviews- 1st Quarter<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career<br \/>\nDuration: November<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Meet with students that are failing and provide supports to improve success in the classroom<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Transition Event (At High School)<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career<br \/>\nDuration: January<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: NA<br \/>\nStaff &amp; Resources: Counselors<\/p>\n<p><strong>Mental Health and Suicide Awareness Lessons<br \/>\n<\/strong>Grade Level: 7<br \/>\nDomain: Personal\/Social<br \/>\nDuration: January<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: In Health classes<br \/>\nStaff &amp; Resources: Counselors, psychologists, Health Teachers and Administrators<\/p>\n<p><strong>High School Transition Program of Studies Classroom Presentation<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-February<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Selecting elective courses and educating on graduation requirements<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Second Quarter Grade Reporting<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect Services<br \/>\nDuration: January<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Review all report cards and examine for errors and inconsistencies<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Reviews &#8211; 2nd Quarter<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic<br \/>\nDuration: January-February<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Meet with students that are failing and provide supports to improve success in the classroom<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Eighth Grade Individual Annual Meetings<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: February-May<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Review course selections and prepare for the transition to the high school. Career goals and fears about the future.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Program Recruitment<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-April<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: PTECH\/SPRING\/BOCES- Identifying students that meet the criteria and are good candidates for the program. Application support.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Third Quarter Reporting<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect Services<br \/>\nDuration: April<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Review all report cards and examine for errors and inconsistencies<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Reviews- 3rd Quarter<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic<br \/>\nDuration: April-May<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Meet with students that are failing and provide supports to improve success in the classroom.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Student Orientations- Grade 5 to Grade 6<br \/>\n<\/strong>Grade Level: 5<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: April-May<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Students become aware of Middle School, get tours, video, student panel and get questions answered.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Elementary to Middle School transition meetings with teachers and counselors<br \/>\n<\/strong>Grade Level: 5<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: June<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Conversations with 5th grade teachers\/staff to support student needs in the transition to Middle School<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Fifth Grade Parent Orientation<br \/>\n<\/strong>Grade Level: 5<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: June<br \/>\nStudents: 500<br \/>\nAssessment &amp; Evaluation Methods: Parents become familiar with Middle School philosophy\/curriculum\/expectations<br \/>\nStaff &amp; Resources: Counselors, Principals, Teachers<\/p>\n<p><strong>Fourth Quarter Grade Reporting<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect Services<br \/>\nDuration: June<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Review all report cards and examine for errors and inconsistencies<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Review &amp; Promotion\/Retention\/Summer School Conversations<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: June-July<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Meet with students that are failing and provide supports to improve success in the classroom<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>New Student Registration Meetings &amp; Placements<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: June-August<br \/>\nStudents: 75<br \/>\nAssessment &amp; Evaluation Methods: Discuss transition planning and academic advising upon enrollment. Assist students with academic planning.<br \/>\nStaff &amp; Resources: Counselors<\/p>\n<p><strong>New Student Registration Meetings &amp; Placements<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 75<br \/>\nAssessment &amp; Evaluation Methods: Discuss transition planning and academic advising upon enrollment. Assist students with academic planning.<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Individual follow-up meetings with new students<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 150<br \/>\nAssessment &amp; Evaluation Methods: Students&#8217; academic and social progress are monitored and communicated to home<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic counseling for struggling students<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Improvement of student success<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Individual Counseling<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Improve student success academically, socially and behaviorally<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Crisis Counseling<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Student is deescalated and returned to routine as soon as possible<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Group Counseling<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: October-May<br \/>\nStudents: 15<br \/>\nAssessment &amp; Evaluation Methods: Improved student success academically, socially and behaviorally<br \/>\nStaff &amp; Resources: Counselors<\/p>\n<p><strong>Weekly Building Committee Meetings with Principals and Psychologists<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: NA<br \/>\nAssessment &amp; Evaluation Methods: Collaboration between stakeholders<br \/>\nStaff &amp; Resources: Counselors, Psychologists, Social Worker, Principals, Parsons<\/p>\n<p><strong>Child Protective Services<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 80-100<br \/>\nAssessment &amp; Evaluation Methods: Student safety is addressed<br \/>\nStaff &amp; Resources: Counselors, Psychologists and Social Workers<\/p>\n<p><strong>IST Meetings<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 80-100<br \/>\nAssessment &amp; Evaluation Methods: Instructional Support Team to address student concerns and needs<br \/>\nStaff &amp; Resources: Counselors, Teachers, Principal, Psychologist<\/p>\n<p><strong>Parent Conferences<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 225<br \/>\nAssessment &amp; Evaluation Methods: Improved parent participation\/investment, collaboration between all stakeholders<br \/>\nStaff &amp; Resources: Counselors, Teachers, Principals<\/p>\n<p><strong>Team Meetings<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Student success is evaluated and supported; collaboration between stakeholders<br \/>\nStaff &amp; Resources: Counselors, Teachers, Principals<\/p>\n<p><strong>Letters of Recommendation<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 25<br \/>\nAssessment &amp; Evaluation Methods: NA<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>School Counseling Committee<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Monthly<br \/>\nStudents: District<br \/>\nAssessment &amp; Evaluation Methods: Aligning our program with New York State and ASCA standards<br \/>\nStaff &amp; Resources: Counselors, Principals, Teachers, Social Worker<\/p>\n<p><strong>School Counseling Department Meeting<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Weekly<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>School Crisis Team: Building Emergency Response Team<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect<br \/>\nDuration: Monthly<br \/>\nStudents: District<br \/>\nStaff &amp; Resources: Counselors, Teachers, Principals, Psychologists<\/p>\n<p><strong>Advisory Council<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Monthly<br \/>\nStudents: District<br \/>\nStaff &amp; Resources: Counselors, Principals, Teachers, Social Worker<\/p>\n<p><strong>Report Review- Attendance and Behavior<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Weekly<br \/>\nStudents: 1458<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Consultation Services<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Referrals to outside agencies<br \/>\nStaff &amp; Resources: Counselors, Psychologists, Social Workers<\/p>\n<p><strong>Peer Mentoring<br \/>\n<\/strong>Grade Level: 6<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 50<br \/>\nStaff &amp; Resources: Counselors and Teachers<\/p>\n<p><strong>High School Course Selections<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-April<br \/>\nStudents: 500<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Proctoring<br \/>\n<\/strong>Grade Level: All<br \/>\nDomain: Indirect<br \/>\nDuration: April-June<br \/>\nStudents: 1458<br \/>\nAssessment &amp; Evaluation Methods: Math, ELA and Regents exams- Makeup days<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<h2>SSCSD High School Program (9-12)<\/h2>\n<p><strong>Mandatory Development of Principal-Counselor Agreement<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: 2200<br \/>\nAssessment &amp; Evaluation Methods: School Counseling Calendar<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>Resolve scheduling conflicts and balance classes for upcoming school year<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic<br \/>\nDuration: June-August<br \/>\nStudents: 2200<br \/>\nAssessment &amp; Evaluation Methods: Balance classes; Al students have accurate schedules<br \/>\nStaff &amp; Resources: All Counselors, SchoolTool<\/p>\n<p><strong>New Student Registration and Scheduling: Meet with family, transcript review and input and schedule creation<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 70-100<br \/>\nAssessment &amp; Evaluation Methods: Students start school as soon as possible with an appropriate schedule<br \/>\nStaff &amp; Resources: All Counselors, SchoolTool<\/p>\n<p><strong>New Student\/Parent Follow-up<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Within the first 2 weeks of the start date<br \/>\nStudents: 70-100<br \/>\nAssessment &amp; Evaluation Methods: Student&#8217;s academic and social progress are monitored; new student successfully transitions to Saratoga<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Freshman\/New Student Orientation<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: August<br \/>\nStudents: 600<br \/>\nAssessment &amp; Evaluation Methods: Students become aware of school rules, support services, graduation requirements and introduced to counselors and administration<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>School Walk Through<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: August<br \/>\nStudents: 2200<br \/>\nAssessment &amp; Evaluation Methods: Students have familiarity with building and are prepared for transition to HS<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>Early College Application Workshop<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic, Career<br \/>\nDuration: August<br \/>\nStudents: 80-120<br \/>\nAssessment &amp; Evaluation Methods: Students understand process and begin completion of college applications<br \/>\nStaff &amp; Resources: Counselors; Naviance and Common App<\/p>\n<p><strong>Open House<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September<br \/>\nStudents: 2200<br \/>\nAssessment &amp; Evaluation Methods: Counselors are available to parents to answer questions<br \/>\nStaff &amp; Resources: Counselors, Teachers and Administration<\/p>\n<p><strong>College Fair: presented by CASDA<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Career<br \/>\nDuration: September<br \/>\nStudents: 250-500<br \/>\nAssessment &amp; Evaluation Methods: Students are informed of various colleges and programs; Attendance count<br \/>\nStaff &amp; Resources: CASDA and College admissions reps<\/p>\n<p><strong>9th Grade Transition Meetings<br \/>\n<\/strong>Grade Level: 9<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: September-October<br \/>\nStudents: 550<br \/>\nAssessment &amp; Evaluation Methods: HS Counselors check-in with freshman and explain role; student sign-in sheets<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Senior College and Career Conferences: Individual meetings with students (and parents)<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September-November<br \/>\nStudents: 500-550<br \/>\nAssessment &amp; Evaluation Methods: Students will have clear plan for life after HS (i.e. workforce, college, military); Naviance usage data; Student Perspective completion<br \/>\nStaff &amp; Resources: All Counselors; Naviance<\/p>\n<p><strong>FAFSA Financial Aid Night<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic, Career<br \/>\nDuration: October<br \/>\nStudents: 300<br \/>\nAssessment &amp; Evaluation Methods: Students and parents will gain knowledge of financial aid process; FAFSA completion data<br \/>\nStaff &amp; Resources: Counselors, Guest Speaker<\/p>\n<p><strong>HESC Workshops<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic, Career<br \/>\nDuration: October<br \/>\nStudents: 50-100<br \/>\nAssessment &amp; Evaluation Methods: Students and parents will begin and\/or complete the FAFSA; FAFSA completion data<br \/>\nStaff &amp; Resources: Counselors, HESC Financial Aid Specialists<\/p>\n<p><strong>ASVAB: Test administration and follow-up educational outreach<br \/>\n<\/strong>Grade Level: 10-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: October<br \/>\nStudents: 20-30<br \/>\nAssessment &amp; Evaluation Methods: Students have access to standardized testing to further military options; Number of test registrants<br \/>\nStaff &amp; Resources: Counselors and proctors<\/p>\n<p><strong>College Visits<br \/>\n<\/strong>Grade Level: 11-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: September-December<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will make direct contact with college admissions representatives and gain insight into various college offerings; College Profile Sheets<br \/>\nStaff &amp; Resources: Naviance College Visit Sign-ups<\/p>\n<p><strong>HS Program of Studies\/Course Guide<br \/>\n<\/strong>Grade Level: 8-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: September-December<br \/>\nStudents: 2000-2200<br \/>\nAssessment &amp; Evaluation Methods: Students and families have access to accurate and detailed information about HS course offerings and programs; Distribution of Program of Studies<br \/>\nStaff &amp; Resources: Counselors, teachers and administration<\/p>\n<p><strong>Naviance Lesson: Career Interest Profiler and Resume<br \/>\n<\/strong>Grade Level: 9<br \/>\nDomain: Academic, Career<br \/>\nDuration: December<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will recognize careers and work activities that match their interest; Completion of Career Interest Profiler and development of Student Resume<br \/>\nStaff &amp; Resources: All Counselors, Naviance<\/p>\n<p><strong>Naviance Lesson: Cluster Finder and Do What You Are<br \/>\n<\/strong>Grade Level: 10<br \/>\nDomain: Academic, Career<br \/>\nDuration: December<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will connect interests to career fields and begin to identify plan for life after HS; Completion of Do What You Are and Cluster Finder survey<br \/>\nStaff &amp; Resources: All Counselors; Naviance<\/p>\n<p><strong>Naviance Lesson: College Classroom presentation<br \/>\n<\/strong>Grade Level: 11<br \/>\nDomain: Academic, Career<br \/>\nDuration: December<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will understand how to utilize Naviance college search features; College Search saved; Colleges I&#8217;m Thinking About list saved<br \/>\nStaff &amp; Resources: All Counselors; Naviance<\/p>\n<p><strong>9th and 10th Grade Conferences: individual planning meetings<br \/>\n<\/strong>Grade Level: 9-10<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: January-April<br \/>\nStudents: 1000-2000<br \/>\nAssessment &amp; Evaluation Methods: Completion of HS Career Plan; Course selection entered into SchoolTool<br \/>\nStaff &amp; Resources: All Counselors; SchoolTool<\/p>\n<p><strong>High School Transition Night and Maple Ave. Classroom Visits<br \/>\n<\/strong>Grade Level: 8<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: January<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: 8th grade students and parents will gain information on transition to HS and review of course offerings; Distribution of HS Course Guides<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>Master Schedule<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: January-July<br \/>\nStudents: 2000-2200<br \/>\nAssessment &amp; Evaluation Methods: Students have access to schedule that meets academic needs and provides opportunities to explore career\/personal interests, Master Schedule in SchoolTool<br \/>\nStaff &amp; Resources: Counselors and Administration; SchoolTool<\/p>\n<p><strong>SUNY Adirondack ECCA and BOCES CTE Student Visits<br \/>\n<\/strong>Grade Level: 10<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-March<br \/>\nStudents: 60-100<br \/>\nAssessment &amp; Evaluation Methods: Students will explore program opportunities at Myers Center and SUNY Adirondack; BOCES and ECCA applications completed<br \/>\nStaff &amp; Resources: Counselors<\/p>\n<p><strong>College Planning Night: presented by representatives from College Admissions and Financial Aid offices<br \/>\n<\/strong>Grade Level: 10<br \/>\nDomain: Academic, Career<br \/>\nDuration: January<br \/>\nStudents: 500-1000<br \/>\nAssessment &amp; Evaluation Methods: Parents and students will become informed on college admissions and how to proceed with college\/career plans; Survey<br \/>\nStaff &amp; Resources: Counselors; College Admissions Reps; Financial Aid experts<\/p>\n<p><strong>Junior Conferences: : Individual meetings with students and families to discuss college and career options, current academic progress, and remaining HS requirements<br \/>\n<\/strong>Grade Level: 11<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-March<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will have necessary information to begin\/continue college and career search process; Distribution of transcripts and Junior\/Senior packet; completion of Parent Perspective <br \/>\nStaff &amp; Resources: All Counselors; Naviance; SchoolTool<\/p>\n<p><strong>Scholarships\/Awards<br \/>\n<\/strong>Grade Level: 11-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: January-May<br \/>\nStudents: 500-1100<br \/>\nAssessment &amp; Evaluation Methods: Students are aware of and apply for various scholarships and awards; Scholarship applications submitted<br \/>\nStaff &amp; Resources: All Counselors; Naviance; Counseling Board<\/p>\n<p><strong>High School Awards Night<br \/>\n<\/strong>Grade Level: 11-12<br \/>\nDomain: Academic<br \/>\nDuration: May<br \/>\nStudents: 250-300<br \/>\nAssessment &amp; Evaluation Methods: Students are recognized by colleges, school and community for their achievements; Distribution of scholarships and awards<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>Naviance Lesson: Senior Exit and Graduation Surveys<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic, Career<br \/>\nDuration: May-June<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Students will update post HS plans and results of college applications; completion of Senior Exit and Graduation Surveys<br \/>\nStaff &amp; Resources: All Counselors; Naviance<\/p>\n<p><strong>Graduation<br \/>\n<\/strong>Grade Level: 12<br \/>\nDomain: Academic<br \/>\nDuration: June<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Distribution of HS diploma<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Summer School: mailing, registration, completion and commencement<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic<br \/>\nDuration: June-August<br \/>\nStudents: 100-200<br \/>\nAssessment &amp; Evaluation Methods: Parents and students will receive information regarding failed courses and summer school registration; SchoolTool enrollment, exam scores, report cards and updated HS transcripts<br \/>\nStaff &amp; Resources: All Counselors; SchoolTool; Regents exam scores<\/p>\n<p><strong>Individual Counseling<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Improve student success academically, socially, behaviorally, and emotionally; Student sign-in sheet<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Crisis Counseling\/Counselor on Duty<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Responsive, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Student is deescalated and returned to academic program as soon as possible; Counselor on duty log<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Counseling for struggling students<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Quarterly<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Improvement of student success; Failing courses list; Report cards; attendance and discipline records<br \/>\nStaff &amp; Resources: All Counselors; SchoolTool<\/p>\n<p><strong>Schedule Adjustments\/Level Changes<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Schedule changes will be made to support student need and opportunity; Number of approved Change\/Drop Forms<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Advisory<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 10-40<br \/>\nAssessment &amp; Evaluation Methods: At-risk students are provided daily support to improve academic\/personal success; Daily student log, progress reports, report cards and lesson plans<br \/>\nStaff &amp; Resources: Teaching Assistant<\/p>\n<p><strong>Student Ambassador Program<br \/>\n<\/strong>Grade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 70-100<br \/>\nAssessment &amp; Evaluation Methods: New student registrants receive support from current student mentors; Student Ambassador sign-up list<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p>&nbsp;<\/p>\n<p><strong>Home Tutoring and District Tutoring Center Facilitation<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: As needed<br \/>\nStudents: 40-60<br \/>\nAssessment &amp; Evaluation Methods: Students have access to academic supports to foster success; Collaboration with teachers and tutors regarding work; Attendance reports<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Academic Intervention Services<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: August-June<br \/>\nStudents: 550-650<br \/>\nAssessment &amp; Evaluation Methods: Students are identified and given support to improve skills in ELA and Math; enrollment in AIS classes<br \/>\nStaff &amp; Resources: All counselors; Student data, NYS test scores, course grades, teacher recommendations<\/p>\n<p><strong>504 Plan: Referrals, intakes, implementation, annual reviews, and case management<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: September-June<br \/>\nStudents: 100-150<br \/>\nAssessment &amp; Evaluation Methods: Students are provided with the supports and resources needed to be successful; 504 plan, meeting notes, and teacher feedback forms<br \/>\nStaff &amp; Resources: All Counselors; IEP direct<\/p>\n<p><strong>CSE\/IEP: Referrals, intakes, program reviews, and annual reviews<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: September-June<br \/>\nStudents: 200-300<br \/>\nAssessment &amp; Evaluation Methods: Students are placed in appropriate program with accommodations that will foster their academic success; IEP, meeting notes\/minutes, academic records<br \/>\nStaff &amp; Resources: All Counselors; IEP direct<\/p>\n<p><strong>Counseling Department Meetings<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: September-June (1x Weekly)<br \/>\nStudents: 2000-2200<br \/>\nAssessment &amp; Evaluation Methods: Counselors are informed and updated on current programs, upcoming events, and building changes; Meeting agenda and minutes<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Student Support Team (SST) Meetings<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: September-June (1x Weekly)<br \/>\nStudents: 200-300<br \/>\nAssessment &amp; Evaluation Methods: Collaboration between administration and counselors to review at-risk\/high needs students; Student Data Log<br \/>\nStaff &amp; Resources: Counselors and Administration<\/p>\n<p><strong>College Testing: SAT, ACT, and PSAT organization, registration and administration<\/strong><br \/>\nGrade Level: 10-12<br \/>\nDomain: Indirect<br \/>\nDuration: September-June<br \/>\nStudents: 1000<br \/>\nAssessment &amp; Evaluation Methods: Students have access to standardized testing needed to further college options; Number of test registrants<br \/>\nStaff &amp; Resources: Counselors and proctors; CollegeBoard and ACT<\/p>\n<p><strong>Advanced Placement Program Coordination: Student enrollment, test facilitation and administration<\/strong><br \/>\nGrade Level: 10-12<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: 600-800<br \/>\nAssessment &amp; Evaluation Methods: Students have access to rigorous, college level coursework; AP course enrollment and AP test results<br \/>\nStaff &amp; Resources: Counselors, teachers, and sub proctors<\/p>\n<p><strong>NCAA Coordination: Updating and maintaining course eligibility for college athletics<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: 40-70<br \/>\nAssessment &amp; Evaluation Methods: Students are aware of NCAA eligibility requirements for college athletics; NCAA Clearinghouse registration<br \/>\nStaff &amp; Resources: All Counselors; NCAA Eligibility Center<\/p>\n<p><strong>BOCES Liaison: Collaboration with WSWHE BOCES CTE counselors, program placement and inputting of program grades<\/strong><br \/>\nGrade Level: 11-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 125-150<br \/>\nAssessment &amp; Evaluation Methods: Students are provided with opportunities to earn certification in CTE programs; BOCES enrollment and report cards<br \/>\nStaff &amp; Resources: All Counselors; SchoolTool<\/p>\n<p><strong>HVCC and ECCA Coordination: Collaboration with Ballston Spa, HVCC, BOCES and SUNY Adirondack for early college programs<\/strong><br \/>\nGrade Level: 8-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: September-June<br \/>\nStudents: 20-60<br \/>\nAssessment &amp; Evaluation Methods: Students have access to college level programs; HVCC and ECCA application completion and enrollment<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Tutor Coordination<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic<br \/>\nDuration: Ongoing<br \/>\nStudents: N\/A<br \/>\nAssessment &amp; Evaluation Methods: Students have access to academic support<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>Out of District SE: Maintenance of documentation for students who are placed outside of district<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: 10-25<br \/>\nAssessment &amp; Evaluation Methods: Students are provided with appropriate school programs and services; IEP, transcripts and report cards<br \/>\nStaff &amp; Resources: All Counselors; IEP direct and SchoolTool<\/p>\n<p><strong>Consultation Services<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social, Career<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Referrals to outside agencies<br \/>\nStaff &amp; Resources: Counselors, Psychologists, and Social Workers<\/p>\n<p><strong>Child Protective Services<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: Student safety is addressed<br \/>\nStaff &amp; Resources: Counselors, Psychologists and Social Workers<\/p>\n<p><strong>Documentation and Cumulative Record Maintenance: including grade changes, credits earned, and other documentation<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: An accurate and comprehensive student file will be maintained for current progress, future reference and\/or evaluation; Completed grade change forms, college or other HS transcripts<br \/>\nStaff &amp; Resources: All Counselors; Cumulative record and SchoolTool<\/p>\n<p><strong>Communication with parents and parent conferences<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Career, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: As needed<br \/>\nAssessment &amp; Evaluation Methods: <br \/>\nStaff &amp; Resources: Provide information and support to students and parents; Email records, phone log, and appointment\/calendar<\/p>\n<p><strong>Letters of Recommendation<\/strong><br \/>\nGrade Level: 9-12<br \/>\nDomain: Academic, Personal\/Social<br \/>\nDuration: Ongoing<br \/>\nStudents: 500-600<br \/>\nAssessment &amp; Evaluation Methods: Counselors write and submit recommendation letters for colleges, scholarships, academic programs, etc.; Number of letters uploaded to Naviance<br \/>\nStaff &amp; Resources: All Counselors<\/p>\n<p><strong>School Crisis Team: Building Emergency Response Team<\/strong><br \/>\nGrade Level: All<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: N\/A<br \/>\nAssessment &amp; Evaluation Methods: N\/A<br \/>\nStaff &amp; Resources: Counselors, Teachers, Principals, Psychologists<\/p>\n<p><strong>Advisory Council<\/strong><br \/>\nGrade Level: All<br \/>\nDomain: Indirect<br \/>\nDuration: Ongoing<br \/>\nStudents: N\/A<br \/>\nAssessment &amp; Evaluation Methods: Stakeholders will review counseling plan<br \/>\nand discuss areas in need of improvement; meeting notes and presentation<br \/>\nStaff &amp; Resources: Counselors, Principals, Teachers, Social Worker<\/p>\n<h3>Comprehensive School Counseling Calendar: K-12<\/h3>\n<h4>Maple Ave: Annual Calendar<\/h4>\n<p>Month: July\/Aug.<br \/>\nCore Curriculum: Walkthrough (6-8)<br \/>\nIndividual Planning: New Student Registration, AIS Programming<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Referrals &amp; Collaboration (outside agencies, counselors, administration, etc.); Master Schedule<br \/>\nProgram Planning and School Support: Curriculum Writing, Scheduling Conflicts<\/p>\n<p>Month: Sept.<br \/>\nCore Curriculum: Open House (6-8), Naviance Career Lesson (8), SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (6); New Student Registration<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings (504, IEP, SST, Faculty, Department, Parent\/Teacher, etc.)<\/p>\n<p>Month: Oct.<br \/>\nCore Curriculum: Career Jam Field Trip, Naviance Career Lesson (6), SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (6)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting, PSAT Test Administration<\/p>\n<p>Month: Nov.<br \/>\nCore Curriculum: Naviance Career Lesson (7), SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (6)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: Advisory Council<\/p>\n<p>Month: Dec.<br \/>\nCore Curriculum: Parochial School Presentation<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: Jan.<br \/>\nCore Curriculum: Mental Health Awareness (7), 8th Grade Transition (8), SEL Second Step<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: Feb.<br \/>\nCore Curriculum: Naviance Career Lesson (8), SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (8)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: March<br \/>\nCore Curriculum: SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (8)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: April<br \/>\nCore Curriculum: BOCES Field Trip, SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (7)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<br \/>\nProgram Planning and School Support: Advisory Council, Test Proctoring<\/p>\n<p>Month: May<br \/>\nCore Curriculum: Elementary Transition Program (5), SEL Second Step<br \/>\nIndividual Planning: Annual Progress Review (7)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting, AP Test Administration<\/p>\n<p>Month: June<br \/>\nCore Curriculum: 5th to 6th Parent Night<br \/>\nIndividual Planning: New Student Registration<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<\/p>\n<h4>SSHS: Annual Calendar<\/h4>\n<p>Month: July\/Aug.<br \/>\nCore Curriculum: Freshman Orientation (9), College Application Workshop (12), Walkthrough (9-12)<br \/>\nIndividual Planning: New Student Registration, AIS Programming<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration (outside agencies, counselors, administration, etc.); Master Schedule<br \/>\nProgram Planning and School Support: Curriculum Writing, Schedule\/Conflicts<\/p>\n<p>Month: Sept.<br \/>\nCore Curriculum: Open House (9-12), College Fair (11-12)<br \/>\nIndividual Planning: Annual Progress Review (12), New Student Registration<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings (504, IEP, SST, Faculty, Department, Parent\/Teacher, etc.); Referrals &amp; Collaboration<\/p>\n<p>Month: Oct.<br \/>\nCore Curriculum: Financial Aid Night, HESC-FAFSA Completion Workshop, ASVAB<br \/>\nIndividual Planning: Annual Progress Review (12)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting, PSAT Test Administration<\/p>\n<p>Month: Nov.<br \/>\nIndividual Planning: Annual Progress Review (12)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: Advisory Council<\/p>\n<p>Month: Dec.<br \/>\nCore Curriculum: Naviance Career Lessons (9-10)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: Jan.<br \/>\nCore Curriculum: Transition Night (8), 8th Grade HS Visitations (8), College Planning Night (10-12)<br \/>\nIndividual Planning: Annual Progress Review (10)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: Feb.<br \/>\nIndividual Planning: Annual Progress Review (10,11)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: March<br \/>\nIndividual Planning: Annual Progress Review (11, 9)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting<\/p>\n<p>Month: April<br \/>\nIndividual Planning: Annual Progress Review (9)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<br \/>\nProgram Planning and School Support: Advisory Council<\/p>\n<p>Month: May<br \/>\nCore Curriculum: Award Ceremony (10-12)<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<br \/>\nProgram Planning and School Support: SSCSD Counseling Meeting, AP Test Administration<\/p>\n<p>Month: June<br \/>\nCore Curriculum: Graduation<br \/>\nResponsive Services: Individual Counseling, Crisis Counseling<br \/>\nReferrals\/Collaboration: Meetings, Referrals &amp; Collaboration, Master Schedule<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Saratoga Springs City School District K – 12 School Counseling Plan 2021 – 2022 Introduction The Saratoga Springs City School District developed this comprehensive school counseling plan based on the district vision statement, “Pathways.” This document is a statement of where we believe our district should be in the future. The SSCSD School Counseling Committee &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;K-12 Counseling Plan&#8221;<\/span><\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":40,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-669","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>K-12 Counseling Plan - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"K-12 Counseling Plan - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Saratoga Springs City School District K – 12 School Counseling Plan 2021 – 2022 Introduction The Saratoga Springs City School District developed this comprehensive school counseling plan based on the district vision statement, “Pathways.” This document is a statement of where we believe our district should be in the future. The SSCSD School Counseling Committee &hellip; Continue reading &quot;K-12 Counseling Plan&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2022-03-08T20:02:15+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"29 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\",\"url\":\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\",\"name\":\"K-12 Counseling Plan - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-01-14T15:49:23+00:00\",\"dateModified\":\"2022-03-08T20:02:15+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Departments &#038; Services\",\"item\":\"https:\/\/www.saratogaschools.org\/departments-services\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Counseling Services\",\"item\":\"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"K-12 Counseling Plan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"K-12 Counseling Plan - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/","og_locale":"en_US","og_type":"article","og_title":"K-12 Counseling Plan - Saratoga City School District","og_description":"Saratoga Springs City School District K – 12 School Counseling Plan 2021 – 2022 Introduction The Saratoga Springs City School District developed this comprehensive school counseling plan based on the district vision statement, “Pathways.” This document is a statement of where we believe our district should be in the future. The SSCSD School Counseling Committee &hellip; Continue reading \"K-12 Counseling Plan\"","og_url":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/","og_site_name":"Saratoga City School District","article_modified_time":"2022-03-08T20:02:15+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"29 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/","url":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/","name":"K-12 Counseling Plan - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-01-14T15:49:23+00:00","dateModified":"2022-03-08T20:02:15+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/k-12-counseling-plan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Departments &#038; Services","item":"https:\/\/www.saratogaschools.org\/departments-services\/"},{"@type":"ListItem","position":3,"name":"Counseling Services","item":"https:\/\/www.saratogaschools.org\/departments-services\/counseling-services\/"},{"@type":"ListItem","position":4,"name":"K-12 Counseling Plan"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/669","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=669"}],"version-history":[{"count":6,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/669\/revisions"}],"predecessor-version":[{"id":1196,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/669\/revisions\/1196"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/40"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=669"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}