{"id":691,"date":"2022-01-14T12:45:10","date_gmt":"2022-01-14T17:45:10","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=691"},"modified":"2025-08-28T11:16:43","modified_gmt":"2025-08-28T15:16:43","slug":"information-technology-plan","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/","title":{"rendered":"Information Technology Plan"},"content":{"rendered":"<p><a href=\"#missionstatement\" title=\"District Mission Statement\">District Mission Statement<\/a> | <a href=\"#visionstatement\" title=\"Pathways Vision Statement\">Vision Statement <\/a>| <a href=\"#planningprocess\">Planning Process<\/a> | <a href=\"#goalattainment\">Goal Attainment<\/a> | <a href=\"#actionplan\">Action Plan&amp; Goals<\/a> <a href=\"#planningprocess\">|<\/a> <a href=\"#nysed\">NYSED Initiatives Alignment<\/a> |<\/p>\n<h2>Saratoga Springs City School District Information Technology Plan 2022-2025<\/h2>\n<h3><a id=\"missionstatement\"><\/a>District Mission Statement<\/h3>\n<p>The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future. Our Pathways vision will help guide the important work of the school district and ultimately help shape our student’s future success.<\/p>\n<h3><a id=\"visionstatement\"><\/a>Vision Statement for guiding instructional technology use in the district:<\/h3>\n<p>Creating bridges between individuals and the world. Providing opportunities for greater success through:<\/p>\n<ol>\n<li>Evaluation of changing trends in technology and enriched academic experiences<\/li>\n<li>Application of technology to support greater student achievement<\/li>\n<li>Identification and implementation of technologies that will enhance learning<\/li>\n<li>Cultivation of a skill set targeting future success<\/li>\n<li>Development of a sound foundation of ethics and digital citizenship<\/li>\n<li>Establishment and maintenance of relationships in the global community<\/li>\n<\/ol>\n<h3><a id=\"committeemembers\"><\/a><span>Instructional Technology Plan Contributors<\/span><\/h3>\n<p><strong>Groups <span>Contributing to SSCSD Tech Plan<\/span>:<\/strong><\/p>\n<ul>\n<li>HS Technology Integration <span style=\"font-size: 1rem;\">Leadership Team (TILT)<\/span><\/li>\n<li><span style=\"font-size: 1rem;\">MS Technology Integration Leadership Team (TILT) <\/span><\/li>\n<li><span style=\"font-size: 1rem;\">Elementary Technology Integration Leadership Team (TILT)<\/span><\/li>\n<li>Curriculum Council<\/li>\n<li><span style=\"font-size: 1rem;\">Leadership Council<\/span><\/li>\n<li><span style=\"font-size: 1rem;\">Elementary Educational Technology Leaders &amp; Instructional Technologists<\/span><\/li>\n<\/ul>\n<p><strong>Specific Members Contributing to SSCSD Tech Plan:<\/strong><\/p>\n<ul>\n<li>Abigail Adams-Snell<\/li>\n<li>David Ashdown<\/li>\n<li>Kendra Astemborski<\/li>\n<li>Erin Bell<\/li>\n<li>Derek Bull<\/li>\n<li>Lisa Cutting<\/li>\n<li>Amanda Davey<\/li>\n<li>Tina Davis<\/li>\n<li>John DeLeo<\/li>\n<li><span>Jennifer Eversole<\/span><\/li>\n<li><span>Dawn Getman<\/span><\/li>\n<li><span>Laurie Guyon<\/span><\/li>\n<li><span>Mary Alice Hipwell <\/span><\/li>\n<li><span>Wendi Kerls<\/span><\/li>\n<li><span>David L’Hommedieu<\/span><\/li>\n<li>Lucas Manny<\/li>\n<li><span>Stacey Moulton<\/span><\/li>\n<li><span>Lisa Quinn<\/span><\/li>\n<li>Scott Singer<\/li>\n<li>Jennifer Steimle<\/li>\n<li>Erika Ture<\/li>\n<li>Jody Visconti<\/li>\n<li>Ryan Warner<\/li>\n<li>Stephanie Weaver<\/li>\n<\/ul>\n<h3><a id=\"planningprocess\"><\/a>Planning Process for the Instructional Technology Plan<\/h3>\n<p>The 2022-25 Instructional Technology Plan was created with input from a variety of Stakeholders throughout the District. These included teachers and administrators from elementary, middle and high school. We also gathered feedback from the Curriculum Council, Leadership Council, and individual staff in the areas of special education, ENL, and with our homeless liaison.<\/p>\n<ul>\n<li>Our first meeting was in December of 2021. We have met multiple times including other meeting individuals listed above.<\/li>\n<li>On December 21, 2021, the Mixed Technology Leadership Team met at BOCES to begin the process of building a Tech Plan.<\/li>\n<li>On January 13, 2022, the same team met to start the Tech Plan and create a frame for a big group to review.<\/li>\n<li>On March 3, 2022, at the Curriculum Council, we presented the plan to the group and gave location for feedback.<\/li>\n<li>On March 18, 2022, at the Leadership Council, we presented the plan to the group to obtain feedback.<\/li>\n<li>We presented the plan to the following TILT groups to obtain feedback:<\/li>\n<li>March 22, 2022 – Elementary Technology Integration Leadership Team<\/li>\n<li>March 23, 2022 – High School Technology Integration Leadership Team<\/li>\n<li>March 29, 2022 – Middle School Technology Integration Leadership Team<\/li>\n<\/ul>\n<h3>Relation to the Previous Three-year Plan<\/h3>\n<p>In previous years we had a District Technology Steering Committee composed of stakeholders across the district that would meet monthly. The district currently has Technology Integration Leadership Teams at all three levels(elementary, middle, and high school.) We developed a Technology Plan Team utilizing members from all three groups. We also gathered feedback from the Curriculum Council, Leadership Council, and individual staff in the areas of special education, ENL, and homelessness.<\/p>\n<p>Committees identified that goal work was not completed from the previous plan and that new goals needed to be more integrated into curriculum. The plan has two goals (one and two) that follow up on previous plan goals one and two. All students will become Empowered Learners (previous goal one) and All Students will demonstrate and practice appropriate Digital Citizenship (previous goal two).<\/p>\n<h3>How does the district Instructional Technology Plan reflect experiences during the COVID pandemic?<\/h3>\n<p>During the Covid pandemic teachers and students were forced to teach and learn fully online. Learning environments all had to be outfitted with a Web Camera (on a laptop or device, or from a document camera). Teachers were instructed on how to use the video conferencing platform of Zoom. Teachers also had to teach from a hybrid perspective (some students at home and others in the classroom). Teachers utilized online content platforms Seesaw at the elementary level and Canvas at the secondary level to provide students with resources for learning.<\/p>\n<p>Prior to COVID, SSCSD had 10 mifi devices, during the pandemic SSCSD purchased an additional 80 mifi devices to provide to students that did not have adequate internet connectivity at their place of residence.<\/p>\n<p>Prior to COVID, SSCSD had already started a 1 to 1 distribution of devices at our middle school. During the pandemic we added devices at high school and set up classroom sets at our elementary grade levels. We also had to change the model of student device because of supply chain issues. This forced us to also repurpose older devices to different grade levels. All students had access to a device during the pandemic.<\/p>\n<p>Professional Development was offered through Zoom and Webex video conference platforms. The focus was on the use of Zoom, Seesaw, Canvas and the utilization of online resources.<\/p>\n<p>Instructional videos we developed for students that could be accessed from home. These videos assisted students in using Office 365, Canvas and Seesaw. The videos also emphasized the application of Clever our single sign on system for students and staff.<\/p>\n<p>Parents were involved in learning the basics of Canvas and Seesaw (their children’s Learning Management System) through online courses.<\/p>\n<h3>District 1:1 Initiatives<\/h3>\n<p>While the district is not currently fully 1:1, Grades K through 5 have access to class sets that provide a device per student. Students may request to take devices home if needed to complete schoolwork. In grades 6 through 12 students are currently provided with a device. Students receive a new device in 6th and 9th grade.<\/p>\n<h3>Professional Development Planning<\/h3>\n<p>SSCSD Professional Learning Goals:<\/p>\n<ol>\n<li>Frequently conduct needs assessments of students and staff based on qualitative and quantitative data<\/li>\n<li>Incorporate research-based practices with a focus on increasing student success based on qualitative and quantitative data<\/li>\n<li>Support individualized goals and allow for personalized professional learning paths<\/li>\n<li>Develop and provide a robust catalog of offerings that strengthen, increase, and integrate our staff’s ability to holistically support students’ needs (both academically and socially-emotionally)<\/li>\n<li>Regularly conduct analysis of professional learning offerings and outcomes to determine our return on investment<\/li>\n<\/ol>\n<p>SSCSD is fortunate to be able to offer unique and robust programs, services, and partnerships in collaboration with our surrounding community. Professional learning opportunities include a New Teacher Induction Program, Mentor Program, Professional Learning Communities (PLTs), Teaming at Maple MS, study groups, and professional learning days.<\/p>\n<p>The SSCSD professional development program is linked here: <a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/r\/sites\/SSCSDStaffResources\/Shared%20Documents\/Professional%20Development\/2020-2023%20Professional%20Development%20Plan.pdf?csf=1&amp;web=1&amp;e=fB4Ta5\">SSCSD 2020-2023 PD Plan<\/a><\/p>\n<p>The SSCSD Professional Development Program will be reviewed annually to determine its effectiveness by using data such as, but not limited to:<\/p>\n<ul>\n<li>Course Evaluations<\/li>\n<li>Curriculum Design<\/li>\n<li>Instructional Observations<\/li>\n<li>Number of community partnerships<\/li>\n<li>Number of courses and workshops offered<\/li>\n<li>Number of National Board Certified Teachers<\/li>\n<li>Number of new courses offered<\/li>\n<li>Number of new staff members offering courses<\/li>\n<li>Number of Parent University participants<\/li>\n<li>Number of staff members offering in-district courses<\/li>\n<li>Number of staff members participating in in-district courses<\/li>\n<li>Number of staff members participating in out-of-district courses<\/li>\n<li>Percentage of courses aligned with research-based practices<\/li>\n<li>Percentage of courses aligned with specific subject areas\/areas of need (i.e., special education, English Language Learners, etc.)<\/li>\n<\/ul>\n<h3><a id=\"goalattainment\"><\/a>Goal Attainment<\/h3>\n<p>Success of goals from the <a href=\"http:\/\/www.nysed.gov\/edtech\/usny-technology-plan\">2010 Statewide Learning Technology Plan<\/a><\/p>\n<p><strong><em>Moderately<\/em><\/strong>: Digital Content – The District uses standards-based, accessible digital content that supports all curricula for all learners.<\/p>\n<p><strong><em>Significantly<\/em><\/strong>: Digital Use – The District’s learners, teachers, and administrators are proficient in the use of technology for learning.<\/p>\n<p><strong><em>Moderately<\/em><\/strong>: Digital Capacity and Access – The District’s technology infrastructure supports learning and teaching in all of the District’s environments.<\/p>\n<p><strong><em>Significantly<\/em><\/strong>: Leadership – The District Instructional Technology Plan is in alignment with the Statewide Learning Technology Plan vision.<\/p>\n<p><strong><em>Moderately<\/em><\/strong>: Accountability – District-level information is posted on the District website, is easy to access, and is easily understood. Information provided includes the results achieved by the District in their efforts to enable students to build knowledge, master skills, and grasp opportunities for a better life.<\/p>\n<h3><a id=\"actionplan\"><\/a>Action Plan<\/h3>\n<p><strong>Goal 1 <\/strong>(All students): Technology will be effectively integrated into all curriculums using the NYS Computer Science and Digital Fluency Standards to transform teaching and learning to ensure the highest levels of success of all our students.<\/p>\n<p>Aligns with NYSED goal, “Develop a strategic vision and goals to support student achievement and engagement through the seamless integration of technology into teaching and learning.”<\/p>\n<p><strong>Measurement and evaluation during and after implementation:<\/strong><\/p>\n<ul>\n<li>Students will access technology consistently during class projects and<\/li>\n<li>Curriculum maps revised or created during this plan s time period will be align with the CS\/DF standards and demonstrate the expectation for student technology usage as grade level appropriate.<\/li>\n<li>TILT members will meet regularly to provide feedback on student usage of software and hardware and will provide teachers with a self-reflection tool tied to or based off SAMR model. (Does this warrant the development of a scale that we can use to evaluate).<\/li>\n<\/ul>\n<p><strong>Goal 2 <\/strong>(All Students, Teachers\/Teacher Aides, Administrators, Parents\/Guardians\/Families\/School Community, Technology Integration Specialists):The district will emphasize the safe, ethical, and responsible use of technology by students and staff in a diverse and inclusive educational setting through grade level digital citizenship lessons to students, as well as reinforced during monthly district and building-wide communication.<\/p>\n<p>Aligns with NYSED goal, “Provide technology-enhanced, culturally- and linguistically-responsive learning environments to support improved teaching and learning.”<\/p>\n<p><strong>Measurement and evaluation during and after implementation:<\/strong><\/p>\n<ul>\n<li>Students and staff will demonstrate positive, safe, legal, and ethical behavior when using the LMS, shared documents, posting and creating content, while engaging in videoconferencing, and conducting research.<\/li>\n<li>The district will analyze discipline referrals related to technology and staff completion of training<\/li>\n<li>The middle school will analyze the distribution of LiveSchool points to measure positive student digital<\/li>\n<li>Staff will utilize the district software approval process to ensure new software is Ed Law 2D<\/li>\n<li>One Digital Citizenship lesson per month<\/li>\n<\/ul>\n<p><strong>Goal 3 <\/strong>(All students, Students with Disabilities, English Language Learners, Economically disadvantaged students, Students experiencing homelessness and\/or housing insecurity, Students who do not have adequate access to computing devices and\/or high-speed internet at their places of residence, Students who do not have internet access at their place of residence.)  Increase students ability to access and utilize technology tools (hardware and software) to allow for differentiated instruction that provide equitable access to curriculum and learning for all students.<\/p>\n<p>Aligns with NYSED goal, “Increase equitable access to high-quality digital resources and standards-based, technology-rich learning experiences.”<\/p>\n<p><strong>Measurement and evaluation during and after implementation:<\/strong><\/p>\n<ul>\n<li>Technology tools (hardware, software) are in place and utilized to meet the needs of students IEPs in the most student-friendly accessible<\/li>\n<li>Technology tools (hardware, software) are in place and utilized to meet the needs of our English Language Learner student<\/li>\n<li>Options are provided to all students to access online content outside of the regular school<\/li>\n<li>Yearly completed K-12 Student Digital Access<\/li>\n<\/ul>\n<p><strong>Goal 4 <\/strong>(All students, Teachers\/Teacher Aides Administrators): Provide a Robust and Secure IT Infrastructure that supports Wi-Fi 6 (newest Wifi Standard) to improve internet access for students and staff throughout the school day.<\/p>\n<p>Aligns with NYSED goal, “Design, implement, and sustain a robust, secure network to ensure sufficient, reliable high-speed connectivity for learners, educators, and leaders.”<\/p>\n<p><strong>Measurement and evaluation during and after implementation:<\/strong><\/p>\n<ul>\n<li>IT Infrastructure team will monitor and document internet throughput data usage along with wireless network<\/li>\n<li>Staff and students will be surveyed regarding their network access and utilization<\/li>\n<li>Internet throughput data and wireless statistics will be reviewed at bi-weekly infrastructure<\/li>\n<li>Survey results will be reviewed by IT Infrastructure team and modifications will be made where<\/li>\n<li>Data for both actions steps above will give us information supporting that our network is robust, secure and supports the educational process effectively.<\/li>\n<\/ul>\n<h3><a id=\"nysed\"><\/a>NYSED Initiatives Alignment<\/h3>\n<p>1. Explain how the district use of instructional technology will serve as a part of a comprehensive and sustained effort to support rigorous academic standards attainment and performance improvement for students.<\/p>\n<p><strong>How technology is integrated into teaching and learning throughout the district:<\/strong><\/p>\n<ul>\n<li>\n<p>All students have access to a technology. Class sets are available at the elementary level and one to one student devices at our middle and high school for grades 6-12. MiFi internet Hot Spots are available for any student or staff that may need access to the internet. Teaching staff utilize learning management systems to create, connect and communicate digital content for our students, as well as connect to and communicate with families.<\/p>\n<\/li>\n<\/ul>\n<p><strong><em>How technology is used by teachers to facilitate their practice:<\/em><\/strong><\/p>\n<ul>\n<li>\n<p>Technology is used to teach and practice concepts in engaging It plays an integral role as it allows teachers and students to access a consistent platform to organize instruction, learning, and student work. Technology plays a crucial role in supporting ongoing learning for students. Technology allows for creativity in how materials are presented and completed. It is important that technology provides students and families with a level of clarity and consistency. Technology has increased communication between teachers to students and families by providing a digital window to the classroom.<\/p>\n<\/li>\n<\/ul>\n<p><strong>How technology is used by students to demonstrate understanding of skills and concepts:<\/strong><\/p>\n<ul>\n<li>Technology is used extensively for students to demonstrate understanding of skills and<\/li>\n<li>All secondary courses utilize Canvas to varying degrees. This learning management system allows students to access learning from anywhere. Teachers are constantly learning new ways to use Canvas to support their curriculum and continually weaving the threads into the fabric of their<\/li>\n<li>All elementary teachers utilize Seesaw as a way to provide access to their classrooms to students and families outside of the school building. Students who are out of class for an extended period of time can utilize Seesaw to demonstrate learning and complete activities outside of<\/li>\n<li>Teachers are continuing to incorporate new digital tools that integrate with Canvas in their lesson planning. Whether it is Kami which allows teachers to real time provide feedback and guidance as students work on research projects, participating in an engaging Nearpod activity or embedding teacher made videos into an assignment that students can then collaborate on or even posting a discussion question that students respond to and then can debate with each other in the comments.<\/li>\n<li>Technology is a dynamic, ever-changing piece of a teachers lesson plan and has been thrust into importance with the COVID This sharp learning curve had the benefits of forcing teachers outside their comfort zone and into the world of digital technology in education. Teachers are continuing to add (and change) how they use technology in the classroom as they reflect on their practice and how to use it to best meet students where they are and promote deep understanding.<\/li>\n<\/ul>\n<p><strong>How technology is used to provide multiple pathways to access and participate in learning:<\/strong><\/p>\n<ul>\n<li>The COVID pandemic has put a spotlight on the reliance of teachers on using technology to ensure that all students can access high quality Whether it was the hybrid schedule of 2020-21 where students were zoom-ing in from home three days a week or the current year where students are in school full time but frequently disrupted by quarantines or exposures, technology has been the key tool in our toolbox of making sure access to education is available. Teachers in the secondary level (6-12) use Canvas to post daily announcements and assignments. When students miss school, they can access class materials on Canvas using their school issued or personal device. Teachers can post videos of class notes, alternate assignments for students who miss, as well as communicate easily with students via the Canvas platform.<\/li>\n<li>Digital tools provide students with multiple pathways to participate in Having technology allows for student voice and choice in their access and understanding of the curriculum. Students can submit assignments online or on paper or choose the method of their response. Technology allows more seamless peer review and class discussions to continue even beyond the bell.<\/li>\n<\/ul>\n<ol start=\"2\">\n<li>\n<p>Explain the strategies the district plans to implement to address the need to provide equitable learning “everywhere, all the time” (National Technology Plan). Include both short and long-term solutions, such as device access, internet access, human capacity, infrastructure, partnerships, etc.<\/p>\n<\/li>\n<\/ol>\n<p><strong>Short and long-term solutions:<\/strong><\/p>\n<p>The urgent changes and alternate schedule implemented for the 2020-21 school year due to the COVID pandemic are examples of short-term solutions that started long-term changes. The district went from 1:1 only in grades 6-8 but transitioned quickly to providing device access to any child who needed it K-12. We are in the middle of completing the 1:1 initiative at the high school and every elementary classroom has a class set of evices. There is a novel expectation that all teachers are using a consistent learning management system for collaboration, access, and communication across the district.<\/p>\n<p><strong>Device Access:<\/strong><\/p>\n<p>Everyone who needs access to a device has access to a device. All students are provided with a technology device. The secondary level from grades 6 to 10 is 1:1. Grades 11 and 12 will have devices by the 23-24 school year. The elementary level has a set of devices in the classroom. Secondary students bring their devices to and from school daily and elementary students can bring the devices home as needed. All teaching staff are provided with a device for planning and instructional purposes.<\/p>\n<p><strong> <\/strong><strong>Internet Access:<\/strong><\/p>\n<p>All students and staff have access to the internet at school through various WIFI access points distributed throughout the buildings. The district provides MIFI hot spots for any student or staff member who needs internet access at home.<\/p>\n<p><strong>Human Capacity (Technology Skills):<\/strong><\/p>\n<p>The technological knowledge of the teaching staff has dramatically increased over the past two years and continues to grow. The COVID pandemic has thrust into the spotlight the importance of technology to ensure that students have access to education materials regardless of their ability to be present in school. Because of this, teachers had to evolve past their comfort zone and utilize technology daily in their classrooms. As our students have returned to full-time in-person instruction, the leaps we&#8217;ve made to incorporate technology into education remain. Additionally, we also offer regular professional development opportunities for teachers to explore new option<\/p>\n<p>Student capacity for technology has also increased significantly over the previous two years and continues to build. Students are comfortable with the learning management systems as teachers relied on them heavily last year and continue to. Students are comfortable exercising their choice of response and utilizing technology to participate in activities or complete assignments they may have previously missed. The use of a learning management system has also provided students with instantaneous feedback on assignments as they progress through their learning process. The significant use of the learning management systems has also provided students with autonomy and ownership of their own learning, which was not previously possible. This continues to grow and better prepares our students for the next phase of life whether it is in higher education or not.<\/p>\n<p><strong>Infrastructure:<\/strong><\/p>\n<p>Due to the significant increase in device use during the school day, the infrastructure in the buildings has improved dramatically. As we continue to rely on the architecture we&#8217;ve built on a daily basis, improvements continue to be made. We continue to build out our infrastructure, through the use of future capital projects to increase the robustness of this critical tool in teaching and learning.<\/p>\n<p><strong>Partnerships:<\/strong><\/p>\n<p>All departments in the district work together and are connected via the strand of technology. We have an excellent partnership with the transportation department, delivering access points or devices to ensure that technology is accessible to staff and students. We utilize relationships with national telecommunications companies to find ways to best leverage their resources to ensure equitable access for all of our students regardless of ability to pay or geographical location. We partner very well with our Northeast Regional Information Center and our WSHWE BOCES for support, information and training as well.<\/p>\n<p>3. Students with disabilities may be served through the use of instructional technology as well as assistive technology devices and services to ensure access to and participation in the general education curriculum. Describe how instruction using technology is differentiated to support the individual learning needs of students with disabilities.<\/p>\n<p><strong>Specific technology, applications, and\/or devices that the district uses to serve students with disabilities:<\/strong><\/p>\n<p>The district uses a variety of technology and applications to support the learning needs of students with disabilities. This includes applications specific to meeting student needs\/skill deficits in the areas of behavior management, social-emotional learning, literacy-based assistive technology software (speech-to-text, text-to-speech, word prediction programs); as well as tools for differentiating core curriculum content, data tracking and assessment, and supplementing core curriculum through specialized programs. The district offers teachers a variety of teaching tools and platforms that allow for the differentiation of content to meet a range of student needs and integrated accessibility features for access and opportunity. Specific software to meet the needs of students who have visual impairment, hearing impairment, communication impairments, and other related disabilities are provided and implemented per individual student needs.<\/p>\n<p>In addition to the technology programs and applications, students with disabilities require access to a number of assistive technology devices, including, but not limited to: I-pads, laptops, large screen I-pads\/tablets and large screen laptops, FM systems, magnifiers, communication devices, switches, low-tech visual supports (I.e. Picture Exchange Communication Systems), and interactive smartboards. Students also may have access to specialized hardware, such as large format keyboards, specialized computer mice, larger display, audio output devices, and dedicated augmentative &amp; alternative communication devices.<\/p>\n<p><strong>How teachers use technology to address accessibility and to differentiate, modify, and accommodate the instruction of students with disabilities:<\/strong><\/p>\n<p>Students within the SSCSD present with a variety of disabilities, such as vision impairment, hearing impairment, communication delay, specific learning disabilities, Autism, and social-emotional based disabilities. Differentiation is based on individual student needs and can range from low tech interventions\/scaffolding, to integrated software and higher tech devices and access.<\/p>\n<p>Many teachers deliver their instructional materials electronically. Students access these materials using their 1:1 laptops or I-pads and can access them at home as well. Students with special needs receive differentiated support via access to specialized programs and tools that assist with reading, writing, and communication. Examples of these tools include text-to-speech, speech-to-text, audiobooks, and magnifying software. Software programs are selected based on individual student needs to accommodate and differentiate to ensure access to curriculum.<\/p>\n<ol start=\"4\">\n<li>\n<p>How does the district utilize technology to address the needs of students with disabilities to ensure equitable access to instruction, materials, and assessments?<\/p>\n<\/li>\n<\/ol>\n<ul>\n<li>Class lesson plans, materials, and assignment instructions are available to students and families for &#8220;anytime, anywhere&#8221; access (such as through a class website or learning management system).<\/li>\n<li>Technology is used to provide additional ways to access key content, such as providing videos or other visuals to supplement verbal or written instruction or content.<\/li>\n<li>Text to speech and\/or speech to text software is utilized to provide increased support for comprehension of written or verbal Assistive technology is utilized.<\/li>\n<li>Technology is used to increase options for students to demonstrate knowledge and Learning games and other interactive software are used to supplement instruction.<\/li>\n<\/ul>\n<ol start=\"5\">\n<li>\n<p>Professional development that will be offered to teachers of students with disabilities that will enable them to differentiate learning and to increase student language and content learning through the use of technology:<\/p>\n<\/li>\n<\/ol>\n<ul>\n<li>Technology to support writers in the elementary classroom<\/li>\n<li>Technology to support writers in the secondary classroom<\/li>\n<li>Research, writing and technology in a digital world<\/li>\n<li>Enhancing children&#8217;s vocabulary development with technology<\/li>\n<li>Reading strategies through technology for students with disabilities<\/li>\n<li>Choosing assistive technology for instructional purposes in the special education classroom<\/li>\n<li>Using technology to differentiate instruction in the special education classroom<\/li>\n<li>Using technology as a way for students with disabilities to demonstrate their knowledge and skills<\/li>\n<li>Multiple ways of assessing student learning through technology<\/li>\n<li>Electronic communication and collaboration<\/li>\n<li>Promotion of model digital citizenship and responsibility<\/li>\n<li>Integrating technology and curriculum across core content areas<\/li>\n<li>Helping students with disabilities to connect with the world<\/li>\n<\/ul>\n<p>6. How does the district utilize technology to address the needs of English Language Learners to ensure equitable access to instruction, materials, and assessments?<\/p>\n<ul>\n<li>Class lesson plans, materials, and assignment instructions are available to students and families for &#8220;anytime, anywhere&#8221; access (such as through class website or learning management system).<\/li>\n<li>Technology is used to provide additional ways to access key content, such as providing videos or other visuals to supplement verbal or written instruction or content.<\/li>\n<li>Text to speech and\/or speech to text software is utilized to provide increased support for comprehension of written or verbal<\/li>\n<li>Home language dictionaries and translation programs are provided through technology.<\/li>\n<li>Hardware that supports ELL student learning, such as home-language keyboards, translation pens, and\/or interactive whiteboards, is utilized. Technology is used to increase options for students to demonstrate knowledge and skill, such as through the creation of a product or recording of an oral response.<\/li>\n<li>Learning games and other interactive software are used to supplement<\/li>\n<\/ul>\n<ol start=\"7\">\n<li>\n<p>Does the district’s Instructional Technology Plan address the needs of English Language Learners to ensure equitable access to instruction, materials, and assessments in multiple languages?<\/p>\n<\/li>\n<\/ol>\n<ul>\n<li>\n<p>Yes, in the 5 languages most commonly spoken in the<\/p>\n<\/li>\n<\/ul>\n<ol start=\"8\">\n<li>\n<p>The professional development that will be offered to teachers of English Language Learners that will enable them to differentiate learning and to increase their student language development and content learning with the use of technology:<\/p>\n<\/li>\n<\/ol>\n<ul>\n<li>Technology to support writers in the elementary classroom<\/li>\n<li>Technology to support writers in the secondary classroom<\/li>\n<li>Research, writing and technology in a digital world<\/li>\n<li>Writing and technology workshop for teachers<\/li>\n<li>Enhancing children&#8217;s vocabulary development with technology<\/li>\n<li>Writer&#8217;s workshop in the Bilingual classroom<\/li>\n<li>Reading strategies for English Language Learners<\/li>\n<li>Moving from learning letters to learning to read<\/li>\n<li>The power of technology to support language acquisition<\/li>\n<li>Using technology to differentiate instruction in the language classroom<\/li>\n<li>Multiple ways of assessing student learning through technology<\/li>\n<li>Electronic communication and collaboration<\/li>\n<li>Promotion of model digital citizenship and responsibility<\/li>\n<li>Integrating technology and curriculum across core content areas<\/li>\n<li>Helping students connect with the world<\/li>\n<li>The interactive whiteboard and language learning<\/li>\n<li>Use camera for documentation<\/li>\n<\/ul>\n<p>9. How does the district utilize technology to address the needs of students experiencing homelessness and\/or housing insecurity to ensure equitable access to instruction and learning?<\/p>\n<ul>\n<li>Set enrollment forms to automatically provide the McKinney-Vento liaison with contact information for students who indicate possible homelessness and\/or housing insecurity<\/li>\n<li>Provide students experiencing homelessness and\/or housing insecurity with tablets or laptops, mobile hotspots, prepaid cell phones, and other devices and connectivity.<\/li>\n<li>Provide students a way to protect and charge any devices they are provided\/with\/by the district.<\/li>\n<li>Replace devices that are damaged or stolen\/as needed.<\/li>\n<li>Create individualized plans for providing access to technology and internet on a case-by-case basis for any student experiencing homelessness and\/or housing<\/li>\n<li>Technology is used to provide additional ways to access key content, such as providing videos or other visuals to supplement verbal or written instruction or<\/li>\n<li>Conduct regular educational check- ins with all students experiencing homelessness and\/or housing insecurity and secure any help needed to keep up with course<\/li>\n<li>Adjust assignments\/to be completed successfully using\/only\/the\/resources students have<\/li>\n<\/ul>\n<p>10. How does the district use instructional technology to facilitate culturally responsive instruction and learning environments?<\/p>\n<ul>\n<li>The district uses instructional technology to facilitate classroom projects that involve the community<\/li>\n<li>The district uses instructional technology to develop and organize coherent and relevant units, lessons, and learning tasks that build upon students&#8217; cultural backgrounds and experiences.<\/li>\n<li>The district uses instructional technology to assist in varying teaching approaches to accommodate diverse learning styles and language<\/li>\n<\/ul>\n<h3>Administrative Management Plan<\/h3>\n<p>Staff Plan of all staff whose primary responsibility is delivering technology integration training and support and\/or technical support<strong>.<\/strong><\/p>\n<ul>\n<li>District Technology Leadership: 3.00 Full-time Equivalent <\/li>\n<li>Instructional Support: 2.00 Full-time Equivalent  <\/li>\n<li>Technical Support: 10.00 Full-time Equivalent <\/li>\n<li>Total: 15 Full-time Equivalent <\/li>\n<\/ul>\n<h3><strong>Three-year Investment Plan:<\/strong><\/h3>\n<table width=\"123.862%\" style=\"width: 123.862%; border-style: solid;\" border=\"1\">\n<tbody>\n<tr style=\"height: 89px;\">\n<td width=\"48\" style=\"height: 89px; width: 6.12813%;\">\n<p>&nbsp;<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 89px; width: 18.8022%;\">\n<p>Anticipated Item or Service<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 89px; width: 18.5237%;\">\n<p>&#8220;Other&#8221; Anticipated Item or Service<\/p>\n<\/td>\n<td width=\"66\" style=\"height: 89px; width: 13.5097%;\">\n<p>Estimated Cost<\/p>\n<\/td>\n<td width=\"120\" style=\"height: 89px; width: 16.0167%;\">\n<p>Is Cost One-time, Annual, or Both?<\/p>\n<\/td>\n<td width=\"234\" style=\"height: 89px; width: 27.0195%;\">\n<p>Potential Funding Source<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 110px;\">\n<td width=\"48\" style=\"height: 110px; width: 6.12813%;\">\n<p>1<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 110px; width: 18.8022%;\">\n<p>End User Computing Devices<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 110px; width: 18.5237%;\">\n<p>Laptops, iPads, Interactive Whiteboards<\/p>\n<\/td>\n<td width=\"66\" style=\"height: 110px; width: 13.5097%;\">\n<p>3,000,000<\/p>\n<\/td>\n<td width=\"120\" style=\"height: 110px; width: 16.0167%;\">\n<p>Annual<\/p>\n<\/td>\n<td width=\"234\" style=\"height: 110px; width: 27.0195%;\">\n<p>BOCES Co-Ser purchase<\/p>\n<p>District Operating Budget<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 116px;\">\n<td width=\"48\" style=\"height: 116px; width: 6.12813%;\">\n<p>2<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 116px; width: 18.8022%;\">\n<p>Instructional and Administrative Software<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 116px; width: 18.5237%;\">\n<p>Digital Subscriptions<\/p>\n<\/td>\n<td width=\"66\" style=\"height: 116px; width: 13.5097%;\">\n<p>2,100,000<\/p>\n<\/td>\n<td width=\"120\" style=\"height: 116px; width: 16.0167%;\">\n<p>Annual<\/p>\n<\/td>\n<td width=\"234\" style=\"height: 116px; width: 27.0195%;\">\n<p>BOCES Co-Ser purchase<\/p>\n<p>District Operating Budget<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 143px;\">\n<td width=\"48\" style=\"height: 143px; width: 6.12813%;\">\n<p>3<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 143px; width: 18.8022%;\">\n<p>Internet Connectivity<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 143px; width: 18.5237%;\">\n<p>Internet Service Provider<\/p>\n<\/td>\n<td width=\"66\" style=\"height: 143px; width: 13.5097%;\">\n<p>192,480<\/p>\n<\/td>\n<td width=\"120\" style=\"height: 143px; width: 16.0167%;\">\n<p>Annual<\/p>\n<\/td>\n<td width=\"234\" style=\"height: 143px; width: 27.0195%;\">\n<p>BOCES Co-Ser purchase<\/p>\n<p>District Operating Budget<\/p>\n<p>E-Rate<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 155px;\">\n<td width=\"48\" style=\"height: 155px; width: 6.12813%;\">\n<p>4<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 155px; width: 18.8022%;\">\n<p>Network and Infrastructure<\/p>\n<\/td>\n<td width=\"126\" style=\"height: 155px; width: 18.5237%;\">\n<p>Switches, Servers, Wireless Access Points<\/p>\n<\/td>\n<td width=\"66\" style=\"height: 155px; width: 13.5097%;\">\n<p>360,000<\/p>\n<\/td>\n<td width=\"120\" style=\"height: 155px; width: 16.0167%;\">\n<p>Annual<\/p>\n<\/td>\n<td width=\"234\" style=\"height: 155px; width: 27.0195%;\">\n<p>BOCES Co-Ser purchase<\/p>\n<p>District Operating Budget<\/p>\n<p>E-Rate<\/p>\n<\/td>\n<\/tr>\n<tr style=\"height: 50px;\">\n<td colspan=\"3\" width=\"300\" style=\"height: 50px; width: 43.454%;\">\n<p><strong>Totals: <\/strong><\/p>\n<\/td>\n<td colspan=\"3\" width=\"420\" style=\"height: 50px; width: 56.546%;\">\n<p><strong>5,652,480<\/strong><\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p><strong> <\/strong><\/p>\n<ul>\n<li>The school district has provided for the loan of instructional computer hardware to students legally attending nonpublic schools pursuant to Education Law, section 754<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>District Mission Statement | Vision Statement | Planning Process | Goal Attainment | Action Plan&amp; Goals | NYSED Initiatives Alignment | Saratoga Springs City School District Information Technology Plan 2022-2025 District Mission Statement The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future. Our &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Information Technology Plan&#8221;<\/span><\/a><\/p>\n","protected":false},"author":12,"featured_media":0,"parent":524,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-691","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Information Technology Plan - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Information Technology Plan - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"District Mission Statement | Vision Statement | Planning Process | Goal Attainment | Action Plan&amp; Goals | NYSED Initiatives Alignment | Saratoga Springs City School District Information Technology Plan 2022-2025 District Mission Statement The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future. Our &hellip; Continue reading &quot;Information Technology Plan&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-08-28T15:16:43+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"21 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\",\"url\":\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\",\"name\":\"Information Technology Plan - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-01-14T17:45:10+00:00\",\"dateModified\":\"2025-08-28T15:16:43+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Departments &#038; Services\",\"item\":\"https:\/\/www.saratogaschools.org\/departments-services\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Technology\",\"item\":\"https:\/\/www.saratogaschools.org\/departments-services\/technology\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Information Technology Plan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Information Technology Plan - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/","og_locale":"en_US","og_type":"article","og_title":"Information Technology Plan - Saratoga City School District","og_description":"District Mission Statement | Vision Statement | Planning Process | Goal Attainment | Action Plan&amp; Goals | NYSED Initiatives Alignment | Saratoga Springs City School District Information Technology Plan 2022-2025 District Mission Statement The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future. Our &hellip; Continue reading \"Information Technology Plan\"","og_url":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-08-28T15:16:43+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"21 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/","url":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/","name":"Information Technology Plan - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-01-14T17:45:10+00:00","dateModified":"2025-08-28T15:16:43+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/information-technology-plan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"Departments &#038; Services","item":"https:\/\/www.saratogaschools.org\/departments-services\/"},{"@type":"ListItem","position":3,"name":"Technology","item":"https:\/\/www.saratogaschools.org\/departments-services\/technology\/"},{"@type":"ListItem","position":4,"name":"Information Technology Plan"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/691","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=691"}],"version-history":[{"count":12,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/691\/revisions"}],"predecessor-version":[{"id":11103,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/691\/revisions\/11103"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/524"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=691"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}