{"id":831,"date":"2022-01-28T14:13:03","date_gmt":"2022-01-28T19:13:03","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=831"},"modified":"2024-12-18T12:08:41","modified_gmt":"2024-12-18T17:08:41","slug":"district-wide-safety-plan","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/","title":{"rendered":"District-Wide Safety Plan"},"content":{"rendered":"<p><a href=\"#Introduction\">Introduction<\/a> | <a href=\"#Section-l\">Section l: General Considerations and Planning Guidelines<\/a> | <a href=\"#Section-II\">Section II: Risk Reduction\/Prevention and Intervention<\/a> | <a href=\"#Section-III\">Section III: Response<\/a> | <a href=\"#Section-IV\">Section IV: Declared State of Emergency Involving a Communicable Disease<\/a> | <a href=\"#Section-V\">Section V: Recovery<\/a> | <a href=\"#Section-VI\">Section VI: Safety and Security Resources<\/a> | <a href=\"#Appendix\">Appendix<\/a> | <a href=\"#Schedule-A\">Schedule-A<\/a> | <a href=\"#Schedule-B\">Schedule-B<\/a><\/p>\n<h2><a id=\"Introduction\"><\/a>Introduction<\/h2>\n<p>Emergencies and violent incidents in school districts are critical issues that must be addressed in an expeditious and effective manner. New York State School Districts are required to develop a district-wide safety plan designed to prevent or minimize the effects of serious violent incidents, declared state disaster emergencies involving a communicable disease or local public health emergencies and other emergencies. This plan will be used to facilitate the coordination of the district with local, county and state resources in the event of such incidents or emergencies. The district-wide plan is responsive to the needs of all schools within the district and is consistent with the more detailed emergency response plans required at the school building level. Districts stand at risk from a wide variety of acts of violence, natural, and manmade disasters. To address these threats, the State of New York has enacted the Safe Schools Against Violence in Education (SAVE) law. Project SAVE is a comprehensive planning effort that addresses prevention, response, and recovery with respect to a variety of emergencies in each school district and its schools.<\/p>\n<p>The Warren-Washington-Saratoga-Hamilton-Essex BOCES, in coordination with the Saratoga Springs City School District, supports the SAVE Legislation, and intends to facilitate the planning process. The Superintendent of Saratoga Springs City School District encourages and advocates on-going district-wide cooperation and support of Project SAVE.<\/p>\n<h2><a id=\"Section-l\"><\/a>Section l: General Considerations and Planning Guidelines<\/h2>\n<h3>A. Purpose<\/h3>\n<p>The Saratoga Springs District-Wide Safety Plan was developed pursuant to Commissioner&#8217;s Regulation 155.17. At the direction of the Saratoga Springs City School District Board of Education, the Superintendent of the Saratoga Springs City School District appointed a District-Wide Safety Team and charged it with the development and maintenance of the District-Wide Safety Plan.<\/p>\n<h3>B. Identification of School Teams<\/h3>\n<p>The Saratoga Springs City School District has a District Emergency Response Team and Building Emergency Response Teams for each building. The initial response to all emergencies at an individual school will be by the Building Emergency Response Team. The District team is responsible for emergencies at the MacFadden Building, Duplainville Road Facilities, and supports all building teams in the event of an actual emergency.<\/p>\n<p>The District-Wide Emergency Response team was appointed by the BOE on June 20, 2024. The members of the team are:<\/p>\n<ul>\n<li>Glenn Barrett<\/li>\n<li>Hillary Brewer<\/li>\n<li>Eric Bush<\/li>\n<li>Lisa Cutting<\/li>\n<li>John Dupras<\/li>\n<li>Andrea Dycha<\/li>\n<li>John Goodson<\/li>\n<li>Mike Goodwin<\/li>\n<li>Joe Greco<\/li>\n<li>Betsy Iaquinta<\/li>\n<li>Micki Jones<\/li>\n<li>John Joyce<\/li>\n<li>Jerome Keenan<\/li>\n<li>Mark Leffler<\/li>\n<li>David L’Hommedieu<\/li>\n<li>Lucas Manny<\/li>\n<li>Maura Manny<\/li>\n<li>Debra Meerdink<\/li>\n<li>Aaron Moore<\/li>\n<li>Stacey Moulton<\/li>\n<li>Lucille Murphy<\/li>\n<li>Laurie Newcomer<\/li>\n<li>Bethany Nightingale<\/li>\n<li>Michael Patton<\/li>\n<li>Darrell Payton<\/li>\n<li>Kim Ross<\/li>\n<li>John Thuener<\/li>\n<li>Jon Van Alstyne<\/li>\n<li>Ryan Warner<\/li>\n<li>Diane Woodard<\/li>\n<li>Robert Yusko<\/li>\n<\/ul>\n<p>Members of the Building-Level Response Team, a representative of the BOE and high school students are included in the monthly DERT Training. Those individuals act as a conduit for all stakeholders in the District.<\/p>\n<h3>C. Concept of Operations<\/h3>\n<ul>\n<li>The District-Wide Safety Plan shall be directly linked to the individual Building-Level Emergency Response Plans for Saratoga Springs City School District. The protocols reflected in the District-Wide Safety Plan will be used to guide the development and implementation of the individual Building-Level Emergency Response Plans.<\/li>\n<li>The development of the District-Wide Safety Plan was a collaborative effort involving members of the District Emergency Response Team, Building Emergency Response Teams, law enforcement officials, county emergency service coordinators, and the Capital Region BOCES Health Safety Risk Management Services. The plan was further developed utilizing the guidelines provided by the New York State Education Department.<\/li>\n<li>The Superintendent has appointed the Assistant Superintendent for Information Technology and Operational Innovation as the Chief Emergency Officer. The Chief Emergency Officer, or designee, is responsible for:\n<ul>\n<li>coordinating the communication between school staff, law enforcement, and other first responders;<\/li>\n<li>leading the efforts of the district-wide school safety team in the yearly update of the district-wide school safety plan;<\/li>\n<li>coordinating the district-wide plan with the building-level emergency response plans;<\/li>\n<li>ensuring staff understands the district–wide school safety plan;<\/li>\n<li>ensuring the completion and yearly update of building-level emergency response plans for each school building;<\/li>\n<li>assisting in the selection of security related technology and development of procedures for the use of such technology;<\/li>\n<li>coordinating appropriate safety, security, and emergency training for district and school staff, including required training in the emergency response plan;<\/li>\n<li>ensuring that all evacuation and lockdown drills required by Education Law section 807 are completed in all District buildings.<\/li>\n<\/ul>\n<\/li>\n<li>In the event of an emergency or violent incident, the initial response to all emergencies at an individual school will be by the Building Emergency Response Team. The Saratoga Springs City School District consists of the following facilities:\n<ul>\n<li>MacFadden Administration Building<\/li>\n<li>High School<\/li>\n<li>Maple Avenue Middle School<\/li>\n<li>Caroline Street Elementary School<\/li>\n<li>Division Street Elementary School<\/li>\n<li>Dorothy Nolan Elementary School<\/li>\n<li>Geyser Road Elementary School<\/li>\n<li>Greenfield Elementary School<\/li>\n<li>Lake Avenue Elementary School<\/li>\n<li>Transportation\/Bus Garage<\/li>\n<li>Operations and Facilities<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>All information pertaining to an emergency or violent incident will be directed to either the Building Principal\/Designee or the District Emergency Response Team.<\/p>\n<ul>\n<li>Upon the activation of the Building Emergency Response Team, the Superintendent of Schools or their designee and District Emergency Response Team will be notified. When appropriate, local emergency officials will also be notified by calling 911.<\/li>\n<li>County and State resources through existing established protocols may supplement emergency response efforts.<\/li>\n<\/ul>\n<h3>D. Plan Review and Public Comment<\/h3>\n<ul>\n<li>This plan shall be reviewed and maintained by the District and Building Emergency Response Teams on an annual basis.<\/li>\n<li>When significant changes are made, pursuant to Commissioner&#8217;s Regulation 155.17(e) (3), this plan will be made available for public comment 30 days prior to adoption. The district-wide and building-level plans may be adopted by the School Board only after at least one public hearing that provides for the participation of school personnel, parents, students and any other interested parties. The plan must be formally adopted by the Board of Education.<\/li>\n<li>While linked to the District-Wide Safety Plan, the Building-Level Emergency Response Plans shall be confidential and shall not be subject to disclosure under Article 6 of the Public Officers Law or any other provision of law, in accordance with Education Law Section 2801-a.<\/li>\n<li>Full copies of the District-Wide Safety Plan and Amendments must be submitted to the New York State Education Department upon adoption by the Board of Education.<\/li>\n<\/ul>\n<h2><a id=\"Section-II\"><\/a>Section II: Risk Reduction\/Prevention and Intervention<\/h2>\n<h3>Prevention\/Intervention Strategies<\/h3>\n<h4>Program Initiatives<\/h4>\n<p>The Saratoga Springs City School District has offered programs and activities for improving communications among students, parents or persons in parental relation and staff in order to prevent potentially violent incidents. The programs include:<\/p>\n<ul>\n<li>Athletic Programs<\/li>\n<li>Behavioral Threat Assessment<\/li>\n<li>Program concerned with bullying and violence prevention<\/li>\n<li>National Incident Management System (NIMS) training for emergency response team members<\/li>\n<li>New York State School Safety Guide (2013)<\/li>\n<li>Collaboration with the Saratoga County Office of Emergency Services<\/li>\n<li>Dignity for All Students Act (DASA) training<\/li>\n<li>Positive Behavioral Interventions and Supports (PBIS)<\/li>\n<li>Behavioral Health Services North (BHSN)<\/li>\n<li>Student Assistance Counselors<\/li>\n<li>Too Good for Drugs (Prevention Council)<\/li>\n<li>Developing Building-Level Threat Assessment Teams<\/li>\n<li>Project Lift<\/li>\n<li>Second Step (at Elementary Level)<\/li>\n<li>Social Workers, School Counselors, School Psychologists<\/li>\n<li>Vector Solutions(SafeSchools) Training Portal &#8211; Provided by NYSIR<\/li>\n<li>SafeSchool Helpline<\/li>\n<\/ul>\n<h4>Dissemination of Information for Threats of Violence to Harm Others or Harm Self<\/h4>\n<p>In the event that the District or school is notified of a threat of harm against others, or themselves, the threat should be taken seriously. Threats should be reviewed by the administrator, school resource officer, school social worker, psychologist and if necessary, the threat should be triaged by the appropriate Behavioral Threat Assessment Team. <span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p>Staff will receive training by September 15<sup>th<\/sup> of each school year to identify the early warning signs of potential violent behaviors. This training will occur using the Vector Solutions Training Portal.<\/p>\n<p>Training on the purposes and procedures of the Behavioral Threat Assessment Team shall be conducted annually.  <\/p>\n<h4>Training, Drills, and Exercises<\/h4>\n<p>The Saratoga Springs City School District has developed policies and procedures for annual multi-hazard school safety training for staff and students, including the strategies for implementing training related to multi-hazards.  All drills required by the NYS Department of Education are satisfied annually and must follow a trauma informed approach. Drills and training must not include props, actors, simulations, or other tactics intended to mimic a school shooting, incident of violence or other emergency. School District building administrators will be required to notify parents\/guardians of upcoming drills. When a drill occurs, staff and students must be informed that the event is a drill and not an actual emergency.<\/p>\n<ul>\n<li>The District will submit certification to NYSED that all district and school staff have undergone annual training on the emergency response plan, and that the school safety training includes components on violence prevention and mental health. New employees hired after the start of the school year will receive training within 30 days of hire. The District will certify that all school staff receives this training by September 15th of each school year, or within 30 days of hire, whichever is sooner.<\/li>\n<li>Full participation in the Annual Early Dismissal -Go Home Evacuation Drill.<\/li>\n<li>Full participation in an On-Site Sheltering and Accountability Drill.<\/li>\n<li>Full participation with an Annual Evacuation and Relocation Drill.<\/li>\n<li>Full participation with 4 Building Lockdown\/Security Drills annually.<\/li>\n<li>The District conducts 8 Fire Alarm Activation and Evacuation Drills annually.<\/li>\n<li>The District conducts 4 School Bus Safety and Evacuation Drills annually.<\/li>\n<li>Emergency Response Team members participate in simulated tabletop exercises multiple times annually to test the building-level safety plan components.<\/li>\n<li>The District conducts drills and other training exercises to test components of the emergency response in coordination with the following agencies:\n<ul>\n<li>Saratoga County Office of Emergency Services<\/li>\n<li>Saratoga County Sheriff&#8217;s Department<\/li>\n<li>Saratoga Springs City Police Department<\/li>\n<li>Saratoga Springs Fire Department<\/li>\n<li>Town of Greenfield Fire Department<\/li>\n<li>New York State Police Troop G<\/li>\n<li>Department of Homeland Security<\/li>\n<li>Capital Region BOCES Health Safety Risk Management Service<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>If the District chooses to participate in a full-scale exercise in conjunction with local and county emergency responders and preparedness officials utilizing props, actors, simulations or other tactics intended to mimic a school shooting or other act of violence, such exercise must not be conducted on a regular school day or when other activities including athletics are occurring on school grounds. In addition, such exercises cannot include students without written consent from parents or persons in parental relation.<\/p>\n<p>Note: Directly following tests or drills, a debriefing will be conducted to evaluate the exercises and determine if changes to the emergency response plan are necessary. Notes are taken during exercises and the debriefing, which are used during the evaluation process.<\/p>\n<p><strong>Trauma Informed Approach<\/strong><\/p>\n<p>A trauma-informed approach is a way of understanding and responding to people who have experienced trauma, which can affect their sense of self, others, and the world. It involves realizing the widespread impact of trauma, recognizing the signs and symptoms of trauma, and integrating knowledge about trauma into policies, procedures, and practices. It also seeks to promote empowerment and recovery and minimize re- traumatization. A trauma-informed approach is a culture shift that requires collaboration among different sectors of public service, such as education, health, law, and social work. (NYS DOH)<\/p>\n<h4>Training of Students<\/h4>\n<p>The District has created age-appropriate handouts that will be given to all school-aged children during the first full week of school. If there is a delay in the process, the handout will be given no later than October 1st.<\/p>\n<h4>Implementation of School Security<\/h4>\n<p>The Saratoga Springs City School District has developed policies and procedures related to school building security, including the following:<\/p>\n<ul>\n<li>All visitors entering school buildings are directed to provide identification, sign in using a visitor management system, and receive identification (printed lapel sticker). Anyone who is found in the building without identification is directed back to the Main Office to sign in.<\/li>\n<li>Each Elementary School has a secured front entrance with a video monitor and remote access hardware.<\/li>\n<li>The MacFadden Administration facility has a secured front entrance with remote access hardware and a video monitor.<\/li>\n<li>The Maple Avenue Middle School has a secured front entrance with a video monitor and remote access hardware.<\/li>\n<li>Visitors to the High School must register with a school representative at the staffed security station before access to the facility is granted. The High School has a secured front entrance with remote access hardware and a video monitor.<\/li>\n<li>Digital video surveillance systems are installed in district facilities. Video surveillance capabilities will be reviewed and expanded as needed.<\/li>\n<li>Security audits are conducted by local law enforcement, local fire department officials, insurance companies and BOCES risk management personnel.<\/li>\n<li>SSCSD policy and procedures are not available to the public, but are available to Building-Level Teams, the District-Level Team, and emergency responders through a secure web portal.<\/li>\n<\/ul>\n<p>Note: Policies and procedures are continually being evaluated and shaped by real life experiences, such as bomb threats, forced entry into the school building with vandalism and outbursts of potentially violent behavior by students.<\/p>\n<h4>Vital Educational Agency Information<\/h4>\n<p>The Saratoga Springs City School District consists of eight education facilities, one administrative facility and a shared maintenance\/transportation facility.<\/p>\n<p>In the event of an emergency within the Saratoga Springs City School District, the Chief Emergency Officer or designee will inform other educational agencies within our borders to the nature of an event that adversely impacts their educational environment.<\/p>\n<h4>Hazard Identification<\/h4>\n<p>The identification of sites of potential emergencies are located in the Maps &amp; Diagrams section of each Building-Level Emergency Response Plan. The location of potential hazards, such as: chemical storage, propane and motor fuel storage, potential fire hazards, electrical hazards, playground equipment, etc. are documented on a building and facility diagram. Potential off-site hazards are identified in the County\/Town Hazard Assessment in each of the plans.<\/p>\n<h2><a id=\"Section-III\"><\/a>Section III: Response<\/h2>\n<h3>A. Notification and Activation of Internal and External Communications<\/h3>\n<ul>\n<li>The district policies and procedures for contacting appropriate law enforcement officials in the event of a violent incident are located in each Building-Level Emergency Response Plan. Each plan identifies individuals who are authorized to initiate contact with local law enforcement agencies. All communications during an incident at the school will flow through the Incident Command Center. Emergency services will be requested through the 911 system.<\/li>\n<li>In the event of an emergency; staff, students, parents, student’s emergency contacts and community members will be notified in one or more of the following manners:\n<ul>\n<li>Telephone (land line and cellular)<\/li>\n<li>Intercom<\/li>\n<li>Runner with verbal message<\/li>\n<li>Automated Notification System<\/li>\n<li>District Radio System<\/li>\n<li>Website<\/li>\n<li>Email<\/li>\n<li>Radio<\/li>\n<li>SMS text message<\/li>\n<li>NaviGate Prepared system<\/li>\n<\/ul>\n<\/li>\n<li>The district has established guidelines for staff and students that in the event that they initially discover an emergency situation, or impending emergency, they will notify the principal and provide them with information on the nature of the event. In the event that the principal cannot be reached, the District Emergency Response Team will be contacted.<\/li>\n<li>Procedures for School Cancellation\/Early Dismissal and Community Notification protocol for contacting parents, guardians, or persons in parental relation to the students in the event of a violent incident or an early dismissal are outlined in each Building-Level Emergency Response Plan. This includes using local media in some instances as well as an Automated Notification System. Buildings may also use a phone tree with emergency contact information provided by student’s parents\/legal guardians.<\/li>\n<\/ul>\n<h3>B. Situational Responses<\/h3>\n<ul>\n<li>The district has developed multi-hazard response plans. These guidelines are present in the Multi-Hazard Emergency Response Action Guidelines in each Building-Level Emergency Response Plan. The emergencies addressed in the plan include, but are not limited to:\n<ul>\n<li>Active Assailant \/ Armed Intruder<\/li>\n<li>Air pollution<\/li>\n<li>Anthrax\/biological threats<\/li>\n<li>Aviation crashes<\/li>\n<li>Biological threats<\/li>\n<li>Bomb\/explosive threats<\/li>\n<li>Building structural failures<\/li>\n<li>Carbon monoxide<\/li>\n<li>Civil disturbances<\/li>\n<li>Crimes against persons<\/li>\n<li>Earthquakes<\/li>\n<li>Electrical system failures<\/li>\n<li>Energy supply losses<\/li>\n<li>Epidemics<\/li>\n<li>Explosions<\/li>\n<li>Fire and alarm activations<\/li>\n<li>Flooding<\/li>\n<li>Hazardous materials<\/li>\n<li>Heating system failures<\/li>\n<li>Hostage\/kidnappings<\/li>\n<li>Incidents off-site<\/li>\n<li>Incidents on-site<\/li>\n<li>Intruders<\/li>\n<li>Loss of facilities<\/li>\n<li>Loss of transportation<\/li>\n<li>Mass casualties<\/li>\n<li>Medical emergencies<\/li>\n<li>Natural gas or propane leaks<\/li>\n<li>Personnel emergencies<\/li>\n<li>Public health threats<\/li>\n<li>Radiological threats<\/li>\n<li>School bus accidents<\/li>\n<li>Severe weather<\/li>\n<li>Threats of violence<\/li>\n<li>Toxic exposure<\/li>\n<li>Water emergencies<\/li>\n<\/ul>\n<\/li>\n<li>Other hazards as determined by the Building Emergency Response Teams<\/li>\n<li>In addition to having plans to address the emergencies, our plans also include procedures that would be used during an emergency. These procedures include, but are not limited to:\n<ul>\n<li>Hold-in-place<\/li>\n<li>Lockout<\/li>\n<li>Lockdown<\/li>\n<li>Shelter-in-place<\/li>\n<li>Fire drills<\/li>\n<li>Evacuation\/relocation<\/li>\n<li>Parent-child reunification<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>The guidelines provide basic instructions for responding to any given incidents, such as:<\/p>\n<ul>\n<li>Contacting emergency response agencies<\/li>\n<li>Moving occupants from an area of danger to an area of safety<\/li>\n<li>Temporary covering of door glass and sidelights during an emergency<\/li>\n<li>Temporary blocking of doors to keep an intruder out during an emergency<\/li>\n<li>Assembling the emergency response team and implementing the incident command system<\/li>\n<li>Notifying school administrators and the District Emergency Response Team of the incident<\/li>\n<li>Community\/parent notification<\/li>\n<li>Sheltering or student release procedures<\/li>\n<li>Post-Incident Response and recovery<\/li>\n<\/ul>\n<h4>Acts of Violence<\/h4>\n<p>Multi-Hazard Emergency Response Action Guidelines in each Building-Level Emergency Response Plan provide guidance on the district’s policies and procedures for responding to direct acts of violence by students, teachers, other school personnel and visitors to the school. The following types of procedures are addressed in the plan, and could be used by the district:<\/p>\n<ul>\n<li>Determine the level of threat with the District Emergency Response Team.<\/li>\n<li>If the situation warrants, isolate the immediate area and evacuate if appropriate.<\/li>\n<li>Inform the Building Principal and District Emergency Response Team.<\/li>\n<li>If necessary, initiate lockdown or lockout procedures and contact the appropriate law enforcement agency.<\/li>\n<li>Monitor the situation; adjust the level of response as appropriate; if necessary, initiate early dismissal, sheltering, or evacuation procedures.<\/li>\n<\/ul>\n<p>Note: The Saratoga Springs City School District &#8220;Code of Conduct&#8221; describes policies and procedures for responding to acts of violence by students, teachers, other school personnel and visitors to the school.<\/p>\n<h4>Responding to Acts of Violence: Implied or Direct Threats<\/h4>\n<p>The Crisis Response Plan and Multi-Hazard Emergency Response Action Guidelines in each Building-Level Emergency Response Plan provides guidance on the district’s policies and procedures for responding to implied or direct threats of violence by students(including to themselves), teachers, other school personnel and visitors to the school. The following types of procedure(s) are addressed in the plan, and could be used by the district:<\/p>\n<ul>\n<li>Contacting parents, guardians, or persons in a parental relation to a student in the event of an implied or direct threat of violence by a student against themselves, including threat of suicide.<\/li>\n<li>The use of staff trained in de-escalation or other strategies to diffuse the situation.<\/li>\n<li>Informing the Building Principal of implied or direct threat.<\/li>\n<li>Determining the level of threat with the District Emergency Response Team.<\/li>\n<li>Contacting the appropriate law enforcement agency, if necessary.<\/li>\n<li>Monitoring the situation, adjusting the district&#8217;s response as appropriate and including possible activation of the District Emergency Response Team.<\/li>\n<\/ul>\n<h4>Response Protocols<\/h4>\n<p>The Incident Command System, Multi-Hazard Emergency Response Action Guidelines in each Building-Level Emergency Response Plan provide guidance on the district&#8217;s policies and procedures for responding to bomb threats, hostage takings, intrusions and kidnapping. The following protocols are provided as examples:<\/p>\n<ul>\n<li>Identification of decision-makers (incident command team).<\/li>\n<li>Plans to safeguard students and staff.<\/li>\n<li>Procedures to provide transportation, if necessary.<\/li>\n<li>Procedures to notify parents.<\/li>\n<li>Procedures to notify media.<\/li>\n<li>Debriefing procedures.<\/li>\n<\/ul>\n<h4>Arrangements for Obtaining Emergency Assistance from Local Government<\/h4>\n<p>A section on Emergency Communications in each Building-Level Emergency Response Plan provides guidance for obtaining assistance during emergencies from emergency services organizations and local government agencies. The following examples are the types of arrangements that could be used by the district:<\/p>\n<ul>\n<li>The Superintendent or their designee in an emergency will contact the Regional Emergency Dispatch Center by calling 911. The dispatcher will determine the appropriate services needed by the school.<\/li>\n<li>The Superintendent or their designee will contact the highest-ranking City and\/or Town officials to provide notification and\/or request assistance.<\/li>\n<\/ul>\n<h4>Procedures for Obtaining Advice and Assistance from Local Government Officials<\/h4>\n<p>The district will utilize procedures outlined in Emergency Communications and the Incident Command System sections in the Building-Level Emergency Response Plans for obtaining advice and assistance from local government officials including the county or city officials responsible for implementation of Article 2-B of the Executive Law. The types of procedures for obtaining advice and assistance from local governments during countywide emergencies could include the following:<\/p>\n<ul>\n<li>Superintendent\/Designee in an emergency will contact emergency management coordinator and\/or the highest-ranking local government official for obtaining advice and assistance.<\/li>\n<li>The district has identified resources for an emergency from the following agencies: Saratoga County Office of Emergency Services, Adirondack Chapter of the American Red Cross, New York State Police, Saratoga County Public Health Department, Saratoga Springs City Police Department, Saratoga County Sheriff&#8217;s Department, and Capital Region BOCES Health Safety Risk Management Services.<\/li>\n<\/ul>\n<h4>District Resources Available for Use in an Emergency<\/h4>\n<ul>\n<li>A District &amp; Building Resources and Supply Inventory is located in each Building-Level Emergency Response Plan which identifies the district’s resources, which may be available during an emergency: such as available facilities, blankets, cots, food supply, communications equipment, fire extinguishers, first aid supplies, flashlights, bull horn, district vehicles and buses.<\/li>\n<\/ul>\n<h4>Procedures to Coordinate the Use of School District Resources and Personnel during Emergencies<\/h4>\n<ul>\n<li>Each Building-Level Emergency Response Plan provides a description of the district&#8217;s procedures to coordinate the use of resources and personnel during emergencies. These sections include the identification of the officials authorized to make decisions and the staff members assigned to provide assistance during emergencies.<\/li>\n<\/ul>\n<h4>Protective Action Options<\/h4>\n<ul>\n<li>Each Building-Level Emergency Response Plan describes the following actions in response to an emergency where appropriate: school cancellation prior to the start of school, early dismissal, evacuation before, during and after school hours, and sheltering procedures.<\/li>\n<\/ul>\n<h2><a id=\"Section-IV\"><\/a>Section IV: Declared State of Emergency Involving a Communicable Disease<\/h2>\n<p>On September 7, 2020, Governor Cuomo signed into law Chapter 168 of the Laws of 2020 that requires public employers, including public school districts, to adopt a continuation of operations plan in the event that the Governor declares a state disaster emergency involving a communicable disease. The legislation (S.8617-B \/ A.10832) amended subdivision 2 of section 2801-a of New York Education Law to require that District Safety Plans include protocols for responding to a declared state disaster emergency involving a communicable disease that are “substantially consistent” with the provisions of section 27-c of the Labor Law. A technical chapter amendment (S.01295 \/ A.009980) to the legislation became effective February 16, 2021 (Chapter 30 of the Laws of 2021).<\/p>\n<p>As per section 27-c of the Labor Law, the operations plan must include, but is not limited to:<\/p>\n<ul>\n<li>A list and description of the types of positions considered essential in the event of a State-ordered reduction of in-person workforce. For this purpose, essential is defined as required to be physically present at a work site to perform their job. Such designation may be changed at any time at the sole discretion of the employer.<\/li>\n<li>A description of protocols the employer will follow in order for nonessential employees to telecommute including, but not limited to, facilitating, or requesting the procurement, distribution, downloading, and installation of any needed technology, including software, data, and the transferring of office phone lines to work or personal cell phones as practicable or applicable to the workplace, and may include devices.<\/li>\n<li>A description of how the employer will, to the extent possible, stagger work shifts of essential employees to reduce overcrowding on public transportation and at worksites.<\/li>\n<li>Protocols the employer will implement to procure personal protective equipment (PPE), defined as equipment worn to minimize exposure to hazards, including gloves, masks, face shields, foot and eye protection, protective hearing devices, respirators, hard hats, and disposable gowns and aprons and, for essential employees, a quantity sufficient to provide PPE to each essential employee to meet their tasks and needs during any given work shift. A plan for storage of equipment and access to equipment must be included.<\/li>\n<li>Protocols in the event an employee is exposed to a known case of the disease, exhibits symptoms of the disease, or tests positive for the disease to prevent the spread or contraction in the workplace. The protocols shall not violate any existing federal, state, or local law regarding sick leave or health information privacy and must include detailed actions to immediately and thoroughly disinfect the work area, common area surface and shared equipment. The protocols must also 3 describe the employer policy on available leave in the event of the need of an employee to receive testing, treatment, isolation, or quarantine.<\/li>\n<li>Protocols for documenting hours and work locations, including off-site visits, for essential employees. The protocol shall be designed only to aid in tracking of the disease and to identify exposed employees and contractors to facilitate the provision of any benefits which may be available.<\/li>\n<li>Protocols for working with the employer’s locality to identify sites for emergency housing for essential employees to further contain the spread of the communicable disease to the extent applicable to the needs of the workplace.<\/li>\n<li>Protocols for implementing any other requirements determined by the Department of Health such as contact tracing or testing, social distancing, hand hygiene and disinfectant, or mask wearing.<\/li>\n<\/ul>\n<p>The employer must consider and respond to recommendations received from the recognized or certified representatives of the employer’s employees in writing, within a reasonable timeframe. A copy of the final version of the plan shall be published in a clear and conspicuous location, and in the employee handbook, and in a location accessible on either the employer’s website or on the internet accessible by employees. No employer shall take retaliatory action or otherwise discriminate against any employee for making suggestions or recommendations regarding the content of the plan. &#8220;Retaliatory action&#8221; is defined as the discharge, suspension, demotion, or discrimination against any employee, or other adverse employment action taken against an employee in the terms and conditions of employment.<\/p>\n<p>A complete copy of the District’s Continuation of Operations plan as it relates to communicable diseases is found in Appendix 2 of this document.<\/p>\n<h2><a id=\"Section-V\"><\/a>Section V: Recovery<\/h2>\n<h3>A. District Support for Buildings<\/h3>\n<ul>\n<li>Each Building-Level Emergency Response Plan provides resources for supporting the Emergency Response Team and Post-Incident Response Team at Saratoga Springs City School District. The District&#8217;s Incident Command System Plan identifies alternates to relieve team members, and interfaces with the Post-Incident Response Plan to provide team members the opportunity to debrief and rehab in a controlled environment. Additionally, members of the Post-Incident Response Team will be provided with sufficient manpower to allow the rotation of personnel, and the opportunity to debrief and rehab in a controlled environment.<\/li>\n<\/ul>\n<h3>B. Disaster Mental Health Services<\/h3>\n<ul>\n<li>The Administrative branch of the Post-Incident Response Team will work through the School Psychologist, School Counseling Leader, and School Nurse to coordinate disaster mental health resources through the County Mental Health Department, community resources, neighboring school districts, and other disaster mental health resources to fully support members of the crisis response team.<\/li>\n<li>A debriefing of the Post-Incident Response Team is an essential part of the recovery phase following an emergency incident. The debriefing will be used in part to evaluate the district&#8217;s plan for possible revisions. The Post-Incident Response Plan was implemented March 1, 2017. (Revised 2023)<\/li>\n<\/ul>\n<h2><a id=\"Section-VI\"><\/a>Section VI: Safety and Security Resources<\/h2>\n<p><strong>School Resource Officers:<\/strong> The Saratoga Springs City School District has collaborative agreements with the Saratoga Springs Police Department and the Saratoga County Sheriff’s Department to provide School Resource Officers to the school district. The agreement and job duties are attached to this document.<\/p>\n<p><strong>Hall Monitors:<\/strong> The Saratoga Springs City School District utilizes hall monitors in the high school and middle school. The hall monitors are to report any issues immediately to a building administrator. The hall monitors’ responsibilities include the supervision of activities in the hallways, checking hall passes, overseeing students exiting and entering the building, reducing vandalism and preventing the use of banned substances in school restrooms.<\/p>\n<p><strong>Grounds Monitors:<\/strong> The Saratoga Springs City School District employs grounds monitors for our high school and middle school; however, they do also attend events and assist with issues that arise at the elementary schools. Their duties include Monitoring the campuses for authorized entry and departure of students and watching for any suspicious activities, monitoring the district-wide camera system, having an active role in drills, working with the School Resource Officers, checking-in visitors and comparing names against the sex offender registry system in the visitor management system, and working with administration on all levels. This position also has staff assigned in the early evenings at schools in the district to monitor events that may draw large numbers of people from the community into our school facilities.<\/p>\n<h3>References<\/h3>\n<p>While linked to the District-Wide Safety Plan, References shall be confidential and shall not be subject to disclosure under Article 6 of the Public Officers Law or any other provision of law, in accordance with Education Law Section 2801-a.<\/p>\n<h4>Reference 1<\/h4>\n<p>The listing of all school buildings covered by the District-Wide Safety Plan with addresses of building and contact names and telephone numbers for building staff is located in each Building-Level Emergency Response Plan.<\/p>\n<h4>Reference 2<\/h4>\n<p>Included in each Building-Level Response Plan is a table identifying the local and state law enforcement organizations that have received copies of the Building-Level Emergency Response Plans.<\/p>\n<h2><a id=\"Appendix\"><\/a>Appendix<\/h2>\n<p><a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/s\/SSCSD-Website-Files\/EdkiQsAL-QRLk1F-BAFGBegBnaNzi_-mV1eSHLYPg65jYA?e=rtGLSq\">Appendix 1A: School Resource Officer contract with the City of Saratoga Springs<\/a><\/p>\n<p><a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/s\/SSCSD-Website-Files\/EZhzu0OK-VNPtPL52x1wKswB76-7Sz6wHzZk54uGOmsdHw?e=M0ijWp\">Appendix 1B: School Resource Officer contract with the County of Saratoga and Renewal Acknowledgement for the 2024-2025 school year<\/a><\/p>\n<ul>\n<li><a href=\"https:\/\/saratogaschools.sharepoint.com\/:b:\/s\/SSCSD-Website-Files\/EYTgPUxVxNlGiYWLcOCk6vUBG0fBLeZjZfM1T9ddB0UeBw?e=DCF0de\">School Resource Officer Contract Renewal <\/a><\/li>\n<\/ul>\n<p>Appendix 2: Pandemic Continuity of Operations Plan for the Saratoga Springs City School District<\/p>\n<p>Appendix 3: Emergency Remote Instruction Plan<\/p>\n<h4>Appendix 2: Pandemic Continuity of Operations Plan for the Saratoga Springs City School District<\/h4>\n<p>This Continuity of Operations Plan (plan) has been developed to meet the requirements of subsection (2)(m) of Education Law §2801-a which requires public employers to prepare a plan for the continuation of operations if the Governor declares a public health emergency involving a communicable disease. This plan is built upon the components of the District-Wide School Safety and the Building-Level Emergency Response Plan(s). The Plan includes elements of COVID-19 Reopening Plan and will be updated regularly to reflect current guidance and best practices. The District Leadership Team assumes responsibility for development and compliance with all provisions of this plan and its implementation.<\/p>\n<p>The district will work closely with the Saratoga County Department of Health (local health department) to determine the need for activation of this plan. The district will report suspected and confirmed cases of communicable diseases (e.g., influenza, coronavirus, etc.) on the monthly Communicable Disease Report, (DMS-485.7\/93; HE-112.4\/81) and submit it to the local health department. Depending on the severity of the disease, the district may be required to report information more frequently and, in another format, (i.e., daily for COVID-19).The local health department will monitor county-wide communicable disease cases and inform school districts as to appropriate actions.<\/p>\n<p>When this plan is activated, the District Leadership Team may invite additional people to the meetings to aid in the planning efforts:<\/p>\n<ul>\n<li>Superintendent<\/li>\n<li>Nursing Supervisor<\/li>\n<li>School nurse(s)<\/li>\n<li>District Doctor and Saratoga County Department of Health<\/li>\n<li>Assistant Superintendent of Information Technology, Operational Innovation and supporting staff<\/li>\n<li>Personnel Development Director<\/li>\n<li>Pupil Services Director<\/li>\n<li>Assistant Superintendent of Business and supporting staff<\/li>\n<li>Facility Director and supporting staff<\/li>\n<li>Food Service Director and supporting staff<\/li>\n<li>Transportation Director and supporting staff (e.g. bus drivers and assistants\/aides)<\/li>\n<li>Director of Community Outreach and Communications<\/li>\n<li>Assistant Superintendent of Curriculum, Instruction, Assessment and Curriculum Directors<\/li>\n<li>Emergency Responders<\/li>\n<\/ul>\n<p>Communication with parents, students, staff, and the school community is important throughout a pandemic outbreak. Communication methods will include postings to the district website, general mailings, email, social media, school communication apps, and the public media. The Director of Community Outreach and Communications has been designated to coordinate this effort. Communications will work closely with the Information Technology Department to ensure proper function of all communication systems.<\/p>\n<p><strong>A. Essential Positions\/Titles<\/strong><\/p>\n<p>The district has developed this plan to prepare for any future government ordered shutdowns that may occur, similar to the coronavirus shutdown in the spring of 2020. Attachment 1 includes a list of essential positions that could be required to be on-site to continue to function as opposed to those positions that could work remotely. The list includes:<\/p>\n<ul>\n<li>Title –a list of positions\/titles considered essential (i.e., could not work remotely) in the event of a state-ordered reduction of in-person workforce.<\/li>\n<li>Description –brief description of job function.<\/li>\n<li>Justification -brief description of critical responsibilities that could not be provided remotely.<\/li>\n<li>Work Shift –brief description of how work shifts of essential employees and\/or contractors will be staggered to reduce overcrowding in the district.<\/li>\n<li>Protocol –how precise hours and work locations, including off-site visits, will be documented for essential employees and contractors.<\/li>\n<\/ul>\n<p>Continuity of operations could be severely impacted by a loss of staff. The table below describes the procedures for maintaining essential functions and services by planning for backup personnel.<\/p>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Administrative Cabinet<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Have decision-making authority for the district.<\/li>\n<li>Make district policies and procedures to reflect crisis response.<\/li>\n<li>Maintain essential functions and responsibilities of back-up personnel.<\/li>\n<li>Meet with staff and monitor their ability to maintain essential functions.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Superintendent<\/li>\n<li>Assistant Superintendents<\/li>\n<li>Curriculum Directors<\/li>\n<li>Director of Facilities, Food service, Transportation, Pupil Services and Personnel Development<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Information Technology Department<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Maintain and keep all essential IT systems working.<\/li>\n<li>Ensure that all staff and students that need an IT device has access to one for remote work.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Assistant Superintendent of Information Technology and Operational Innovation<\/li>\n<li>Other IT Staff<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Business Office<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Monitor utilization of supplies, equipment, contracts, and provided services and adjust, as necessary.<\/li>\n<li>Purchasing.<\/li>\n<li>Payroll.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Assistant Superintendent of Business<\/li>\n<li>Payroll and Benefits Manager<\/li>\n<li>Other Business Office Staff<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Facilities<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Maintain overall function and facilities operation.<\/li>\n<li>Provided building administrators with procedures for maintaining essential building functions (e.g., HVAC system operation, alarms, security, etc.) along with a list of telephone numbers of outside companies and alternates for repair and maintenance of these systems.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Director of Facilities<\/li>\n<li>Assistant Director of Facilities<\/li>\n<li>Other Facilities Staff<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Nurses<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Assist with contact tracing, health screenings and provide additional information for families as needed.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Director of Pupil Services<\/li>\n<li>Nurse Supervisor<\/li>\n<li>Nurses<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Human Resources<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Keep the Business Office informed of staffing issues and of the point at which buildings can no longer be maintained.<\/li>\n<li>Monitors absenteeism and ensures appropriate delegation of authority.<\/li>\n<li>Work with bargaining units to develop the plan for emergency use of personnel in non-traditional functions and changes in the normal workday such as alternate or reduced work hours, working from home, etc.<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Director of Personnel Development<\/li>\n<li>Other Personnel Development Staff<\/li>\n<\/ul>\n<p><strong>Role\/Topic<\/strong><\/p>\n<p>Continuity of Instruction<\/p>\n<p><strong>Task<\/strong><\/p>\n<ul>\n<li>Will be implemented in the event of significant absences or school closure. Alternate learning strategies will include:\n<ul>\n<li>Hard copy, self-directed lessons<\/li>\n<li>Online instruction; on-line resources; on-line textbooks.<\/li>\n<\/ul>\n<\/li>\n<li>Use Learning Management Systems (Canvas and Seesaw).<\/li>\n<\/ul>\n<p><strong>Backups<\/strong><\/p>\n<ul>\n<li>Superintendent<\/li>\n<li>Assistant Superintendents<\/li>\n<li>Curriculum Directors<\/li>\n<li>Building Principals<\/li>\n<li>Teachers<\/li>\n<li>Support Staff<\/li>\n<\/ul>\n<p><strong>B. Working\/Learning Remotely<\/strong><\/p>\n<p>The District will assess the devices and technology needs of all non-essential employees and contractors to enable telecommuting. Options for assessing district needs include stakeholder meetings or surveys to ascertain:<\/p>\n<ul>\n<li>Who will need devices and\/or peripherals at home,<\/li>\n<li>What programs will need to be added to these devices, and<\/li>\n<li>The availability of a viable existing at-home Internet service.<\/li>\n<\/ul>\n<p><strong>C. Staggered Shifts<\/strong><\/p>\n<p>Depending on the exact nature of the communicable disease and its impact, the district is prepared to use the strategies below to reduce traffic congestion and maintain social distancing:<\/p>\n<ul>\n<li>Limiting building occupancy to 25%, 50% or 75% of capacity or the maximum allowable by state or local guidance.<\/li>\n<li>Forming employees work shift cohorts to limit potential contacts.<\/li>\n<li>Limit employees travel within the building and\/or between buildings.<\/li>\n<li>Limit restroom usage to specific work areas.<\/li>\n<li>Stagger arrival and dismissal times.<\/li>\n<li>Alternate workdays or work weeks.<\/li>\n<li>Implement a four-day work week.<\/li>\n<li>Limit or eliminate visitors to the building.<\/li>\n<\/ul>\n<p>The district may need to include additional strategies based on updated federal, state, and local guidance.<\/p>\n<p><strong>D. Personal Protective Equipment (PPE) and Face Coverings<\/strong><\/p>\n<p>The district will procure a six-month supply of face coverings and PPE required for essential work tasks. Disposable PPE will be provided in quantities of at least two pieces per workday.<\/p>\n<p><strong>PPE Type<\/strong><\/p>\n<p>N-95<\/p>\n<p><strong>Task\/Role<\/strong><\/p>\n<ul>\n<li>Nurses\/Nurses&#8217; Aides<\/li>\n<li>Cleaners\/Custodians (based on disinfectants used)<\/li>\n<li>Staff assigned to the &#8220;waiting room&#8221;<\/li>\n<\/ul>\n<p><strong>PPE Type<\/strong><\/p>\n<p>Face Shields<\/p>\n<p><strong>Task\/Role<\/strong><\/p>\n<ul>\n<li>Nurses\/Nurses&#8217; Aides<\/li>\n<li>Special Education<\/li>\n<li>Staff assigned to the &#8220;waiting room&#8221;<\/li>\n<\/ul>\n<p><strong>PPE Type<\/strong><\/p>\n<p>Gowns<\/p>\n<p><strong>Task\/Role<\/strong><\/p>\n<ul>\n<li>Nurses\/Nurses&#8217; Aides<\/li>\n<li>Special Education<\/li>\n<li>Staff assigned to the &#8220;waiting room&#8221;<\/li>\n<\/ul>\n<p><strong>PPE Type<\/strong><\/p>\n<p>Gloves<\/p>\n<p><strong>Task\/Role<\/strong><\/p>\n<ul>\n<li>Nurses\/Nurses&#8217; Aides<\/li>\n<li>Special Education<\/li>\n<li>Cleaners\/Custodians<\/li>\n<li>Maintenance\/Mechanics <\/li>\n<li>Staff assigned to the &#8220;waiting room&#8221;<\/li>\n<\/ul>\n<p><strong>PPE Type<\/strong><\/p>\n<p>Cloth Face Coverings*<\/p>\n<p><strong>Task\/Role<\/strong><\/p>\n<ul>\n<li>All faculty, staff and students<\/li>\n<\/ul>\n<p>*Cloth face coverings are not considered personal protective equipment by OSHA because their capability to protect the wearer is unknown. However, cloth face coverings are important as a source control for Pandemics and provides some protection to the wearer. As such, OSHA strongly encourages workers to wear face coverings.<\/p>\n<p>Those individuals that are required to wear N-95 respirators will be fit-tested and medically screened prior to use to ensure they are physically able to do so. The use of cloth face coverings to reduce the spread of communicable diseases is important to the health and safety of faculty, staff, and students. Cloth face coverings are meant to protect other people incase the wearer is unknowingly infected (asymptomatic) and are essential when physical distancing is difficult. Information will be provided to faculty, staff and students on proper use, removal, and cleaning of cloth face coverings. All faculty, staff and students will be encouraged to utilize their own personal face coverings, but the district will secure and provide face coverings as needed.<\/p>\n<p>PPE and face coverings will be stored in a manner which will prevent degradation. These supplies will be monitored to ensure integrity and track usage rates. District communication on how to access PPE will be provided. <\/p>\n<p><strong>E. Response Protocols for Preventing Spread<\/strong><\/p>\n<p>The District-Wide School Safety Team will meet to determine the need for the activation of a pandemic response based on internal monitoring and correspondence with the local health department and other experts.<\/p>\n<ul>\n<li>The Incident Command Structure at both the District and Building level will be informed that the response effort has been enacted. These individuals will meet to discuss the plan’s activation and review responsibilities and communication procedures.<\/li>\n<li>Communications will work closely with the IT department to re-test all communication systems to ensure proper function. The District-wide School Safety Team and Building-Level Emergency Response Teams will assist in this effort.<\/li>\n<li>An alert will be sent to the school community upon the activation of this plan. The communication will be based on the latest information from the federal, state, and local health authorities.<\/li>\n<li>If the decision is made to close a school building, the district will notify the NYS Education Department and District Superintendent.<\/li>\n<\/ul>\n<p>The district leadership team will oversee and implement all aspects of the district’s reopening plan and any phased-in reopening activities. The district will assign a communicable disease safety coordinator. The coordinator shall be the main contact upon the identification of positive communicable disease cases and are responsible for subsequent communication. The coordinator shall be responsible for answering questions from students, faculty, staff, and parents or legal guardians of students regarding the public health emergency and plans implemented by the school.<\/p>\n<p><strong>Hand Hygiene<\/strong><\/p>\n<p>Faculty, staff, and students will be trained on proper hand hygiene. Information will be provided to parents and\/or legal guardians on ways to reinforce hand hygiene at home. The district will provide stations around the school buildings:<\/p>\n<ul>\n<li>For hand washing: soap, running water, and disposable paper towels.<\/li>\n<li>For hand sanitizing: an alcohol-based hand sanitizer containing at least 60% alcohol for areas where hand washing facilities may not be available or practical.<\/li>\n<li>Accommodations for students who cannot use hand sanitizer will be made.<\/li>\n<\/ul>\n<p><strong>Communicable Disease Exposures<\/strong><\/p>\n<p>The district must be prepared for communicable disease outbreaks in their local communities and for individual exposure events to occur in their facilities, regardless of the level of community transmission. The Centers for Disease Control and Prevention (CDC) and New York State Department of Health (NYSDOH) have provided recommendations for strategies to follow after an exposure:<\/p>\n<ul>\n<li>Close off areas used by a sick person and not using these areas until after cleaning and disinfection has occurred;<\/li>\n<li>Open outside doors and windows to increase air circulation in the area.<\/li>\n<li>Wait at least 24 hours before cleaning and disinfection. If waiting 24 hours is not feasible, wait as long as possible;<\/li>\n<li>Clean and disinfect all areas used by the person suspected or confirmed to have a communicable disease, such as offices, classrooms, bathrooms, lockers, and common areas.<\/li>\n<li>Once the area has been appropriately cleaned and disinfected it can be reopened for use.<\/li>\n<li>Individuals without close or proximate contact with the person suspected or confirmed to have a communicable disease can return to the area and resume school activities immediately after cleaning and disinfection.<\/li>\n<li>If more than seven days have passed since the person who is suspected or confirmed to have a communicable disease visited or used the facility, additional cleaning or disinfection is not necessary, but routine cleaning and disinfection should continue.<\/li>\n<\/ul>\n<p><strong>Returning after Illness<\/strong><\/p>\n<p>The district has established protocols and procedures, in consultation with the local health department(s), about the requirements for determining when individuals, particularly students, who screened positive for communicable disease symptoms can return to the in-person learning environment at school. This protocol includes:<\/p>\n<ul>\n<li>Documentation from a health care provider following evaluation<\/li>\n<li>Negative COVID-19 diagnostic test result<\/li>\n<li>Symptom resolution, or if positive for a communicable disease, release from isolation<\/li>\n<\/ul>\n<p>The district will refer to the NYSDOH’s “<a href=\"http:\/\/www.nysed.gov\/coronavirus\/guidance-p-12-schools\">Pre-K to Gr 12 COVID-19 Toolkit<\/a>” and other applicable guidance regarding protocols and policies for faculty, staff, and students seeking to return to work after a suspected or confirmed communicable disease case or after the faculty or staff member had close or proximate contact with a person with a communicable disease. The district requires that individuals who were exposed to a communicable disease complete quarantine and have no symptoms before returning to in-person learning. The discharge of an individual from quarantine and return to school will be conducted in coordination with the local health department.<\/p>\n<p><strong>Cleaning\/Disinfecting<\/strong><\/p>\n<p>The district will ensure adherence to hygiene and cleaning and disinfection requirements as advised by the CDC and NYSDOHAttachment 2 describes cleaning and disinfection protocols and procedures for the district. Regular cleaning and disinfection of the facilities will occur, including more frequent cleaning and disinfection for high-risk and frequently touched surfaces. This will include desks and cafeteria tables, which will be cleaned and disinfected between each individual’s use. Cleaning and disinfection will be rigorous and ongoing and will occur at least daily, or more frequently as needed.<\/p>\n<p>The district will ensure regular cleaning and disinfection of restrooms. Restrooms will be cleaned and disinfected more often depending on frequency of use.<\/p>\n<p><strong>F. Contact Tracing Supports<\/strong><\/p>\n<p>The district will notify the state and local health department immediately upon being informed of any positive communicable disease diagnostic test result by an individual within school facilities or on school grounds, including students, faculty, staff, and visitors of the district. Districts may assist with contact tracing by:<\/p>\n<ul>\n<li>Keeping accurate attendance records of students and staff members<\/li>\n<li>Ensuring student schedules are up to date<\/li>\n<li>Keeping a log of any visitor which includes date and time, and where in the school they visited<\/li>\n<li>Assisting the local health departments in tracing all contacts of the individual in accordance with the protocol, training, and tools provided through the NYS Contact Tracing Program<\/li>\n<\/ul>\n<p>The district, in consultation with the local health department, will determine what process will be followed when communicable disease cases are discovered in the school (e.g., how many individuals will be quarantined, closing of areas or classrooms, etc.). Confidentiality must be maintained as required by federal and state laws and regulations. School staff should not try to determine who is to be excluded from school based on contact without guidance and direction from the local health department.<\/p>\n<p><strong>G. Housing for Essential Employees<\/strong><\/p>\n<p>Emergency housing for essential workers is not considered to be required for school faculty and staff. The need for emergency housing will be determined with direction from the local department of health.<\/p>\n<p><strong>Recovery<\/strong><\/p>\n<p>Re-establishing the normal school curriculum is essential to the recovery process and should occur as soon as possible. The district will:<\/p>\n<ul>\n<li>Work toward a smooth transition from the existing learning methods to the normal process.<\/li>\n<li>Use the described communication methods to keep the school community aware of the transition process.<\/li>\n<li>Work closely with the New York State Education Department to revise or amend the school calendar as deemed appropriate.<\/li>\n<li>Evaluate all building operations for normal function and re-implement appropriate maintenance and cleaning procedures.<\/li>\n<\/ul>\n<p>Each Building-Level Post-incident Response Team will assess the emotional impact of the crisis on students and staff and make recommendations for appropriate intervention. The District-Wide School Safety Team and Building-Level Emergency Response Teams will meet to de-brief and determine lessons learned with input from all essential functions. The District-Wide School Safety Plan and Building-Level Emergency Response Plans will be updated accordingly. Curriculum activities that may address the crisis will be gathered or developed as appropriate.<\/p>\n<p><strong>Attachment 1: <\/strong>Essential positions that could be required to be on-site.<\/p>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Information Technology\/Continuity of Operations and Instruction<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Assistant Superintendent of Information Technology and Operational Innovation<\/li>\n<li>IT Infrastructure Team<\/li>\n<li>IT Support Specialist<\/li>\n<li>IT Support Technicians<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>Assistant Superintendent of Information Technology and Operational Innovation and IT Infrastructure Team:<\/p>\n<ul>\n<li>Responsible for overseeing the local area network and the subsequent ongoing maintenance of this network for the district. Oversees the district’s internet access, phone systems, and cell phone plans.<\/li>\n<\/ul>\n<p>IT Support Specialist and IT Support Technicians:<\/p>\n<ul>\n<li>Responsible for providing support to teachers and students regarding computer hardware and software. Will respond to “help desk” and troubleshooting concerns.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Facilities and Operations<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Director and Assistant Director of Facilities<\/li>\n<li>Head Custodians <\/li>\n<li>Custodians<\/li>\n<li>Maintenance Workers<\/li>\n<li>Groundskeeper(s)<\/li>\n<li>Maintenance and Grounds Supervisors<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>Director and Assistant Director of Facilities:<\/p>\n<ul>\n<li>Responsible for overseeing and providing direction to the facilities department and employees to ensure a safe working environment.<\/li>\n<\/ul>\n<p>Head Custodians, Custodians, Maintenance Workers, Groundskeeper(s), Maintenance and Grounds Supervisors:<\/p>\n<ul>\n<li>Responsible for routine cleaning, disinfecting and maintenance tasks.<\/li>\n<li>Responsible for performing a wide variety of tasks related to the maintenance and upkeep of campus grounds, parking lots and fields.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>District Office<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Superintendent of Schools<\/li>\n<li>Assistant Superintendents<\/li>\n<li>Business Office Staff<\/li>\n<li>Director of Personnel Services<\/li>\n<li>Director of Pupil Services<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>Superintendent of Schools:<\/p>\n<ul>\n<li><span>Responsible for <\/span><span>making day<\/span><span>&#8211;<\/span><span>to<\/span><span>&#8211;<\/span><span>day decisions about <\/span><span>educational programs, budget\/spending, staff, and <\/span><span>facilities.<\/span><\/li>\n<\/ul>\n<p>Assistant Superintendents:<\/p>\n<ul>\n<li>Responsible for assisting the Superintendent in the administration of educational programming and the development of goals to foster school improvement.<\/li>\n<\/ul>\n<p>Business Office Staff<\/p>\n<ul>\n<li>Responsible for assisting administration to provide essential services with the financial resources available.<\/li>\n<\/ul>\n<p>Director of Personnel Services<\/p>\n<ul>\n<li>Responsible for assisting the school district as a liaison to district personnel, providing guidance for personnel functions, and ensuring the complete and effective compliance with personnel policies, protocols, and practices.<\/li>\n<\/ul>\n<p>Director of Pupil Services:<\/p>\n<ul>\n<li>Responsible for oversight of health services, psychological services, therapy services, education of disabled students, child abuse and neglect, and English as a second language.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Health Office\/Health Services<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Nursing Supervisor<\/li>\n<li>School Nurse<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>Nursing Supervisor:<\/p>\n<ul>\n<li>Assists building and district administrators by communicating with the local health department for guidance, may act as the liaison to the school physician, and is responsible for assisting other nurses in assessing ill students and staff.<\/li>\n<\/ul>\n<p>School Nurse:<\/p>\n<ul>\n<li>Responsible for assessing ill students and staff and assisting in contact tracing efforts<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>School Building Main Office Staff<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>School Secretary<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>School Secretary:<\/p>\n<ul>\n<li>Responsible for answering phones, providing support to building administrators, responding to emails, greeting visitors, assisting in building sign-in procedures, accepting deliveries, and helping disseminate mail.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Food Service<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Director and Assistant Director of Food Service<\/li>\n<li>Food Service Employees<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<p>Director and Assistant Director of Food Service:<\/p>\n<ul>\n<li>Responsible for overseeing the preparation of meals and coordinating with the Transportation Director to ensure that meals are disseminated.<\/li>\n<\/ul>\n<p>Food Service Employees:<\/p>\n<ul>\n<li>Responsible for the preparation of and making of meals for students.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Transportation<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Transportation Director and Assistant Director of Transportation<\/li>\n<li>Transportation Bus and Maintenance Staff<\/li>\n<\/ul>\n<p><strong>Justifications for Each<\/strong><\/p>\n<p>Transportation Director and Assistant Director of Transportation:<\/p>\n<ul>\n<li>Responsible for the safety and efficient operation and maintenance of the transportation department. Coordinates with the Food Service Manager on meal deliveries.<\/li>\n<\/ul>\n<p>Transportation Bus and Maintenance Staff:<\/p>\n<ul>\n<li>Maintain district vehicle fleet and assist with transportation as required.<\/li>\n<\/ul>\n<p><strong>Essential Function<\/strong><\/p>\n<p>Building Administrators<\/p>\n<p><strong>Essential Positions\/Titles<\/strong><\/p>\n<ul>\n<li>Building Principals (Only if this position will not be fully remote)<\/li>\n<\/ul>\n<p><strong>Justification for Each<\/strong><\/p>\n<ul>\n<li>Responsible for overseeing the day-to-day functioning of the school community and supporting the academic success of students, promoting a positive school climate, and assisting educators.<\/li>\n<\/ul>\n<p><strong>Attachment 2- Cleaning and Disinfection Protocols and Procedures<\/strong><\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Classrooms<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; staff and teachers<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Doors, desks, chairs and floors<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Restrooms<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>2x daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>2x daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Doors and sinks will be done at least twice daily. Floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Health Offices\/Isolation Rooms<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Nursing staff; Custodial staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Cots, bathrooms and health office equipment will be cleaned after each use. Floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Breakrooms<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Doors, tables, chairs and floors<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Cafeterias\/Kitchens<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Food Service Staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Tables and chairs will be cleaned\/disinfected in between each group&#8217;s use. Floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Outside Seating Areas<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; staff and teachers<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Tables and chairs will be cleaned\/disinfected in between each group&#8217;s use. Floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Computer Labs<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Various<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; staff and teachers<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Equipment to be cleaned\/disinfected between each use. Doors, tables, chairs and floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Science Labs<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; staff and teachers<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Equipment to be cleaned\/disinfected between each use. Doors, tables, chairs and floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Maintenance Office and Work Areas<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Doors, desks, chairs and floors<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Bus Garage<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; Transportation staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Bathroom, doors, desks, chairs and floors<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Libraries<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; Librarians<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Equipment to be cleaned\/disinfected between each use. Doors, tables, chairs and floors will be done once daily.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Playgrounds<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>As needed<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>School Buses<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Transportation staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>High contact spots will be cleaned after each run. Disinfecting will occur 1x daily between AM\/PM runs.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>School Vehicles<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Staff using vehicles<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Administrative Offices<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>Daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff and staff<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>Doors, desks, chairs and floors.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Large Meeting Areas (e.g., gymnasiums, auditoriums, music rooms)<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>These areas are not going to be used. When these areas will be returned to use, then an appropriate frequency for cleaning\/disinfection will be established.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Athletic Training Rooms<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>N\/A<\/p>\n<p><strong>Additional Information<\/strong><\/p>\n<p>These areas are not going to be used. When these areas will be returned to use, then an appropriate frequency for cleaning\/disinfection will be established.<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Frequently touched surfaces (e.g., doorknobs, light switches, elevator buttons, copy machine buttons, handles, etc.)<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>2x daily<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>2x daily<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Custodial staff; staff and teachers<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Shared frequently touched surfaces (e.g., keyboards, desks, phones, laptops, tablets, remote controls, etc.)<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Staff using shared devices<\/p>\n<p><strong>Room Types\/Areas<\/strong><\/p>\n<p>Shared equipment (e.g., hand tools, facilities equipment, groundskeeping equipment, golf cart, etc.)<\/p>\n<p><strong>Cleaning Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Disinfection Frequency<\/strong><\/p>\n<p>After each use<\/p>\n<p><strong>Responsible Party<\/strong><\/p>\n<p>Staff using equipment<\/p>\n<p>Only district approved chemicals will be used. At no time will students be allowed use cleaners or disinfectant.<\/p>\n<h3><strong><a id=\"remote-instruction\"><\/a>Appendix 3: Emergency Remote Instruction Plan K-12<\/strong><\/h3>\n<p><em>This appendix addresses the 2022-2023 amendments of Sections 100.1, 155.17, and 175.5 of the Regulations of the Commissioner of Education Relating to Remote Instruction and its Delivery under Emergency Conditions, and the amendments of Sections 200.7, 200.16, and 200.20 of the Regulations of the Commissioner of Education Relating to Remote Instruction and its Delivery Under Emergency Conditions and Length of School Day for Approved School-Age and Preschool Programs Serving Students with Disabilities.<\/em><\/p>\n<p><strong>NYSED Emergency Remote Plan Requirements<\/strong><\/p>\n<p><a href=\"https:\/\/www.nysed.gov\/memo\/edtech\/emergency-remote-instruction-plan-guidance\">Emergency Remote Instruction Plan Guidance | New York State Education Department (nysed.gov)<\/a><\/p>\n<ol>\n<li>Policies and procedures to ensure computing devices will be made available to students or other means by which students will participate in synchronous instruction;<\/li>\n<li>Policies and procedures to ensure students receiving remote instruction under emergency conditions will access internet connectivity;<\/li>\n<li>Expectations for school staff as to the proportion of time spent in synchronous and asynchronous instruction of students on days of remote instruction under emergency conditions with an expectation that asynchronous instruction is supplementary to synchronous instruction;<\/li>\n<li>A description of how instruction will occur for those students for whom remote instruction by digital technology is not available or appropriate;<\/li>\n<li>A description of how special education and related services will be provided to students with disabilities and preschool students with disabilities, as applicable, in accordance with their individualized education programs to ensure the continued provision of a free appropriate public education; and<\/li>\n<li>For school districts that receive foundation aid, the estimated number of instructional hours the school district intends to claim for State aid purposes for each day spent in remote instruction due to emergency conditions pursuant to section 175.5 of this Chapter.<\/li>\n<\/ol>\n<p><strong><u>INTRODUCTION<\/u><\/strong><\/p>\n<p>The Saratoga Springs City School District (SSCSD) developed the following Emergency Remote Instruction Plan to address the instruction of students if extraordinary circumstances prevent students and staff from physically attending school. The Emergency Remote Instruction Plan meets the requirements of New York State Education Commissioner’s Regulations for inclusion in the 2023-2024 District-Wide School Safety Plan. Additionally, the plan adheres to guidance set forth in the following Board of Education policies: 5100 Student Attendance, 5300 District Code of Conduct, 8630 Computer Resources and Data Management, 8635 Information and Data Privacy Security, Breach and Notification Staff Use of District Technology and Student Use of District Technology.<\/p>\n<p><strong> <u>BACKGROUND INFORMATION<\/u><\/strong><\/p>\n<p>The NYS Education Department (NYSED) authorized a “snow day pilot” program during the Covid-19 pandemic 2020-2021 and 2021-2022 school years. This program allowed school districts to deliver instruction remotely on days in which they would otherwise have closed due to an emergency.<\/p>\n<p>To give districts greater predictability, in September 2022, the NYSED Board of Regents amended section 175.5(e) of the Commissioner’s regulations to codify this flexibility. Districts that would otherwise close due to an emergency may, <strong>but are not required to<\/strong>, remain in session and provide instruction through remote learning and count these instructional days towards the annual hours requirement for State Aid purposes. Instruction must be provided to all students and be consistent with the definition of remote instruction, as explained below. In addition, beginning with the 2023-2024 school year, such instruction must be consistent with the school district’s Emergency Remote Instruction Plan.<\/p>\n<p>NYSED also amended section 155.17 of the Commissioner’s regulations to require public schools, BOCES, and county vocational education and extension boards amend their District-wide School Safety Plans to include plans for remote instruction beginning with the 2023-2024 school year. This gives the public an opportunity to provide feedback on such plans for remote instruction prior to their adoption. The Emergency Remote Instruction Plan must include the methods that the school district will ensure the availability of: devices; internet access; provision of special education and related services for students with disabilities; the expectations for time spent in different remote modalities.<\/p>\n<p>Such plans also require that each chief executive officer of each educational agency located within a public school district report information on student access to computing devices and access to the internet each year.<\/p>\n<p>NYSED additions to section 100.1 of the Commissioner’s regulations define the term “remote instruction.” This definition identifies various ways in which remote instruction may be delivered, but which must include, in all situations, regular and substantive teacher-student interaction with an appropriately certified teacher.<\/p>\n<p>The NYS Board Regents adopted the amendments noted above that became effective as a permanent rule on September 28, 2022.<\/p>\n<p>Sections 200.7, 200.16, and 200.20 of the Regulations of the Commissioner of Education were amended, and became effective September 13, 2022, and December 12, 2022, as an emergency action for the preservation of the general welfare to permit approved special education providers to provide remote instruction in the 2022-2023 school year on days they would otherwise close due to an emergency and to count such instructional days towards 14 minimum requirements and to identify the ways in which such remote instruction may be delivered. These amendments relate to remote instruction and its delivery under emergency conditions for students in approved private schools for the education of students with disabilities, state-supported schools, state-operated schools, and approved preschool special education programs. These updated regulations now provide the same flexibility for remote instruction under emergency conditions that was given to school districts. The effective date of the final rule was January 25, 2023.<\/p>\n<p><strong><u>REMOTE INSTRUCTION<\/u><\/strong><\/p>\n<p>The Commissioner&#8217;s regulations define remote instruction as <em>“instruction provided by an appropriately certified teacher, or in the case of a charter school an otherwise qualified teacher pursuant to Education Law §2854(3)(a-1), who is not in the same in-person physical location as the student(s) receiving the instruction, where there is regular and substantive daily interaction between the student and teacher.<\/em>” For the purpose of this plan, remote instruction means the instruction occurring when the student and the instructor are in different locations due to the closure of one or more of the district&#8217;s school buildings due to emergency conditions as determined by the Superintendent of Schools. Emergency conditions include, but are not limited to, extraordinary adverse weather conditions, impairment of heating facilities, insufficient water supply, prolonged disruption of electrical power, shortage of fuel, destruction of a school building, shortage of transportation vehicles, or a communicable disease outbreak, and the school district would otherwise close due to such an emergency. <\/p>\n<p><strong><u>UNSCHEDULED SCHOOL DELAYS AND EARLY RELEASES<\/u><\/strong><\/p>\n<p>Instructional hours that a school district scheduled but did not execute, either because of a delay to the start of a school day or an early release, due to emergency conditions, may still be considered as instructional hours for State aid purposes for up to two instructional hours per session day, provided the School Superintendent certifies such to NYSED, on the prescribed NYSED form, that an extraordinary condition existed on a previously scheduled session day and that school was in session on that day (<a href=\"https:\/\/govt.westlaw.com\/nycrr\/Document\/I09a7ee65c22211dda1bb852bdc84e3be?viewType=FullText&amp;originationContext=documenttoc&amp;transitionType=CategoryPageItem&amp;contextData=(sc.Default)\">NYSED Part 175.5<\/a>).<\/p>\n<p>The Emergency Remote Instruction Plan shall identify various ways in which instruction may be delivered, including synchronous and asynchronous instruction. In all situations, remote instruction requires regular and substantive teacher-student interaction with an appropriately certified teacher. <\/p>\n<p>Synchronous instruction engages students in learning in the direct presence (remote or in-person) of a teacher in real time. During remote instruction, students and teachers attend together from different locations using technology. Asynchronous instruction is self-directed learning that students engage in learning without the direct presence (remote or in-person) of a teacher. Students access class materials during different hours and from different locations. During an emergency closing, synchronous instruction is the preferred method of instruction, whereas asynchronous instruction is considered supplementary instruction.  <\/p>\n<p><strong><u>ENSURING ACCESSIBILITY AND AVAILABILITY (INTERNET, COMPUTERS\/DEVICES)<\/u><\/strong><\/p>\n<p>The SSCSD shall survey families to find out who has a reliable high-speed internet connection. A survey conducted in 2020 identified families who live in the district that do not have access, therefore remote learning is a challenge, if not impossible, for these students. Since 2020, every student who enrolls in the district provides information on internet access and computer accessibility. When students do not have internet access, the district works with the families to develop a plan to provide instructional materials for them as well as a process for recording attendance and grading.  The district works with the community to provide locations where internet access could be used if they are able to use these locations. <\/p>\n<p>Commissioner’s regulation 115.17(f) outlines the annual data collection that districts must submit to SED every year by June 30. It requires the school district to survey families regarding internet and device access at the student’s place(s) of residence. The chief executive officer (School Superintendent) shall survey students and parents and persons in parental relation to such students to obtain information on student access to computing devices and access to internet connectivity. <\/p>\n<p>District procedures are followed to ensure computing devices are made available to students or other means by which students will participate in synchronous instruction.<\/p>\n<p><strong>POLICIES<\/strong><\/p>\n<p>The plan adheres to guidance set forth in the following Board of Education policies:  5100 Student Attendance, 5300 District Code of Conduct, 8630 Computer Resources and Data Management, 8635 Information and Data Privacy Security, Breach and Notification Staff Use of District Technology and Student Use of District Technology.<\/p>\n<p><strong>DIGITAL DEVICE AND INTERNET ACCESS<\/strong><\/p>\n<p>The school district provides all students in grades K-12 access to a personal computing device (i.e. iPad or Cloudbook).  In the event of an emergency, closing provisions will be made to the greatest extent possible to ensure that all students have their device at home for instruction.<\/p>\n<p>The school district participates fully in the SED Digital Access Survey along with locally developed surveys to assess how many students have internet access at home.  The district provides hotspots to any families that indicate a need for reliable internet to facilitate access to learning at home.<\/p>\n<p>All faculty should have an alternative general activity for students in the instance that widespread power outages or other disruptions to connectivity occur preventing synchronous connection. If students lose connectivity, then the expectation is they will complete the alternate assignment provided.  <\/p>\n<p><strong>PEDAGOGY<\/strong><\/p>\n<p>All teachers in grades K-12 will use Zoom as their primary instructional platform. <\/p>\n<p>Teachers in grades K-5 will use Seesaw as their communication platform with students. Students will access all apps through their CLEVER accounts.<\/p>\n<p>Teachers in grades 6-12 will use CANVAS as their communication platform. Students will access all apps through their CLEVER accounts.<\/p>\n<p>Several district provided instructional technology software programs are available to support instruction along with a wide array of other resources curated by faculty.  Teachers will utilize these programs to differentiate instruction, accessing a variety of delivery methods that best suit their course, grade level, and teaching style. <strong> <\/strong>The instructional approach <strong>may include a combination of:<\/strong><\/p>\n<p><strong><u>Synchronous “Live” Instruction<\/u><\/strong> &#8211; Using ZOOM along with other digital platforms, teachers will deliver real time instruction to a full group or subset of students. Teachers may incorporate asynchronous or project based opportunities within this model.<\/p>\n<p><strong><em>Teachers will make personal connections with all students during scheduled class times via <\/em><\/strong>ZOOM<strong><em>.  These connections will allow teachers to take attendance, introduce new content or skills and will allow students to connect with their teachers and peers in order to be guided through lessons, ask questions, and maintain personal relationships. The duration of these synchronous connections depends on the grade level and daily instructional plan but should be the primary mode of instruction and substantial enough to guide learning.<\/em><\/strong><\/p>\n<p><strong><u>Asynchronous “Flipped” Instruction<\/u><\/strong><strong> &#8211; <\/strong>Using a variety of NYS Education Law 2D approved digital platforms, teachers will deliver captured or recorded lessons with associated expectations for students’ participation and assignment completion (i.e. “Flipped Classroom”).  These activities may include teacher\/student synchronous interactions for a portion of the lesson.<\/p>\n<p><strong><u>Authentic Independent Instruction<\/u><\/strong> &#8211; Using a variety of methods, teachers will engage students in high quality learning activities.  These activities must engage students in the learning process.  Teachers will provide assistance to students in this mode of instruction through asynchronous and synchronous methods outlined above.<\/p>\n<p>Teachers may participate in professional learning opportunities offered throughout the year by the district and other professional organizations regarding instructional technology and best practices in remote teaching and learning.<\/p>\n<p><strong>STUDENT EXPECTATIONS<\/strong><\/p>\n<p>All students will receive information on how to access course material and instruction from their teachers.  Students are expected to follow all directions and requests to participate in instruction to the fullest extent possible.  During synchronous instruction students are expected to be school ready.  This includes being on time for class, engaging fully through video and audio as directed by their teacher, and presenting themselves in a manner that is in accordance with school expectations.  <br \/>\n<span style=\"font-size: 1rem;\">All students are expected to practice appropriate digital etiquette and responsible behavior during assigned ZOOM meetings:<\/span><\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>Mute yourself on meets as directed by your teacher<\/li>\n<li><strong>Cameras are to be kept on during classroom meets<\/strong> unless otherwise directed by the teacher.<\/li>\n<\/ul>\n<\/li>\n<li>Students are expected to work in an appropriate setting when participating remotely \/ on-line. Work places include a desk, table, kitchen counter, etc&#8230; Other locations are not appropriate or acceptable.<\/li>\n<li>Student dress must be appropriate in all platforms &#8211; the Student Dress Code section of the Student Handbook \/ Code of Conduct applies to students in all platforms.<\/li>\n<\/ul>\n<p>If there are any circumstances preventing full and appropriate participation the student\/parent or guardian should let the teacher know.  As this is a required attendance day, students must fulfill expectations for satisfactory participation as determined by their teacher.<\/p>\n<p><strong>DAILY <\/strong><strong>SCHEDULE<\/strong><\/p>\n<p>The virtual day will follow the same schedule framework as the HS, MS and Elementary School to which the student is assigned.   As with all school schedules, appropriate breaks will be included in the daily schedule for students and faculty, including time for lunch.  Students will attend all assigned classes at their scheduled time.  The method of instructional delivery will vary to facilitate appropriate screen time per age level within these parameters.<\/p>\n<p>MS and HS teachers may be available for academic support during Flex time and after block 4 on designated days per week (these two days are defined at the start of each school year).<\/p>\n<p><strong>COMMUNICATION PROTOCOL: INTERVENTION<\/strong><\/p>\n<p>Teachers will follow the same communication protocols that are established in school for addressing areas of academic or behavioral need.  This includes a combination of email, phone calls, and academic\/behavioral referrals to the administration.  All effective strategies should be accessed to maintain effective communication.<\/p>\n<p><strong>SPECIAL SERVICES<\/strong><\/p>\n<p>School districts are required to implement supports, services and accommodations, as indicated in students’ IEPs or 504 Accommodation Plans, to the best of their ability.  NYSED recognizes that there may be limitations to implementing certain services or accommodations through remote instruction and as a result, encourages districts to apply a “lens of reasonableness” to their approach. <em>Please see page 11 for specific guidelines.<\/em>  <\/p>\n<p><strong>NON- INSTRUCTIONAL SERVICES<\/strong><\/p>\n<ul>\n<li><strong>TRANSPORTATION<\/strong><\/li>\n<li><strong>FOOD SERVICE<\/strong><\/li>\n<li><strong>MAINTENANCE<\/strong><\/li>\n<li><strong>CUSTODIAL<\/strong><\/li>\n<li><strong>CLERICAL\/ ADMINISTRATIVE SUPPORT<\/strong><\/li>\n<\/ul>\n<p>When a school district is in remote session, non-instructional services may still be required to report to work to perform critical services related to their area of expertise. In the event that the change to remote instruction is due to a snow or other weather emergency, such change will likely impact transportation and other critical services.  Decisions on whether or not non-instructional employees should report to work will be made and communicated in real time by the appropriate supervisor or administrator based on whether services can be provided in a safe and efficient manner.<\/p>\n<p><strong><u>INSTRUCTIONAL HOURS FOR STATE AID AND REPORTING REQUIREMENTS<\/u><\/strong><\/p>\n<p>Pursuant to Section 175.5 of Education Law, the school district may decide to transition to remote instruction in the event emergency conditions dictate the closure of the PreK through Grade 12 facilities. Under the provisions of New York State Education Law and the District Emergency Remote Instruction Plan any instruction sessions provided during the closure of the school facilities are counted towards annual hour requirements for meeting 180 days required for State financial aid.<\/p>\n<p>Annual Hourly Requirements for the purpose of apportionment of State Aid (for districts receiving foundation aid) are noted below:<\/p>\n<ul>\n<li>450 instructional hours for pupils in half-day kindergarten<\/li>\n<li>900 instructional hours for pupils in full-day kindergarten and grades one through six<\/li>\n<li> 990 instructional hours for pupils in grades seven through twelve<\/li>\n<\/ul>\n<p>The district estimates the number of instructional hours it intends to claim for State aid purposes for each day spent in remote instruction due to emergency conditions from a minimum of 1 remote instruction day due to emergency conditions, up to the full year’s annual hourly requirement. A district remote instructional day is the same number of hours as an in-person instructional day. The actual hours of the instructional day are discussed throughout the year with representative leadership groups.<\/p>\n<p>For example, if the school district has two (2) remote instructional days in a school year, then it will claim an estimated total hours for State Aid purposes due to emergency conditions as follows:<\/p>\n<ol>\n<li>Grades K-5: 6 hours, 10 minutes X 2 days = 12 hours, 20 minutes<\/li>\n<li>Grades 6-8: 6 hours, 30 minutes X 2 days = 13 hours<\/li>\n<li>Grades 9-12: 6 hours, 32 minutes X 2 days = 13 hours, 4 minutes<\/li>\n<li><strong> <\/strong>For a district-wide estimated total of 38 hours<u>,<\/u> 24 minutes<\/li>\n<\/ol>\n<p><strong><u>TRANSPORTATION<\/u><\/strong><\/p>\n<p>When a school district is in remote session, pupil transportation must be provided to students attending religious and independent schools, charter schools or students whose individualized education program (IEP) have placed them out of district. If the change to remote instruction is due to a snow or other weather emergency, such change will likely impact transportation for students attending school outside of the district. Decisions not to transport need to be based on real-time information relevant to the safety of students, staff and vehicles. School districts and religious and independent schools, charter schools and other programs are encouraged to work together to ensure continuity of education while ensuring that transportation can be provided in a safe and efficient manner.<\/p>\n<p><strong><u>REPORTING<\/u><\/strong><\/p>\n<p>IMMEDIATELY <\/p>\n<p>Whenever a school building must close to instruction due to the activation of its District-wide School Safety Plan or Building-level Emergency Response Plan, a <em>Report of School Closure<\/em> must be submitted to the Commissioner of Education by the School Superintendent, (or designee) as required under CR 155.17(f) via the NYSED Report of School Closure portal. Even when remote instruction is provided during an emergency closure, a <em>Report of School Closure<\/em> must be submitted. This also applies when instruction can be delivered in an interim location or via another instructional modality. <\/p>\n<p>When it is determined that it is safe to re-open a school building after an emergency closure, the School Superintendent must notify the Commissioner by completing a corresponding <em>Report of School Re-Opening<\/em>, via the NYSED Report of School Re-Opening portal.<\/p>\n<p>The <em>Report of School Closure<\/em> is intended to provide immediate notification to the Commissioner regarding an emergency closure. The <em>Report of School Re-Opening<\/em> notifies the Commissioner of the re-opening and also collects the actual duration of the closure, the location and modality of instruction, and detailed information that may not have been available at the time of the closure.  <\/p>\n<p>Reasons for building closures may include, but are not limited to, natural disasters, power outages, instances of infectious disease, extraordinary adverse weather conditions and threats of violence. It is no longer required to submit a <em>Report of School Closure<\/em> for routine snow days.<\/p>\n<p>ANNUALLY BY JUNE 30<sup>TH<\/sup><\/p>\n<p>The School Superintendent shall notify the NYSED Commissioner the results of the survey on student access to computing devices and access to internet connectivity through the Student Information Repository System (SIRS) every year by June 30<sup>th<\/sup>.<\/p>\n<p>END OF THE SCHOOL YEAR<\/p>\n<p>The school district shall report Emergency Remote Instruction through the State Aid Management System at the end of the school year. After the close of the school year starting with the ending of 2023-2024, the School Superintendent reports remote instructional days under emergency conditions through the State Aid Management System and certifies this at the time NYSED’s <em>Form A<\/em> is submitted as part of other required certifications. Using the NYSED prescribed form, the School Superintendent certifies to NYSED:<\/p>\n<ul>\n<li>That an emergency condition existed on a previously scheduled session day and that the school district was in session and provided remote instruction on that day;<\/li>\n<li>How many instructional hours were provided on such session day; and<\/li>\n<li>Beginning with the 2023- 2024 school year, that remote instruction was provided in accordance with the district’s Emergency Remote Instruction Plan.<\/li>\n<\/ul>\n<p><strong><u>BOARD OF EDUCATION APPROVAL<\/u><\/strong><\/p>\n<p>As part of the District-wide School Safety Plan, the school district’s Board of Education shall make the Emergency Remote Instruction Plan available for public comment and public hearing for no less than thirty days (30) prior to adoption. The plan must be adopted as part of the District Wide School Safety Plan annually prior to September 1st and posted on the district website in a conspicuous location.  <\/p>\n<p><strong> <\/strong><strong>SUPPORT FOR STUDENTS WITH DISABILITIES DURING EMERGENCY CLOSING REMOTE INSTRUCTION<\/strong><\/p>\n<p>School districts are required to implement supports, services and accommodations, as indicated in students’ IEPs or 504 Accommodation Plans, to the best of their ability, when providing virtual instruction.  <\/p>\n<p><strong>Special education teachers who provide direct\/indirect consultant services<\/strong> will initiate outreach to their students’ general education teacher(s) to collaborate on instructional modalities and any necessary accommodations or modifications required of assignments or assessments for the day. <\/p>\n<p><strong>Special education teachers who teach resource room, self-contained special classes either content specific or specialized programs<\/strong>, should follow the same guidance and expectations as classroom teachers in regards to pedagogy, content, class meetings, and flexibility.<\/p>\n<p><strong>Teaching assistants<\/strong> <strong>and teacher aides<\/strong> are available for instructional support by way of participating in class meetings, keeping up on classroom assignments and expectations, and serving as additional academic support. <\/p>\n<p><strong>Related service providers<\/strong> are to provide “tele-therapy” services, to the best of their ability consisting of synchronous and asynchronous components as appropriate. Related service providers are expected to adhere to similar guidelines as other professionals in regard to student and teacher work at home, communication, and flexibility and they will use the students’ IEPs to determine an appropriate\/reasonable level of communication and support.<\/p>\n<p><strong>Documentation Requirements: <\/strong>Special education personnel are expected to document all supports and services provided to students during this time. Document the manner, means, duration of time, follow up efforts, etc. IEP progress monitoring is required to be collected and reported to parents following the schedule listed on students’ IEPs. Medicaid session notes continue to be a requirement for eligible related service providers. Special education teachers\/service providers are responsible to hold any virtual professional meetings already scheduled on a day that becomes a virtual instruction day.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction | Section l: General Considerations and Planning Guidelines | Section II: Risk Reduction\/Prevention and Intervention | Section III: Response | Section IV: Declared State of Emergency Involving a Communicable Disease | Section V: Recovery | Section VI: Safety and Security Resources | Appendix | Schedule-A | Schedule-B Introduction Emergencies and violent incidents in school districts are critical issues that must be addressed in &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;District-Wide Safety Plan&#8221;<\/span><\/a><\/p>\n","protected":false},"author":12,"featured_media":0,"parent":202,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-831","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>District-Wide Safety Plan - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"District-Wide Safety Plan - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"Introduction | Section l: General Considerations and Planning Guidelines | Section II: Risk Reduction\/Prevention and Intervention | Section III: Response | Section IV: Declared State of Emergency Involving a Communicable Disease | Section V: Recovery | Section VI: Safety and Security Resources | Appendix | Schedule-A | Schedule-B Introduction Emergencies and violent incidents in school districts are critical issues that must be addressed in &hellip; Continue reading &quot;District-Wide Safety Plan&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2024-12-18T17:08:41+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"55 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\",\"url\":\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\",\"name\":\"District-Wide Safety Plan - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-01-28T19:13:03+00:00\",\"dateModified\":\"2024-12-18T17:08:41+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"About Us\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"School Safety\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"District-Wide Safety Plan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"District-Wide Safety Plan - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/","og_locale":"en_US","og_type":"article","og_title":"District-Wide Safety Plan - Saratoga City School District","og_description":"Introduction | Section l: General Considerations and Planning Guidelines | Section II: Risk Reduction\/Prevention and Intervention | Section III: Response | Section IV: Declared State of Emergency Involving a Communicable Disease | Section V: Recovery | Section VI: Safety and Security Resources | Appendix | Schedule-A | Schedule-B Introduction Emergencies and violent incidents in school districts are critical issues that must be addressed in &hellip; Continue reading \"District-Wide Safety Plan\"","og_url":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/","og_site_name":"Saratoga City School District","article_modified_time":"2024-12-18T17:08:41+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"55 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/","url":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/","name":"District-Wide Safety Plan - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-01-28T19:13:03+00:00","dateModified":"2024-12-18T17:08:41+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/district-wide-safety-plan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"About Us","item":"https:\/\/www.saratogaschools.org\/about-us\/"},{"@type":"ListItem","position":3,"name":"School Safety","item":"https:\/\/www.saratogaschools.org\/about-us\/school-safety\/"},{"@type":"ListItem","position":4,"name":"District-Wide Safety Plan"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/831","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=831"}],"version-history":[{"count":27,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/831\/revisions"}],"predecessor-version":[{"id":9660,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/831\/revisions\/9660"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/202"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=831"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}