{"id":894,"date":"2022-02-10T09:22:40","date_gmt":"2022-02-10T14:22:40","guid":{"rendered":"https:\/\/www.saratogaschools.org\/?page_id=894"},"modified":"2025-08-19T13:01:04","modified_gmt":"2025-08-19T17:01:04","slug":"elementary-student-handbook","status":"publish","type":"page","link":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/","title":{"rendered":"Elementary Student Handbook"},"content":{"rendered":"<h1>2025-2026 Elementary Student Handbook<\/h1>\n<h2>Agenda Books<\/h2>\n<p><span>Agendas are utilized in many classrooms throughout the district. The agenda serves as an excellent resource for students organizationally, and for parents\/guardians to monitor their child’s progress and assignments in the classroom. The agendas can also serve as an effective communication tool between parents\/guardians and teachers. Your classroom teacher and\/or building will provide further details about the use of agendas.<\/span><\/p>\n<h2>Annual Contact Verification and Parent Authorizations<\/h2>\n<p>To ensure the safety and well-being of all students, it is imperative that all contact information in SchoolTool remains accurate and up to date.<\/p>\n<p>The 2025–2026 Annual Contact Verification and Parent Authorizations Form will be distributed via ParentSquare in late August. This form allows parents and guardians to review and update emergency contact details (names, addresses, phone numbers, contact’s pick-up approval, etc.) and complete required authorizations.<\/p>\n<ul>\n<li>The submission window will remain open until mid-September.<\/li>\n<li>During this time, updates can be made directly through ParentSquare.<\/li>\n<li>After the deadline, paper copies of the Parent Authorizations Form (including FERPA, field trips, etc.) will be available in your school&#8217;s main office.<\/li>\n<\/ul>\n<p>If your contact information changes at any point during the school year, please complete the Change of Information Form available on our school website.<\/p>\n<p>Important: If your contact information is not current, the school may be unable to reach you in the event of an emergency or school closure due to inclement weather.<\/p>\n<p>All student contact information is securely maintained in the health\/main office for emergency use. If a parent or guardian cannot be reached, another designated adult listed in SchoolTool will be contacted.<\/p>\n<p>For non-emergency situations, students will only be released to individuals authorized in writing by the parent or guardian. In the case of illness or injury, if a parent\/guardian cannot be reached, those listed in SchoolTool, with pick up rights, will be authorized to pick up the student.<\/p>\n<h2>Attendance Policy for the District<\/h2>\n<p>Plain Language Summary (Based on Policy 5100 Student Attendance, 1\/6\/22, Revised: 10\/13\/22)<\/p>\n<p><span>Education law and Board of Education policy requires that every child attaining the age of six and through the age of sixteen attend school during regular school hours for a minimum of 180 days per year unless excluded by provisions of the law as described below. The attendance policy is built on the belief that regular attendance increases student achievement, reduces drop-out levels, and develops positive attitudes toward school and learning.<\/span><\/p>\n<p>Parents\/guardians are required to provide a written excuse, within a two-week period of the absence, indicating the reasons for any absence, tardiness, or leaving school early. Parents\/guardians are asked to contact the school&#8217;s attendance office when a child is going to be absent. Parents\/guardians are contacted by the attendance office if a child is absent, and the school has not received prior notice from the parent\/guardian.<\/p>\n<p>Excused absences include, tardiness, and early departure from class or school due to:<\/p>\n<ul>\n<li>personal illness<\/li>\n<li>serious illness or death in the family<\/li>\n<li>religious observance or education during school hours with a signed written request<\/li>\n<li>required court appearances of the student<\/li>\n<li>required medical appointments of the student<\/li>\n<li>approved college visits of the student<\/li>\n<li>military obligations of the student<\/li>\n<li>school sponsored activities<\/li>\n<\/ul>\n<p><span>At the discretion of the Superintendent, a student may be granted a maximum number of excused absences so that the student can spend time with their parent or legal guardian who is about to be deployed, returning for a mid-deployment break, or being discharged from military service.<\/span><\/p>\n<p>All other absences, tardies and early dismissals are considered unexcused and illegal. Examples are:<\/p>\n<ul>\n<li>truancy<\/li>\n<li>family vacations<\/li>\n<li>babysitting<\/li>\n<li>work during school hours<\/li>\n<li>hunting, fishing, oversleeping, missing the bus, etc.<\/li>\n<li>no parent\/guardian written note for an otherwise excusable absence<\/li>\n<li>accompanying a parent\/guardian on an appointment<\/li>\n<\/ul>\n<p>When a student has a planned unexcused absence of 11 or more consecutive school days, parents must fill out and submit an Individualized Home Instruction Plan (IHIP) to the Office of Curriculum, Instruction and Assessment.<\/p>\n<p>Administrative procedures ensure that student attendance is monitored on a regular basis; that there are systems in place to acknowledge a student’s efforts to maintain or improve school attendance; and that there are means to monitor and communicate attendance records with parents\/guardians and agencies, as appropriate.<\/p>\n<p>Students are expected to attend all scheduled classes and are held accountable for work missed due to absence, whether the absence is excused or unexcused. If a student is truant, appropriate consequences will be imposed. Attendance is taken daily in grades K-12.<\/p>\n<p>Continuous monitoring will be conducted to identify students who are absent, tardy, or leave class or school early. A student will be considered chronically absent if they miss ten percent of enrolled days in school.  If a pattern of attendance concerns for an individual student is identified a designated staff person(s) will follow-up in accordance with Policy 5100 Student Attendance.<\/p>\n<h3>Other Attendance Information for Elementary Schools<\/h3>\n<p>High absenteeism for any reason interferes with academic progress. After an absence, each student returning to school will present a written excuse from the parent or guardian. If an excuse is not received when a student returns to school, the attendance clerk will contact the parent\/guardian and request either a written and\/or digital excuse for the absence.<\/p>\n<p><strong>If a child arrives late to school, a parent\/guardian must escort the child into the Main Office to sign them in.<\/strong><\/p>\n<h3>Attendance Incentives, Sanctions and Interventions<\/h3>\n<p>The district will design and implement systems to acknowledge a student’s efforts to maintain or improve school attendance. This includes, but is not limited to, the following actions:<\/p>\n<ul>\n<li>At all grade levels, improving the school climate through student feedback in order to provide a safe, supportive school environment and engage students in school.<\/li>\n<li>At all grade levels, actively engaging students, and families in school, determining systematic barriers to school attendance, and developing solutions to remove those barriers.<\/li>\n<\/ul>\n<ul><\/ul>\n<h2>Automatic External Defibrillators (AED)<\/h2>\n<p>The Saratoga Springs City School District maintains on site, in each instructional school facility and at the district office, at least one functional automated external defibrillator (AED) for use during emergencies.  Whenever public school facilities are used for school-sponsored or school-approved curricular or extracurricular events or activities or a school-sponsored athletic contest is held at any location, school administrators shall ensure the presence of at least one staff person who is trained in the operation and use of an AED.  Where a school-sponsored competitive athletic event is held at a site other than a public-school facility, the public-school officials must assure that AED equipment is provided on-site.<\/p>\n<h2>Biking to School Caroline, Division, Geyser, Lake)<\/h2>\n<p>It has been determined that currently there is a safe access point for your child to ride a bicycle onto four of our school properties (Caroline, Division, Geyser, and Lake).<\/p>\n<p>Below, please find some basic requirements (additional building-specific requirements may apply—contact the building principal for details) that must be adhered to for your child to receive permission from the building principal to ride a bicycle to and from our school.<\/p>\n<p>They are as follows:<\/p>\n<ul>\n<li>Both you and your child must review and sign the Bicycle Safety Agreement.<\/li>\n<li>You must complete a form so that your child’s bicycle is registered in the main office.<\/li>\n<\/ul>\n<p>Please be advised that should your child fail to adhere to the requirements contained in the Bicycle Safety Agreement, your child may lose the privilege of riding their bicycle to and from school.<\/p>\n<p>Please refer to the Board of Education Policy 5453-Biking to School and the Administrative Regulation 5453-R for more information and the Bicycle Safety Agreement. All District Policies are located in the <a href=\"https:\/\/boardpolicyonline.com\/?b=saratoga_springs_city\">Policy Manual.<\/a><\/p>\n<p>\n<strong>We strongly recommend that you accompany your child whenever your child rides their bicycle to and from our school.<\/strong><\/p>\n<h2>Biking to School Dorothy Nolan, Greenfield)<\/h2>\n<p>It has been determined that currently there is not a safe access point for your child to ride a bicycle onto two of our school properties (Dorothy Nolan and Greenfield).  This determination denies your child the opportunity to ride their bicycle or any other individual transportation device to and from school.  Please be advised that the District will revisit this issue on an annual basis.<\/p>\n<h2>Board of Education Meetings<\/h2>\n<p>Board of Education meetings traditionally take place on the second and fourth Thursday of the month starting at 7:00 p.m., unless otherwise noted. Please check the school website (www.saratogaschools.org) for the meeting locations, agendas, minutes, and recordings.<\/p>\n<h2>Character Education<\/h2>\n<p>Saratoga Springs City School District follows Positive Behavior Interventions and Supports (PBIS) to teach and support positive behavior by all students. Students, both in school and in the community at large, are expected to:<\/p>\n<ul>\n<li>Be Safe<\/li>\n<li>Be Respectful<\/li>\n<li>Be Responsible<\/li>\n<\/ul>\n<p>These expectations will be taught and celebrated through classroom and school wide lessons and events.  Students who are not demonstrating expected behaviors will be provided interventions, including reflection and reteaching of expected behavior.<\/p>\n<h2>Classroom Parties<\/h2>\n<p>During the school year, your child will enjoy parties in their room.  Your child’s classroom teacher\/homeroom parents will provide you with more information about parties as the school year unfolds.  Each classroom teacher will provide the office with a roster of parents\/guardians attending each party.  When you arrive at school for the party, please make sure to sign-in at the Main Office.<\/p>\n<h2>Code of Conduct Summary Document<\/h2>\n<p><strong>Elementary Summary Document*<\/strong><\/p>\n<p>This section of the student handbook is a summary of the District Code of Conduct.  The complete document can be picked up at the Main Office or found on our District’s website.<\/p>\n<p><strong>Rights and Responsibilities<br \/>\n<\/strong><strong><\/strong><\/p>\n<p>The Code of Conduct is used to outline the rights and responsibilities of students.  These rights and responsibilities apply to schoolwork, before and\/or after school activities and school citizenship.<strong><\/strong><\/p>\n<p><strong>Adults in the School Community<br \/>\n<\/strong>Parents, Teachers, Student Service Personnel, Principals, Superintendent, and Board of Education trustees are all adults that work to help students succeed.<strong><br \/>\n<\/strong><\/p>\n<p><strong>Student Dress Code<br \/>\n<\/strong><\/p>\n<p>Clothing must be safe, appropriate, and not interfere with learning.<\/p>\n<p><strong>Unexpected Student Conduct<br \/>\n<\/strong>Not following building and classroom rules may lead to consequences.<\/p>\n<p><strong>Reporting Violations <\/strong>(See Something, Say Something)<\/p>\n<p>All students must report violations of the Code of Conduct or any suspicious activity to an adult.<strong><\/strong><\/p>\n<p><strong>Consequences<br \/>\n<\/strong><\/p>\n<p>Consequences will be firm, fair, and consistent with the goal of teaching students to be responsible, respectful, and safe. Consequences will be based on the situation, the student’s age, and special circumstances. District personnel may also use the Positive Behavior Interventions and Supports (PBIS) to encourage students to make appropriate choices.<\/p>\n<p><strong>Student Interviews<br \/>\n<\/strong><\/p>\n<p>Any school official may question a student when investigating a possible Code of Conduct violation. <span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p><strong>Visitors to the Schools<br \/>\n<\/strong><strong><\/strong><\/p>\n<p>Anyone who is not a staff member is a visitor.  All visitors must enter through the main door and report to the office to sign in.<span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p><strong>Dissemination and Review<br \/>\n<\/strong><\/p>\n<p>This summary document is to be included in all student handbooks and the Code of Conduct Summary Document will be distributed to all parents. It will be reviewed and updated as necessary each year. The complete Code of Conduct, Board of Education Policy 5300, which has been approved by the Saratoga Springs City School District Board of Education, is available online and in every school building for review. Any questions or clarifications may be requested from the school district and building administrators.<\/p>\n<p><em>*Explained in extensive detail in the full document.<\/em><strong><br \/>\n<\/strong><\/p>\n<h2>Concerts<\/h2>\n<p>Students performing in concerts should arrive at school at the predetermined time as shared by their teacher. They are to report directly to the supervised area and remain there until called on to perform. Parents are asked to remain seated throughout the concert and not to leave after their child has performed. This is asked out of respect for the students performing during later stages of the concert.<\/p>\n<p><strong>Unless an emergency is imminent, parents will not be allowed to take their child from a supervised classroom until the concert is completely over.<\/strong> There will be no exceptions to this procedure as it is outlined above.<\/p>\n<p>Parents must also keep their other children with them throughout the concert sitting in the seats provided. It is expected the audience is quiet during the performance, as the teachers and students work hard to prepare for concerts and performances, and respect should be given to them throughout the concert.<\/p>\n<h2>Custody<\/h2>\n<p>If custody of a child is limited by court order, a signed copy of that order must be on file at the school. Without a signed court order either parent may request to see a teacher, be contacted in the event of an emergency, view school records or sign a child out of school. <em>If custody papers have been updated, it is imperative to provide the school with a copy of the most recent court order. Parents should make sure the court papers on file are the most recent and that rulings listed are current.<\/em><\/p>\n<h2>Digital Tools<\/h2>\n<p>We are excited to support our teachers as they build their own “Digital Toolbox” to meet the home\/school communication needs as well as remote learning needs of students and the families with whom they work.<\/p>\n<p>The Saratoga Springs City School District will continue to use digital connectivity and technology to support individualized instruction and student-centered learning.<\/p>\n<p>For students, these could include resources such as Seesaw (K-5 Assignment and Portfolio tool), and Canvas (6-8), Microsoft Office 365, cloud-based learning tools, blended learning, digital collaboration, and project-based learning. All resources support real world connections, and student choice in demonstrating understanding. Teachers may choose to use many district-supported digital tools such as Canva, Nearpod, WeVideo , Library databases, as well as many other products.<\/p>\n<h2>Dignity for All Students Act (DASA)<\/h2>\n<p>The Dignity for All Students Act (DASA) was enacted effective July 1, 2012. The purpose of DASA is to afford all public-school students an environment free of discrimination and harassment.  DASA prohibits harassment of students by employees and fellow students.<\/p>\n<p>Bullying is defined as an intentional act of aggression based on an imbalance of power that is meant to harm a victim either physically or psychologically. This usually occurs repeatedly over time but could be a single serious event. DASA incidents may happen in school, at school events, or off campus if it involves cyberbullying or an event that affects the victim’s ability to attend school and fully take part in our academic and extracurricular programs.<\/p>\n<p>Incidents of bullying or cyberbullying may be pursued through informal intervention and mediation or through the filing of a formal complaint. All conversations are kept confidential to the extent permitted by law.<\/p>\n<p>Students and parents\/guardians are encouraged to report bullying incidents to a staff member. This could be a teacher, administrator, school psychologist or school counselor.<\/p>\n<p>The DASA coordinator for the building is the principal.<\/p>\n<p><span style=\"font-size: 1rem;\">The District DASA Coordinator is Dr. Joseph Greco, the Director of Personnel Development, who can be reached at  <a href=\"mailto:j_greco@saratogaschools.org\">j_greco@saratogaschools.org<\/a> or by phone at 518-583-4713. You may also file an anonymous written complaint through our online <\/span><a href=\"https:\/\/forms.office.com\/r\/74cYYZkfsC\" style=\"font-size: 1rem;\">Dignity for all Students Act (DASA) Form<\/a><span style=\"font-size: 1rem;\">.<\/span><\/p>\n<p>&nbsp;<\/p>\n<h2>Emergency School Closings<\/h2>\n<p>In the event of an emergency during school hours or an early dismissal, the District will use ParentSquare to send an email, SMS text message and\/or phone notification to the Parent(s)\/Guardian(s) listed in SchoolTool. The building will follow your “Annual Parent\/Guardian Authorization Form” that parents\/guardians submit online at the beginning of the school year for the emergency closing plan of action for your children.<\/p>\n<p>Weather cancellations and delays are posted on the school website, right on the homepage. The District will also send a ParentSquare email and SMS text message to families. The decision to close or delay the starting time of school will be made as early as possible.<\/p>\n<p>School closings are also announced through the media via the School Closing Network (which includes many local TV and radio stations as well as newspaper websites).<\/p>\n<p>Parents\/guardians are urged to check the website or news stations for the announcements rather than call the school district.<\/p>\n<h2>Family Educational Rights and Privacy Act (FERPA)<\/h2>\n<p>This is to advise you of your rights with respect to student records pursuant to the Family Educational Rights and Privacy Act (FERPA). FERPA is a federal law designed to protect the privacy of student records. The law gives parents\/guardians and students over 18 years of age (referred to in the law as “eligible students”) the following rights:<\/p>\n<ol>\n<li>The right to inspect and review the student’s education records within 45 days of the day the district receives a request for access. Parents\/guardians or eligible students should submit to the Building Principal a written request that identifies the records they wish to inspect. The Principal will plan for access and notify the parent \/guardian or eligible student of the time and place where the records may be inspected.<\/li>\n<li>The right to request the amendment of the student’s education records that the parent\/guardian or eligible student believes are inaccurate or misleading. Parents\/guardians or eligible students may ask the district to amend a record that they believe is inaccurate or misleading by writing the Principal, clearly identifying the part of the record they want changed and specifying why it is inaccurate or misleading. Please note that the amendment procedure may not be used to challenge a grade, an opinion, or a substantive decision made by the school district about a student.<\/li>\n<\/ol>\n<p>If the district decides not to amend the record as requested by the parent\/guardian or eligible student, the district will notify the parent\/guardian or eligible student of the decision and advise them of their right to a hearing regarding the request for amendment. Additional information regarding the hearing procedures will be provided to the parent\/guardian or eligible student when notified of the right to a hearing.<\/p>\n<ol start=\"3\">\n<li>The right to consent to disclosures of personally identifiable information contained in the student’s education records, except to the extent that FERPA authorizes disclosure without consent. There is an exception to FERPA’s prohibition against non-consensual disclosure of personally identifiable information from education records, pursuant to which the district may disclose personally identifiable information from education records without consent.\n<p>One exception which permits disclosure without consent is disclosure to “school officials” with legitimate educational interests. A school official is a person employed by the district as an administrator, supervisor, instructor, or support staff member (including health or medical staff and law enforcement unit personnel); a person serving on the school board; a person or company with whom the district has contracted to perform a special task (such as an attorney, auditor, medical consultant, or therapist); or a parent\/guardian or student serving on an official committee, such as a disciplinary or grievance committee, or assisting another school official in performing his or her tasks.  With respect to what constitutes a ‘legitimate education interest’, it is generally accepted that a school official generally has a legitimate education interest if the official needs to review an education record in order to fulfill their professional responsibility.<\/li>\n<\/ol>\n<p>A student or parent\/guardian who believes there has been a violation of the provisions of FERPA may file a complaint with the Family Policy Compliance Office, U.S. Department of Education, 400 Maryland Avenue, S.W., Washington, DC 20202-5920. Complaints must contain specific allegations of fact giving reasonable cause to believe that a violation of FERPA has occurred. More information regarding the complaint process is available at the U.S. Department of Education’s website at <a href=\"https:\/\/studentprivacy.ed.gov\/ferpa\">Family Educational Rights and Privacy Act (FERPA)<\/a>.<\/p>\n<h3>Notification<\/h3>\n<p>The Federal Family Educational Rights and Privacy Act (FERPA) generally protects “student records” from disclosure.<\/p>\n<p>However, FERPA allows schools to disclose, without parental\/guardian consent, certain “directory information” such as a student’s name, address, telephone number, date and place of birth, participation in athletics, honors, awards, and photographs, unless parents\/guardians have advised the district to the contrary.<\/p>\n<p>The primary purpose of the &#8220;directory information&#8221; exception to FERPA is to allow Saratoga Springs City School District (SSCSD) to include this type of information in school publications such as newsletters, calendars, the school district website, ParentSquare, and social media outlets.  In addition, it allows for the publicity of student accomplishments or specific educational programs to the electronic (television) and print (newspaper) media.<\/p>\n<p>SSCSD has designated and historically released the following directory information:<\/p>\n<ul>\n<li>Student&#8217;s name<\/li>\n<li>Address<\/li>\n<li>Telephone listing<\/li>\n<li>Electronic mail address<\/li>\n<li>Photograph<\/li>\n<li>Date and place of birth<\/li>\n<li>Major field of study<\/li>\n<li>Dates of attendance<\/li>\n<li>Grade level<\/li>\n<li>Participation in officially recognized activities and sports<\/li>\n<li>Weight and height of members of athletic teams<\/li>\n<li>Degrees, honors, and awards received<\/li>\n<li>The most recent educational agency or institution attendance<\/li>\n<\/ul>\n<p>Parents not wishing directory information about their child to be used in either district publications, released to the media or on the district website must fill out the <a href=\"https:\/\/forms.office.com\/r\/ZReH9NNz0D\">FERPA opt-out form<\/a><span>.<\/span> This form must be filed annually in September.<\/p>\n<h2>Gun\/Weapon Free Schools Policy<\/h2>\n<p>It is important for all members of the public to understand that it is illegal for any firearm or weapon to be brought onto school property by an individual other than a peace officer or law enforcement official in the discharge of legal duties. The Saratoga Springs City School District Board of Education may grant permission for individuals that have been designated by the District to carry a firearm while performing his or her duties while on campus. According to the Gun Free Schools Act, starter pistols, explosives, other weapons able to expel a projectile, even portions of a workable weapon, are all covered under this legislation. This information is extremely important, not only for students who could suffer severe penalties of up to one-year removal from school, as well as mandatory referral to law enforcement or juvenile delinquency officials for prosecution, but also for parents\/guardians and community members who might also face legal prosecution for violating this Act.<\/p>\n<p>The full impact of this legislation makes it illegal for someone to drive onto school property with a firearm or similarly defined weapon in their possession or in their vehicle.  In accordance with a weapon being on the school grounds, this gun free school zone law applies to within 1000 ft. of the school building. Additionally, this law applies not only to “the school district property”, but also applies to all school events held on or off campus. This means a parent\/guardian returning from a day of hunting should not have the rifle or shotgun in their vehicle if they come to school to pick up their child or attend an evening meeting. Beyond strict compliance with the law, there is also the concern for the potential of some unintended tragedy whenever firearms are brought in close contact with large numbers of people, including children.  Please use particular caution in the fall when so many citizens may be involved in hunting or target shooting activities. <\/p>\n<h2>Harassment<\/h2>\n<p>It is the policy of the Saratoga Springs City School District that harassment and discrimination based upon actual or perceived race, color, creed, religion, national origin, sex, gender, sexual orientation, disability, or other legally protected category is unacceptable conduct and will not be tolerated. This is in keeping with efforts to establish an environment in which the dignity and worth of each member of the school community is respected. The goal of the district is to provide a community in which all students and staff are accepted as individuals.<\/p>\n<p><strong>Harassment<\/strong> of any member of the school community by an individual is prohibited on school property or in connection with school-related activities.<\/p>\n<h3>Complaint Processing<\/h3>\n<p>The District will promptly and thoroughly investigate all complaints of discrimination and\/or harassment whether verbal or written, formal or informal. Students and parents\/guardians should report such incidents to the student’s teacher, building psychologist, or building administrator.<\/p>\n<h2>Health Services<\/h2>\n<h3>First Aid and Parent Notification in Case of Accidents or Illness<\/h3>\n<p>School nurses will provide immediate medical care to an injured or sick person but may not go beyond their legal duties to apply second dressings or care for injuries that occurred at home or elsewhere.<\/p>\n<p>It is very important that the school nurse be able to contact the parent(s)\/ guardian(s) of a child in case of sudden illness or accident.  Emergency information forms will be provided to parent(s)\/guardian(s) for each child enrolled in school. Parent(s)\/guardian(s) are to provide the following information:<\/p>\n<ol>\n<li>Home telephone number<\/li>\n<li>Business telephone number(s) of parent(s)\/guardian(s)<\/li>\n<li>Name and telephone number of a friend, relative, or neighbor (who has given consent) to act for the parent(s)\/guardian(s) in case of an emergency<\/li>\n<li>Name and telephone number of the family physician and preferred hospital<\/li>\n<\/ol>\n<p><strong><em>**The school MUST be notified promptly of any change in this information. **<\/em><\/strong><\/p>\n<p>If a student needs to go home due to an illness or injury, the school nurse will contact the parent(s)\/guardian(s). Parent(s)\/guardian(s) are responsible, whenever possible, to transport their ill or injured child.<\/p>\n<p>Parent(s)\/guardian(s) are responsible also for subsequent care and treatment. If an injury occurs on school property and the child requires medical care, an accident report will be filed. However, school insurance is secondary to the parent(s)’\/ guardian(s)’ insurance.<\/p>\n<p>Note:  A child will NOT be released to any person other than a parent\/guardian without authorization by a parent\/guardian.<\/p>\n<h3>Health Awareness List<\/h3>\n<p>A Medical Alert List of students who have health problems is maintained by the nurse and used to make essential staff aware of students with medical conditions. This list is updated throughout the year. Please inform the Health Office of any changes in your child’s health. The school nurse is always available to work with you or help with any health problems.<\/p>\n<h3>Illness<\/h3>\n<p>If a child has signs or symptoms of illness, such as a fever, sore throat, or upset stomach, etc., the child should not be sent to school. In addition, the child must be free of vomiting, diarrhea, and fever free without medication for 24 hours before returning to school. Any child diagnosed with Strep Throat or Conjunctivitis (pink eye) must be on antibiotics for 24 hours before returning to school. This is for the child’s protection, as well as protection for classmates.<\/p>\n<p>If a child is absent, the attendance clerk should be notified. To control communicable diseases, it is important the school nurse be notified of strep throat, scarlet fever, fifth disease, chickenpox, impetigo, head lice, scabies, pinworms, and any other communicable diseases.<\/p>\n<h3>New York State Immunization Requirements<\/h3>\n<p>Please use the following link to view New York State immunization requirements for students:  <a href=\"https:\/\/www.health.ny.gov\/publications\/2370_2026.pdf\">https:\/\/www.health.ny.gov\/publications\/2370_2026.pdf<\/a><\/p>\n<p>It is the responsibility of the parent(s)\/guardian(s) to provide this information. Acceptable records are certificates of immunization or a signed statement attesting to required immunizations from a physician or health facility. <br \/>\nThe only exceptions are the following:<\/p>\n<ol>\n<li>Medical Exemption –A certificate from a physician, licensed to practice medicine in New York State, that one or more of the required immunizations may be detrimental to the child’s health or until such immunizations are found to no longer be detrimental to the child’s health. This certificate must specify which immunizations may be detrimental and must be renewed each year. Once received, this exemption request will be forwarded to our school physician for review.<\/li>\n<li>Specific Exemptions – Demonstrated serologic evidence of measles, mumps, rubella, hepatitis B or varicella antibodies is acceptable proof of immunity. Diagnosis by a Licensed Physician, Physician Assistant or Nurse Practitioner of a child having had measles, mumps or varicella is acceptable proof of immunity.<\/li>\n<li>Immunization in Process &#8211; Documentation that the child has received at least the first dose of each required vaccination and has age-appropriate appointments to receive the remaining doses.<\/li>\n<\/ol>\n<p>EVERY EFFORT SHOULD BE MADE TO HAVE A CHILD PROPERLY IMMUNIZED. WE DO NOT WISH TO EXCLUDE A CHILD FROM SCHOOL, BUT PUBLIC HEALTH AND STATE EDUCATION LAW REQUIRES THAT IMMUNIZATION REQUIREMENTS MUST BE MET FOR SCHOOL ATTENDANCE.<\/p>\n<h3>Medication Administered in School<\/h3>\n<p>School nurses CANNOT administer prescription OR over-the-counter medications to a student without the following: *<\/p>\n<ol>\n<li>Written directions from the <strong>physician<\/strong> with the following information: <em>student&#8217;s name, diagnosis, name of medication, possible side effects, dosage and frequency, specific time to be given in school, initiation and ending dates for medication, and the physician&#8217;s signature.<\/em><\/li>\n<li>Written request from a <strong>parent\/guardian<\/strong> for the school nurse to administer the medication.<\/li>\n<\/ol>\n<p>(*) Please refer to the Authorization to Administer Medication by School Personnel permission form.<\/p>\n<p>Medications should be in the original container with the pharmacy label attached.  All medication must be kept in the health office.  Students may <strong>not<\/strong> carry medication with them at any time, unless written authorization is received from the physician.<\/p>\n<h3>Physical Examinations<\/h3>\n<p>The Education Law <strong>requires that a physical examination be furnished by each pupil upon entrance to the school district (including kindergarten) and by each child entering the 1<sup>st<\/sup>, 3<sup>rd<\/sup>, 5<sup>th<\/sup>, 7<sup>th<\/sup>, 9<sup>th<\/sup> and 11<sup>th<\/sup> grades.<\/strong>  It is recommended that your family physician give your child a complete medical examination.  Your physician will need to complete the School Health Examination Form, which may be obtained from the school nurse.  This form should be returned to the health office in your child&#8217;s school within the first month of school.  If this form is not returned, your child will be examined by the school physician during the school year.  It is requested that the respective health office be notified of any change in the health status of the child. <\/p>\n<p><strong>Physical examinations are also required yearly of all secondary students involved in interscholastic athletic programs.<\/strong><\/p>\n<p>Hearing is tested for every Kindergarten, 1<sup>st<\/sup>, 3<sup>rd<\/sup>, 5<sup>th<\/sup>, 7<sup>th<\/sup> and 11<sup>th<\/sup> grade pupils and vision is tested for every Kindergarten, 1<sup>st<\/sup>, 3<sup>rd<\/sup>, 5<sup>th<\/sup>, 7<sup>th<\/sup> and 11<sup>th<\/sup> grade pupils as required by New York State Law.  Scoliosis screening is also done for girls in grades 5 and 7 and for boys in grade 9, as mandated by New York State Law.  These screenings are not meant to replace the more sophisticated means of testing by a physician or a specialist.<\/p>\n<p><strong>A parent\/guardian will be notified by the school nurse when a problem may be indicated, and Physician Referral will be sent to the parent(s) \/ guardian(s).<\/strong><\/p>\n<h3>Excuses from Physical Education<\/h3>\n<p>Physical education is, by law, a required part of the school curriculum.  Attendance and participation by all students is mandated.  An excuse for not attending and\/or participating must be a medical excuse signed by a physician.  A parent\/guardian request for a gym excuse is allowed for one day only and must be approved by the school nurse.  When a child is excused from physical education class, this means they cannot participate in recreational or sports activities, including recess.  However, non-physical activities may be assigned by the physical education teacher during class time.<\/p>\n<p>A physical education excuse must contain the following information:  <em>student&#8217;s name, grade, nature of illness or disability, length of time the excuse is valid, nature of the excuse (non-participation or limited participation) and the signature of the physician\/parent\/guardian.  <\/em>If the excuse is requested by a physician, the approval to resume gym must also be from the physician.  Adaptive physical education is provided for students with special needs, based on recommendations by a physician and\/or the Committee on Special Education.  A special form will be provided by the school for completion by the physician.<\/p>\n<h2>Homework Guidelines<\/h2>\n<p>The Saratoga Springs City School District has a commitment to excellence in instructional programs while taking into consideration the developmental stages of children. Homework is a continuation of a learning process developed in the classroom and carried on by the child in the home environment.  Its effectiveness depends upon careful planning by the teacher as well as supportive parental\/guardian involvement.<\/p>\n<p>Research has clearly shown that homework has different purposes at different grade levels. Homework for younger students develops positive attitudes and work habits while homework for older students develops or expands content and knowledge.<\/p>\n<p>The School District acknowledges the importance of current research in developing and implementing homework guidelines that will maximize the effectiveness of homework as a strategy to improve student performance. The following time frames are suggested by research when assigning total daily homework:<\/p>\n<p>Grades K – 2: 10 – 20 Minutes <br \/>\nGrades 3 – 5: 30 – 50 Minutes<\/p>\n<h2>Homework Requests<\/h2>\n<p>Homework requests for an absent student should be made prior to 10:30 AM. This will give the teachers time to prepare the materials to be sent home. You may pick up assignments and materials in the Main Office at the end of the day.<\/p>\n<h2>Kindergarten Registration and Screening<\/h2>\n<p>Kindergarten Registration will begin in January. Online Registration forms can be completed by visiting the <a href=\"https:\/\/www.saratogaschools.org\/about-us\/student-registration\/\">Student Registration page<\/a> on the school website. The Registrar’s Office will contact the parent\/guardian if further information is required. <span style=\"text-decoration: line-through;\"><\/span><\/p>\n<p>Once the Registrar’s Office has received all required documentation, a screening appointment will be provided for your child, if the health and safety of our students and staff permit. During this process, students are screened by a number of staff (i.e., physical education teacher, speech therapist, AIS reading teacher, kindergarten and first grade teachers). Results of the screening are shared with the parents\/guardians by the screening team. <\/p>\n<h2>Lost and Found<\/h2>\n<p>Please take the time to clearly mark all articles of clothing and other possessions to avoid loss and to help in identifying the owner. Place all ID tags on the inside, and do not mark your child’s clothing on the outside. All unclaimed clothing and possessions are turned into the Main Office, and then placed in the lost and found area. Lost and Found items will be bagged and given to a local charity each trimester.<\/p>\n<h2>Media<\/h2>\n<p>At various times throughout the school year, newspapers and TV stations may be present at the school to take pictures and report on different school functions and activities. If you do not wish to have your child’s information released to the media, used in district publications, or on the district website you must fill out the <a href=\"https:\/\/forms.office.com\/r\/ZReH9NNz0D\">FERPA opt-out form<\/a><span>.<\/span> which can be found on the school website. You must submit this form annually.<\/p>\n<h2>Moving<\/h2>\n<p>It is very important for the school to have accurate records on each child. If you are moving within the District or moving out of the District, please make sure to use the following procedures:<\/p>\n<h3>Moving within the District<\/h3>\n<p>Parents\/guardians of students moving within the District are required to submit a <a href=\"https:\/\/forms.office.com\/pages\/responsepage.aspx?id=enMV6dTl3E-FtexZHCsUDePSZ983yT5MnBfo-hoaMoZUQ1pEUEdGR1RUWllDUFhEVktFMldaWDdTRi4u\">Change of Information Form<\/a>, <span> <\/span>to inform the school of your new address. Please allow up to five business days for the change to go into effect. Two current proofs of residence must also be provided when changing a primary address.<\/p>\n<p>If your move puts you in another elementary zone and you would like your child to complete the year at their current school, you are <strong>also<\/strong> required to submit a <a href=\"https:\/\/forms.office.com\/pages\/responsepage.aspx?id=enMV6dTl3E-FtexZHCsUDePSZ983yT5MnBfo-hoaMoZUQUdTQzBRVlFIRlQ2Q0lDTEYzRU8yRTMyTy4u\">Change of Elementary School request form for consideration. this form is <\/a>located on the school website on the Student Registration webpage.<span style=\"text-decoration: line-through;\"><\/span><\/p>\n<h3>Moving out of the District<\/h3>\n<p>If you are moving outside the Saratoga Springs City School District, please notify the school in person. You will need to fill out and sign a “Student Discharge Form.” which can be found at your school building’s attendance office. You will receive a transfer form to present to the new school when you register your child. The new school will request records after your child has enrolled.<span style=\"text-decoration: line-through;\"><\/span><\/p>\n<h2>Parent\/Teacher Conference Dates<\/h2>\n<p>Parent\/teacher communication is encouraged throughout the school year. In addition to regular communication, time has been set aside for the purpose of Parent\/Teacher conferences. Please see the School Events Calendar for the specific dates.<\/p>\n<h2>Pathways Saratoga Vision<\/h2>\n<p>The Saratoga Springs school community will empower all learners in an engaging, collaborative environment to discover their personal pathways to the future.<\/p>\n<h3>Equity of Opportunity<\/h3>\n<p>Overcoming barriers to equity, all learners will have the support they need intellectually, creatively, and socially.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Champion efforts to foster and facilitate growth in becoming a culturally competent school district with respect to all.<\/li>\n<li>Promote access and opportunity for all students, exemplified by parity in student participation and performance across all subgroups.<\/li>\n<\/ol>\n<h3>Collaboration<\/h3>\n<p>Working cooperatively, our culture of learning will motivate all to be innovative, productive, creative and inquisitive.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Cultivate shared leadership through purposeful interactions, data-driven decisions, and a focus on improved student learning within Professional Learning Communities.<\/li>\n<li>Expand project-based learning, multi-disciplinary programming, and technology across K-12 learning environments.<\/li>\n<\/ol>\n<h3>Community<\/h3>\n<p>Providing opportunities at all schools for families, community, and business to be active partners in supporting learner success.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Strengthen the SSCSD community through family outreach and community partnerships.<\/li>\n<li>Utilize proactive communications strategies with all stakeholders.<\/li>\n<\/ol>\n<h3>Personalization<\/h3>\n<p>Teaching and learning will meet the individual needs of all learners, developing meaningful connections to support personal growth.<\/p>\n<p>District Targets:<\/p>\n<ol>\n<li>Develop student ownership of their learning, personal goal setting, and career exploration.<\/li>\n<li>Engage learners in relevant, flexible and innovative learning experiences that adapt to meet individual needs.<\/li>\n<\/ol>\n<h2>Positive Behavior Interventions and Supports<\/h2>\n<p>Administrators and educators follow a positive behavior interventions and supports (PBIS) flow chart to identify and address student behavior in a constructive way.<\/p>\n<p>Saratoga Springs elementary schools expects students to be safe, respectful and responsible. To that end, we have outlined expectations in the following areas:<\/p>\n<p><strong>Classroom<\/strong><\/p>\n<ul>\n<li>Always follow classroom expectations and routines<\/li>\n<li>Keep your hands, feet, body, and objects to yourself<\/li>\n<li>Report all unsafe behaviors to an adult \/ see something say something<\/li>\n<li>Use materials safely<\/li>\n<li>Always get adult permission before leaving a room\/building<\/li>\n<li>Follow directions the first time they are given<\/li>\n<li>Speak and act kindly to others<\/li>\n<li>Respect other’s personal space and belongings<\/li>\n<li>Use expected voice level (0-3)<\/li>\n<li>Be prepared<\/li>\n<li>Do your best<\/li>\n<li>Be present and punctual<\/li>\n<li>Be a thinker and focus during lessons<\/li>\n<\/ul>\n<p><strong>Bus<\/strong><\/p>\n<ul>\n<li>Go directly to assigned seat and stay seated<\/li>\n<li>Use expected 0-2 level voice<\/li>\n<li>Keep aisles and windows clear<\/li>\n<li>Keep hands, feet, body and objects to yourself<\/li>\n<li>Keep food and drink in backpack<\/li>\n<li>Pay attention to the environment around you when getting on or off the bus<\/li>\n<li>Follow directions the first time they are given<\/li>\n<li>Speak and treat others with respect<\/li>\n<li>Speak and act kindly to others<\/li>\n<li>Respect others&#8217; personal space and belongings<\/li>\n<li>Follow all bus rules<\/li>\n<li>Keep track of your belongings<\/li>\n<li>Have student I.D. tag ready for boarding and exiting the bus<\/li>\n<li>Keep our bus clean<\/li>\n<li>Be ready when arriving at your bus stop<\/li>\n<li>See something, say something to the driver, school staff or your parent<\/li>\n<\/ul>\n<p><strong>Cafeteria<\/strong><\/p>\n<ul>\n<li>Keep hands, feet, body and objects to self<\/li>\n<li>Feet under the table<\/li>\n<li>Eat your own food<\/li>\n<li>Be seated and stay seated<\/li>\n<li>Follow directions the first time they are given<\/li>\n<li>Use a 1-2 voice<\/li>\n<li>Use table manners<\/li>\n<li>Speak and act kindly to others<\/li>\n<li>Respond to adults promptly using expected language<\/li>\n<li>Get milk, utensils and condiments before sitting down<\/li>\n<li>Focus on eating first<\/li>\n<li>Clean up after yourself<\/li>\n<\/ul>\n<p><strong>Hallway<\/strong><\/p>\n<ul>\n<li>Walk in line(s) on the right, hands by your side<\/li>\n<li>Keep your body in your own space<\/li>\n<li>Stay with your class\/partner(s)<\/li>\n<li>Use a &#8220;0&#8221; voice level<\/li>\n<li>Follow directions the first time they are given<\/li>\n<li>Be ready before you leave the room<\/li>\n<li>Keep your spot in line<\/li>\n<li>Go directly where you need to go<\/li>\n<\/ul>\n<p><strong>Bathroom<\/strong><\/p>\n<ul>\n<li>Close and latch your bathroom door<\/li>\n<li>Watch for wet spots on the floor<\/li>\n<li>Wash your hands<\/li>\n<li>Keep hands, feet, body, and objects to self<\/li>\n<li>Keep the bathroom clean<\/li>\n<li>Use a 0-1 voice level<\/li>\n<li>Respect privacy<\/li>\n<li>Respond to adults immediately<\/li>\n<li>Tell an adult if the bathroom needs attention<\/li>\n<li>Take care of your needs and return to class<\/li>\n<li>Use bathroom only when needed and as expected<\/li>\n<\/ul>\n<p><strong>Assembly\/Activities<\/strong><\/p>\n<ul>\n<li>Sit up in your assigned spot appropriately<\/li>\n<li>Keep hands, feet, body and objects to self<\/li>\n<li>Enter and exit at level &#8220;0&#8221;<\/li>\n<li>Look at and listen to performer; be attentive<\/li>\n<li>Raise hand and wait to be called on<\/li>\n<li>Applaud and participate in an expected manner<\/li>\n<li>Be alert<\/li>\n<li>Sit in assigned area quietly<\/li>\n<li>Adjust voice level to activity<\/li>\n<li>Eyes on speaker<\/li>\n<\/ul>\n<p><strong>Recess\/Playground<\/strong><\/p>\n<ul>\n<li>Keep your body in control<\/li>\n<li>Use equipment as expected<\/li>\n<li>Stay in assigned area<\/li>\n<li>Voice level 4 or less<\/li>\n<li>Share and take turns<\/li>\n<li>Show good sportsmanship<\/li>\n<li>Include everyone<\/li>\n<li>Respond to adults immediately<\/li>\n<li>Report unsafe behavior or equipment to an adult<\/li>\n<li>Take care of and return equipment<\/li>\n<li>Dress appropriately<\/li>\n<\/ul>\n<h2>Recess<\/h2>\n<p>All classrooms (K &#8211; 5) will be participating in outdoor recess for at least 15 minutes per day. This is a general guideline, as outdoor recess will not take place if the weather is inclement (rain, snowstorm, thunderstorm, or real feel temperatures below 20 degrees). Recess may also not take place if there are special assemblies or other scheduling conflicts at various times throughout the year. Students must wear shoes (sneakers) that allow them to run and play without risk. If the appropriate shoes are not worn, students may not be permitted to play on the equipment<\/p>\n<h2>Registering Children for School<\/h2>\n<p>The online registration process, for new students entering grades K-12, can be found on the <a href=\"https:\/\/www.saratogaschools.org\/about-us\/student-registration\/\">Student Registration page<\/a> of the school website. If you need additional information, please contact the Registrar’s Office at 518-583-4789.<\/p>\n<h2>Report Card Dates<\/h2>\n<p>The school year is divided into three report periods. The specific dates are listed in the District Calendar. All reports are designed to inform you of your child(ren)’s progress in each subject area at the end of each trimester.<\/p>\n<h2>School Boundaries and Reassignment Procedures<\/h2>\n<p>The Saratoga Springs City School District has designated attendance zones. In addition, the district has created five flex attendance zones to assist in the balancing of class size. Flex attendance zones are areas in which newly registering students could attend one of two or more schools. Students’ school assignments will be determined by the district based on the designated attendance\/flex attendance zone, class size capacity, school resources, and transportation.<\/p>\n<p>Students may be reassigned to a different attendance zone for the following reasons:<\/p>\n<ol style=\"list-style-type: lower-alpha;\">\n<li>Administrative Transfer: To maintain class size targets<\/li>\n<li>Administrative Transfer: For students requiring specific school services<\/li>\n<li>Parent’s Request “Change of Elementary” for the following reasons:\n<ol style=\"list-style-type: lower-alpha;\">\n<li>Daycare services located in another elementary zone in our District<\/li>\n<li>Moving to a different zone during the school year and requesting to complete the year in the student’s current school<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<h3>Administrative Transfers<\/h3>\n<p>The Superintendent or designee may assign students to schools outside the designated attendance zone if the class size targets have reached capacity.<\/p>\n<p>The current class size targets are:<\/p>\n<ul>\n<li>Kindergarten: twenty (20)<\/li>\n<li>Grade 1: twenty (20)<\/li>\n<li>Grade 2: twenty-three (23)<\/li>\n<li>Grade 3: twenty-seven (23)<\/li>\n<li>Grade 4: twenty-five (25)<\/li>\n<li>Grade 5: twenty-five (25)<\/li>\n<\/ul>\n<p>Parents\/guardians of students to be Administratively Transferred shall be notified promptly of their student&#8217;s reassigned location. Transportation will be provided.<\/p>\n<p>If an Administrative Transfer occurs during the summer (July 1st – up to seven days prior to the first day of school) and space opens in their designated attendance zone during that time, the child(ren) may be returned to their school in the same order that they were reassigned.<\/p>\n<p>If there is more than one child in a family, the parent\/guardian will be given the choice (if possible) to have all the children reassigned, or only those affected by the class size target being met in their designated attendance zone.<\/p>\n<p>During the school year, as openings occur in their designated attendance zone, the family may be given the opportunity to return to their school or complete the school year at the assigned school.<\/p>\n<p>At the conclusion of the school year, the family will be given the choice of having their child(ren):<\/p>\n<ul>\n<li>Continue at the Administratively Transferred school for the duration of their elementary career (K-5) along with any future younger siblings if there is available capacity. Transportation will be the responsibility of the parent or guardian for that term. Students must attend school regularly and adhere to the building’s time schedule.<\/li>\n<li style=\"list-style-type: none;\">\n<ul>\n<li>If the child(ren) cannot be transported to the reassigned building, nor attend regularly and adhere to the building’s time schedule, the child(ren) will be returned to their designated attendance zone so that District transportation may be provided.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p style=\"text-align: center;\"><strong>OR<\/strong><\/p>\n<ul>\n<li>Attend their designated attendance zone with transportation provided.<\/li>\n<\/ul>\n<p>If you have additional questions, please feel free to contact the office of the Assistant Superintendent for Information Technology and Operational Innovation at (518) 693-1434.<\/p>\n<h2>School Lunch<\/h2>\n<p>Meal Prices<\/p>\n<p>For the 2025-2026 school year, as per the Community Eligibility Provision (CEP), your <u>first<\/u> breakfast and lunch orders are <u>free<\/u>. If you order a second meal or additional milk, cafeteria prices are as follows: breakfast is $2.00. Lunch is $3.00 and milk is $.75 (Prices are subject to change). There will be a charge for any ala cart snacks or extra items.  <\/p>\n<p>Families should complete the Household Income Eligibility Form (HHIE) at the link below:<\/p>\n<p><a href=\"https:\/\/linqconnect.com\/public\/income-form\/new?identifier=SDDXG3\">Household Income Eligibility Form (HHIE)<\/a><\/p>\n<p>The data gathered from this form can qualify students for additional benefits and allows the district to receive additional state and federal funding. The online form only requires an income range and is confidential.<\/p>\n<p>Additional information regarding Food Services is available on the school website (<a href=\"http:\/\/www.saratogaschools.org\">www.saratogaschools.org<\/a>).  <\/p>\n<h2>Cafeteria<\/h2>\n<p><em>Please note breakfast and lunch are free for the 2024-2025 school year<\/em><\/p>\n<p>Students have a scheduled lunch period.  Your child may bring a lunch or buy a lunch at reasonable prices.  Milk is also available.  Menus are sent home monthly and are available on the school website. Cafeteria prices are as follows:  breakfast is $2.00, lunch is $3.00, and milk is $.75.   (Prices are subject to change.)  The breakfast and lunch prices for the 2024-2025 school year are also available on the school website.  There will be a charge for any ala cart snacks or extra items.  Please continue to send in your application for free or reduced-price meals as this may qualify you for other benefits. <\/p>\n<h3>Automated Payment<\/h3>\n<p>Parents\/guardians have the option of pre-paying for breakfast and\/or lunch by registering with LINQ Connect <a href=\"https:\/\/linqconnect.com\">https:\/\/linqconnect.com<\/a>. You may also pay by check, please make checks payable to “School Lunch Program,” and include the child’s name and school in the memo line of the check.<\/p>\n<h3>Cafeteria Rules<\/h3>\n<p>All staff members understand lunch is a time that allows students to discuss the day’s events and visit with each other. Due to space and time constraints, we have a series of rules to feed many students and keep order in the cafeteria.  Please review the following rules with your child at the beginning of the school year and at intervals throughout the year:<\/p>\n<ol>\n<li>Students are required to get everything needed while going through the lunch line the first time.<\/li>\n<li>Once seated, students will remain seated. If something is needed, students should raise their hand and ask politely for help.<\/li>\n<li>Other than for emergencies, students may not leave the cafeteria unless permission has been granted.<\/li>\n<li>Running, fighting, and throwing food will not be tolerated at any time.<\/li>\n<li>When the noise level reaches critical levels, students must respond to the lunchroom monitor for a quiet cafeteria.<\/li>\n<li>Students are requested to pick up any litter left at their table or on the floor at the conclusion of their lunchtime.<\/li>\n<li>Students must complete their lunch in the cafeteria. No food will be permitted to leave the cafeteria.<\/li>\n<li>Glass containers, metal containers, and soda cans should not be brought to school.<\/li>\n<li>Toys and stuffed animals are not permitted in the cafeteria.<\/li>\n<li>Students should not share food and drink due to the possibility of illness or food allergies.<\/li>\n<\/ol>\n<p>Misbehavior in the cafeteria will lead to various disciplinary measures depending on the behavior.<\/p>\n<h3>Delivery of Student Meals<\/h3>\n<p>Buildings will not be receiving student meals delivered by third party entities, including, but not limited to Door Dash, Grub Hub, etc. The practice has become disruptive to instructional time, adds concerns about food safety, and increases concerns with building security.  Thank you for your understanding and cooperation.<\/p>\n<p><strong>Policy 8505: Charging School Meals and Prohibition Against Shaming <\/strong><\/p>\n<p>“All schools in the district participate in the Community Eligibility Provision, option of the USDA’s Food and Nutrition Services. This allows the district to provide free meals to all students in the district. Each student receives one meal per day per program (E.G., BREAKFAST, LUNCH). If students wish to purchase additional meals of other food items, they must pay for those items at the time of the sale. The district does not permit charging to accounts for such “a la carte” items if students do not have funds available.”<\/p>\n<p>No student with unpaid charges will be prohibited from purchasing food if they have money that day. If school food authorities (SFAs) suspect that a student may be abusing this policy, written notice will be provided to the parent\/guardian.<\/p>\n<p>Students who cannot pay for a meal or who have unpaid meal debt shall not be publicly identified or stigmatized (including wristbands or hand stamps), required to do chores or work to pay for meals, or have meals thrown away after they have been served. District staff shall not discuss a student&#8217;s unpaid meal debt in front of other students. The district shall not take any action directed at a student to collect unpaid school meal fees.<\/p>\n<p>The district&#8217;s payment system allows for automatic replenishment when a balance reaches a certain amount set by the parent\/guardian, The district shall encourage parents\/guardians to utilize this option.<\/p>\n<p>Parents\/guardians shall be discreetly notified of student account balances regularly. This notification will continue regularly until the account is replenished, Parents\/guardians must repay all unpaid charges remaining at the end of the year or before their child leaves the district, whichever occurs first.<\/p>\n<p>The school district shall notify all parents\/guardians in writing on an annual basis at the start of the school year and to families transferring during the year, outlining the requirements of this policy. The policy shall also be published in appropriate school and district publications. All staff involved in implementing and enforcing this policy shall also be notified of these requirements and their responsibilities.<\/p>\n<p>Unpaid meal charges are a financial burden to the district and taxpayers and can negatively affect the school program. Unpaid meal charges shall be considered &#8220;delinquent&#8221; as per the district&#8217;s accounting practices. The district shall attempt to recover unpaid meal charges before the end of the school year but may continue efforts into the next school year. The district shall notify parents\/guardians of unpaid meal charges at regular intervals, and may engage in collection activities by district staff, which do not involve debt collectors as defined in federal law (15 USC {1692a) and may not charge fees or interest or file a lawsuit against students&#8217; parents or guardians. The district shall offer repayment plans and may take other actions that do not result in harm or shame to the child, until unpaid charges are paid. <\/p>\n<p>The remaining funds may be carried over to the next school year. When students leave the district or graduate, the district will attempt to contact the parent\/guardian to return the remaining funds. Parents\/guardians may request that funds be transferred to other students (e.g., siblings, unpaid accounts). All transfer requests must be in writing. Unclaimed funds remaining after 6 years shall be absorbed by the school meal account.<\/p>\n<p>Building Principals, working with the head of food services, shall ensure that all district and food service staff with responsibilities under this policy will be trained on the provisions of this policy and the requirements of Education Law section 908. Staff members are allowed to purchase food from the district&#8217;s food services. However, all purchases must be paid for at the point of sale, cash, payment account.<\/p>\n<p>Staff members are not allowed to charge meals to be repaid later.<\/p>\n<p>Please refer to the Board of Education Policy 8520: Free and Reduced-Price Meal Services and Policy 5405: Student Wellness for more information. All District Policies are located in the <a href=\"https:\/\/boardpolicyonline.com\/?b=saratoga_springs_city\">Policy Manual.<\/a><\/p>\n<p><strong>Summary of BOE Policy 5405:<\/strong><strong> Student Wellness<\/strong><\/p>\n<p>This policy establishes a comprehensive framework to promote student health and wellness through nutrition, physical activity, and education within the school environment. It aims to support lifelong healthy habits and reduce childhood obesity by setting standards for food offerings, physical education, and wellness activities.<\/p>\n<ul>\n<li><strong>Nutrition standards for school foods:<\/strong> All foods and beverages sold or provided during the school day must meet or exceed federal nutrition guidelines, emphasizing fruits, vegetables, whole grains, and low-fat options while ensuring reasonable portion sizes. The district encourages local sourcing and provides free drinking water where meals are served.<\/li>\n<li><strong>Meal scheduling and environment:<\/strong> Lunchtimes are scheduled within normal hours with adequate time allowed for eating to support healthy eating habits.<\/li>\n<li><strong>Regulation of competitive foods and fundraisers:<\/strong> Foods sold outside of meals, including vending and fundraisers, must comply with nutrition standards. Non-food fundraisers and activities are promoted, and off-campus fundraisers are encouraged to follow these guidelines.<\/li>\n<li><strong>Guidelines for celebrations and marketing:<\/strong> School celebrations involving food should promote healthy options and non-food activities, while marketing of foods on school grounds during the school day must meet federal nutrition standards. This applies to all school property and promotional materials.<\/li>\n<li><strong>Physical education requirements:<\/strong> Students engage in physical education according to state mandates, incorporating enjoyable activities that can be sustained lifelong. Physical activity cannot be withheld as punishment.<\/li>\n<li><strong>Recess and classroom activity:<\/strong> Elementary students receive daily recess, which is not used as reward or punishment, preferably held outdoors. Physical activity is also integrated into classroom instruction to enhance learning and meet physical education requirements.<\/li>\n<li><strong>Extracurricular physical activities:<\/strong> The district promotes a variety of physical activity clubs and encourages safe walking or biking to school. Eligibility requirements for activities do not restrict access to physical activity opportunities.<\/li>\n<li><strong>Monitoring, review, and community involvement:<\/strong> The Food Service Director oversees policy implementation and reports every three years. The district conducts periodic assessments of nutrition, physical activity, and wellness education, involving parents, staff, and students through advisory committees and public communications to ensure ongoing improvement.<\/li>\n<\/ul>\n<h3>School Records\/Child&#8217;s Surname<\/h3>\n<p>Please be aware that permanent school records (report cards, cumulative folders, etc.) must reflect the last name recorded on your child’s birth certificate. If your child’s name has been legally changed, please bring documented legal proof of the change to the office of the School Registrar as soon as possible.<\/p>\n<h3>School Support Services<\/h3>\n<h3>ENRICHMENT OPPORTUNITIES <\/h3>\n<p>The Saratoga Springs City School District offers various programs to enrich the educational experience of students seeking expanded academic challenges.<\/p>\n<ul>\n<li>After-school Enrichment courses offered by the regional BOCES for grades 2-5.<\/li>\n<li>A Saturday STEM &amp; Think Series for students in grades 2-5.<\/li>\n<li>All students in K-5 are offered enrichment activities daily, during WIN time. “What I Need” time provides students daily interactions with rigorous, high-quality materials to extend a student’s learning within their classroom setting.<\/li>\n<\/ul>\n<h2>Humanities<\/h2>\n<h3>Art<\/h3>\n<p>Students receive art instruction once a week for 40 minutes. Creativeness and originality will be stressed throughout the year. Smocks are needed, especially for the younger grades. An old shirt or blouse is ideal.<\/p>\n<p><span style=\"font-size: 1.125rem;\">Health Education<\/span><\/p>\n<p>The purpose of the Saratoga Springs City School District Health Education is to prepare students in grades kindergarten through fifth grade with the knowledge, skills, and ability to make informed choices regarding their health, safety, and well-being as they grow to be mature, responsible, successful adults.<\/p>\n<p>Health Education provides students with the skills and knowledge to make informed and appropriate decisions regarding the rights and responsibilities of their own bodies. Child abuse prevention is an integral aspect of our program. Students learn how to recognize, refuse, resist, and report potentially abusive situations.<\/p>\n<p>The development of self-esteem, respect for self and others, love, understanding, and decision-making skills, are all important aspects of social, emotional, and interpersonal growth. The program provides knowledge related to human growth, development and reproduction in a way that fosters a healthy attitude toward human sexuality as an integral part of one’s total well-being.<\/p>\n<h3>Library<\/h3>\n<p>Our schools are fortunate to have an outstanding library housing thousands of books, magazines, videos and more. We have a certified Library Media Specialist present in the library throughout the week. Students in kindergarten through grade 5 will receive formal instruction in the area of library science.<\/p>\n<p>Students using the library and checking books out must:<\/p>\n<ul>\n<li>Return books and materials on time<\/li>\n<li>Take good care of the books when they are borrowed<\/li>\n<li>Students who damage or lose books will be responsible for replacement<\/li>\n<\/ul>\n<p>Parents interested in helping in the library during the school day should contact the Library Media Specialist.<\/p>\n<h3>Music<\/h3>\n<p>Our schools have both an excellent vocal and instrumental music program. General music classes meet once a week for 40 minutes. In addition, students in grades two through five will participate in a choral experience. Grade 4 has the opportunity of taking lessons and playing in the school orchestra. Grade 5 has the opportunity of taking lessons and playing in the school band and\/or orchestra. Concerts are scheduled throughout the school year.<\/p>\n<h3>Physical Education<\/h3>\n<p>All students receive a formal physical education program plus a daily recreation period.Physical Education for grades K-5 is twice a week for 40 minutes. <\/p>\n<p>Children should dress appropriately for P.E. classes. Children will not be allowed to participate in P.E. without proper footwear. Proper footwear refers to securely tied\/velcroed sneakers with a flat bottom and the foot fully covered. Clogs, sandals, dress shoes, boot-like shoes, “slip-ons,” cleats, and any heeled or platform\/wedge soled sneakers are not allowed. Appropriate clothing would include T-shirt and shorts for warm weather and indoors, and sweatshirt or long-sleeved shirt and sweatpants for colder weather and outdoor classes.<\/p>\n<p>Parent\/guardian request for a gym excuse for a day or two must be approved by the school nurse. When a child is excused from physical education class, this means they cannot participate in recreational or sports activities.<\/p>\n<p>A physical education excuse must contain the following information:  <em>student&#8217;s name, grade, nature of illness or disability, length of time the excuse is valid, nature of the excuse (non-participation or limited participation and the signature of the physician\/parent\/guardian). <\/em>If the excuse is requested by a physician, the approval to resume gym must also be from the physician. Adaptive physical education is provided for students with special needs, based on recommendations by a physician and\/or the Committee on Special Education. A special form will be provided by the school for completion by the physician.<\/p>\n<h2>Support Services<\/h2>\n<h3>Multi-Tiered System of Supports (MTSS)<\/h3>\n<p>MTSS stands for Multi-Tiered System of Supports. It is a framework we use to provide targeted support to all students. <\/p>\n<p>MTSS is designed to help schools identify struggling students early and intervene quickly. It focuses on the “whole child”. That means it supports academic growth, but many other areas, too. These include behavior, social and emotional needs, and absenteeism (not attending school).<\/p>\n<p>The tiers of support are a critical part of MTSS. They get more intense from one level to the next. For example, a child receiving small group interventions may need to “move” to one-on-one help. <\/p>\n<p>If you have a concern about your child’s progress in school, please contact your child’s teacher and\/or your building principal.<\/p>\n<p>The Saratoga Springs City School District strives for every student to experience a personal connection to learning which will serve them for a lifetime. We are fortunate to be able to provide a multi-tiered system of supports called Response to Intervention (RtI).<\/p>\n<p>RtI is a framework for providing high-quality curriculum and instruction to all students and intervention support to some students based on assessments, including the following:<\/p>\n<ul>\n<li>Universal Screening\/Diagnostic Assessments<\/li>\n<li>Progress Monitoring<\/li>\n<li>Curriculum-based Assessments<\/li>\n<li>State Assessments<\/li>\n<\/ul>\n<h3>Response to Intervention (RtI)<\/h3>\n<p>The Saratoga Springs City School District strives for every student to experience a personal connection to learning which will serve them for a lifetime. We are fortunate to be able to provide a multi-tiered system of supports called Response to Intervention (RtI).<\/p>\n<p>RtI is a framework for providing high-quality curriculum and instruction to all students and intervention support to some students based on assessments, including the following:<\/p>\n<ul>\n<li>Universal Screening\/Diagnostic Assessments<\/li>\n<li>Progress Monitoring<\/li>\n<li>Curriculum-based Assessments<\/li>\n<li>State Assessments<\/li>\n<\/ul>\n<p>RtI includes three levels which represent a continuum of supports.<\/p>\n<p style=\"padding-left: 40px;\"><strong>Prevention<\/strong>—Tier 1 is high quality, core instruction generally provided by classroom teachers that meets the needs of most students. It may be differentiated to meet different abilities. <\/p>\n<p><strong>Intervention<\/strong>—Tier 2 is supplemental instruction that supports core instruction. It is focused on specific student needs. This is provided by appropriate, qualified staff, which may include classroom teacher, specialist, or other staff in a variety of settings. <\/p>\n<p><strong>Remediation<\/strong>—Tier 3 is more intensive instruction in addition to core instruction. It is intended for students who have significant gaps in essential skills. This is generally provided by a specialist.<\/p>\n<p>Many children respond well to core instruction and will not need additional intervention. If your child does need additional help beyond core instruction, you will be notified in writing.<\/p>\n<p>Please feel free to contact your child’s classroom and\/or support teacher(s) for more information regarding the RtI process. <\/p>\n<h3>Academic Intervention Services (AIS)<\/h3>\n<p>The Saratoga Springs City School District provides Academic Intervention Services (AIS) to students who score below the State designated performance level on State assessments and\/or who are at risk of not achieving the State learning standards.<\/p>\n<p>Academic Intervention Services are designed to help eligible students achieve the NYS learning standards in English language arts and mathematics. These services may include;<\/p>\n<ul>\n<li>Additional instruction including whole, small group, solo or primary instruction that supplements the general curriculum (regular classroom instruction); and\/or<\/li>\n<li>Student support services needed to address barriers to improved academic performance.<\/li>\n<\/ul>\n<p>The intensity of AIS may vary; it is designed to respond to student needs as indicated through State and\/or district, formal or informal assessments.<\/p>\n<h2>SERVICES REQUIRING ELIGIBILITY<\/h2>\n<h3>504 Accommodation Plan<\/h3>\n<p>504 Plans are formal plans that schools develop to give students with disabilities or medical conditions to help provide access to learning. If a student has an impairment that substantially limits a major life activity interfering with educational access (for example, learning, reading, concentrating, communicating, or functions of bodily systems) they may qualify for a 504 Plan.  This plan will provide reasonable accommodations and modifications to help students to access their learning.<\/p>\n<h3>Special Education<\/h3>\n<p>The Saratoga Springs City School District offers a variety of programs and services to meet the needs of students with disabilities who qualify for <em>Individual Education Plan (IEP<\/em>) Service across the district, at all levels. Special education programs and services are delivered to students in the least restrictive environment. We provide special education services that meet the individual needs of the student and are developmentally appropriate as well as strength based. These qualifying services are planned with the Committee on Special Education (CSE) through collaboration with all of the service providers involved in the student’s educational programing and are implemented in a supportive learning environment and documented on students&#8217; Individualized Education Plan (IEP). Similarly, students who need <em>504 Accommodation Plans.<\/em><\/p>\n<h3>Related Services<\/h3>\n<p>These services are designed for students K-12 who need educationally related therapies (speech-language pathology, occupational, physical therapies, adapted physical education, Teacher of the Visually Impaired (TVI), Teacher of the Hard of Hearing (THH), Orientation and Mobility (O&amp;M) or psychological counseling). These may be delivered as individual services or as part of a special education program when a student has been identified with a qualifying diagnosis. There is frequent ongoing assessment of progress monitoring. Related services may be provided as stand-alone service or in conjunction with other services as indicated on a student’s Individualized Education Plan (IEP).<\/p>\n<h2>SOCIAL EMOTIONAL SUPPORTS<\/h2>\n<h3>School Psychologists<\/h3>\n<p>School psychologists use data and assessments to monitor student progress and work with teachers on best-practice interventions to improve academics and behavior. Conducting psycho educational evaluations to determine students&#8217; academic and cognitive strengths and needs and determined by the Office of Pupil Services.  They are available to work with students, teachers, parents, administrators, and community members to improve academic achievement, promote positive behavior, increase access to mental health support, and support and advocate for diverse learners. School Psychologists assist\/guide multi-tiered systems of support and improving school climate.<\/p>\n<h3>School Social Worker<\/h3>\n<p>School social workers provide mandated and nonmandated counseling services for students with IEP and 504 plans with social emotional needs with the focus on educational impact. Social workers supporting families to access outside support services within the community, communities, and school staff to meet the individual needs of students and\/or their families.<\/p>\n<h3><strong>OUTSIDE MENTAL HEALTH SERVICES WITHIN THE SSCSD<\/strong><\/h3>\n<p><strong>Behavioral Health Services North (BHSN) Mental Health Clinics<\/strong><u>:<\/u> The Saratoga Springs City School District has partnered with BHSN to provide outside mental health counseling within the walls of our school district to increase access to mental health supports for our students and their families.  Each of our school buildings houses a mental health clinic. Referrals may be made by contacting your child’s school counselor, the school psychologist, or the social worker in your child’s school. These services are billed directly to medical insurance. BHSN’s services are available all year round and offer medication management if needed as well.<\/p>\n<h2>Security Information<\/h2>\n<p>Events that may endanger the welfare of our students and staff are extraordinary and require a commitment to planning as well as coordinated action by our Building Emergency Response Team (BERT) to evaluate, lower the threat level and to work closely with local emergency providers once they enter school property. We have no control over when these events may occur. It is imperative that we implement a response system that includes the following;<\/p>\n<ul>\n<li>Ensures the safety of students, staff and visitors;<\/li>\n<li>Protects district facilities, property and interests;<\/li>\n<li>Stabilizes the incident in a short period of time;<\/li>\n<li>Provides support to and works collaboratively with emergency providers; and<\/li>\n<li>Communicates effectively with parents\/guardians and media.<\/li>\n<\/ul>\n<p>In order to ensure that our students and staff remain safe during the school day, please adhere to the following:<\/p>\n<ul>\n<li>During each visit to our school, please be sure to report to the designated sign in desk, present a photo ID, sign in and receive a visitor’s badge;<\/li>\n<li>Report directly to the location you designated on the sign in sheet and return to the designated sign in desk immediately after leaving your designated location;<\/li>\n<li>If your intended destination in the building is changed, or altered, you must report this change immediately to the sign in location; and<\/li>\n<li>Report any suspicious and\/or unusual activity observed on school property to the building principal or building staff.<\/li>\n<\/ul>\n<h2>Standardized Testing<\/h2>\n<p>The New York State assessments take place in grades 3 – 5 in the areas of English Language Arts (ELA) and Mathematics and Science in Grade 5. Please see the District Calendar for the specific dates.<\/p>\n<p><strong>Test Preparation Tips<\/strong><\/p>\n<ul>\n<li>Please make sure your child gets a good night’s sleep before each of the exams.<\/li>\n<li>It is also important for your child to eat a healthy breakfast before the exam.<\/li>\n<li>Diligent work habits, both in the classroom and at home, will assist your child in being successful.<\/li>\n<li>Always encourage your child to read during the year.<\/li>\n<\/ul>\n<h2>STUDENT AFFIRMED FIRST NAME\/BIRTH GENDER CHANGE<\/h2>\n<p><span>In an effort to protect privacy, maintain confidentiality and create a safe and supportive environment for Transgender and Gender Nonconforming Students, the District continues to hone its practices and protocols in order to comply with the guidance that has been provided by the Office of the Attorney General (OAG), the New York State Education Department (SED) and the New York State Board of Regents. <\/span><span> If you have questions or would like assistance regarding an affirmed first name\/birth gender change, please contact the school principal.<\/span><\/p>\n<h2>Student Dress Code<\/h2>\n<ul>\n<li>The wearing of bandanas, hats, and hoods in the school building are not permitted except for a medical or religious purpose (unless authorized by school personnel).<\/li>\n<li>The wearing of garments, jewelry, or other forms of symbolism associated with gangs or gang membership is not permitted.<\/li>\n<li>Skateboards are not permitted on school grounds (except for Lake Avenue Elementary School.)<\/li>\n<li>Chewing gum is not permitted (unless authorized by school personnel).<\/li>\n<\/ul>\n<h2>Student Privacy<\/h2>\n<p>The Board recognizes its responsibility to enact policies that protect student privacy, in accordance with law. This is particularly relevant in the context of the administration of surveys that collect personal information, the disclosure of personal information for marketing purposes and in conducting physical exams.<\/p>\n<p><strong>Surveys<\/strong><\/p>\n<p>The Board of Education recognizes that student surveys are a valuable tool in determining student needs for educational services. In accordance with law and Board policy, parental consent is required for minors to take part in surveys which gather any of the following information:<\/p>\n<ol start=\"7\">\n<li>political affiliations or beliefs of the student or the student&#8217;s parent;<\/li>\n<li>mental or psychological problems of the student or the student&#8217;s family;<\/li>\n<li>sex behavior or attitudes;<\/li>\n<li>illegal, anti-social, self-incriminating or demeaning behavior;<\/li>\n<li>critical appraisals of other individuals with whom respondents have close family relationships;<\/li>\n<li>legally recognized privileged or analogous relationships, such as those of lawyers, physicians and ministers;<\/li>\n<li>religious practices, affiliations or beliefs of the student or the student&#8217;s parent; or<\/li>\n<li>income (other than that required by law to determine eligibility for participation in a program or for receiving financial assistance under such program).<\/li>\n<\/ol>\n<p>In the event that the district plans to survey students to gather information included in the list above, the district will obtain written consent from the parent\/guardian in advance of administering the survey. The notification\/consent form will also apprise the parent\/guardian of their right to inspect the survey prior to their child’s participation.<\/p>\n<p><strong>Marketing<\/strong><\/p>\n<p><strong> <\/strong>It is the policy of the Board not to collect, disclose, or use personal information gathered from students for the purpose of marketing or selling that information or providing it to others for that purpose. This does not apply to the collection, disclosure, or use of personal information collected from students for<\/p>\n<p>the exclusive purpose of developing, evaluating, or providing educational products or services for, or to students or educational institutions such as:<\/p>\n<ol>\n<li>College or other postsecondary education recruitment, or military recruitment;<\/li>\n<li>Book clubs, magazines and programs providing access to low-cost literary products;<\/li>\n<li>Curriculum and instructional materials used in schools;<\/li>\n<li>Tests and assessments used to provide cognitive, evaluative, diagnostic, clinical, aptitude, or achievement information for students or to generate other statistically useful data for the purpose of securing such tests and assessments, and the subsequent analysis and public release of the aggregate data from such tests and assessments;<\/li>\n<li>Student recognition programs; and<\/li>\n<li>The sale by students of products or services to raise funds for school-related activities.<\/li>\n<\/ol>\n<ol><\/ol>\n<p>In the event that such data is collected by the district, disclosure or use of student personal information will be protected by the district pursuant to the requirements of the Family Educational Rights and Privacy act (FERPA). [For guidance regarding the disclosure of “directory information,” rather than 5550 personal information, see policy 5500, Student Records.]<\/p>\n<p><strong>Inspection of Instructional Material<\/strong><\/p>\n<p><strong> <\/strong>Parents\/Guardians shall have the right to inspect, upon request, any instructional material used as part of the educational curriculum for students. Instructional content is defined as that information provided to a student, regardless of format, including printed or representational materials, audio-visual materials, and materials in electronic or digital formats. It does not include tests or academic assessments in advance of administration of such assessments.<\/p>\n<p>A parent\/guardian who wishes to inspect and review such instructional material shall submit a request in writing to the Building Principal. Arrangements shall be made to provide access to such material within a reasonable time after the request has been received.<\/p>\n<p><strong>Invasive Physical Examinations<\/strong><\/p>\n<p>Parents\/Guardians have the right to submit a written statement to opt their child out of participation in the administration of any non-emergency, invasive physical examination or screening that is required as a condition of attendance, administered by the school not necessary to protect the immediate health or safety of the student or other students and not otherwise permitted or required by state law. <u>Hearing, vision and scoliosis screenings are not subject to prior notification.<\/u><\/p>\n<p><strong>Notification<\/strong><\/p>\n<p><strong> <\/strong>Parents\/Guardians and eligible students shall be notified at least annually, at the beginning of the school year or when enrolling students for the first time in District schools of this policy. The School District shall also notify parents\/guardians within a reasonable period of time after any substantive change to this policy.<\/p>\n<h3>Data Protection Policies<\/h3>\n<p>Parents\/Guardians and students should also be aware that the Board of Education has specific policies concerning the care and protection of student data by the District and third-party vendors the District contracts with for services. Such policies include, Information and Data Privacy Security, Breach, and Notification (Policy 8635).<\/p>\n<h3><strong>STUDENTS AND PERSONAL ELECTRONIC DEVICES<\/strong><\/h3>\n<p>BOE Policy 5695 prohibits student use of internet-enabled devices during the school day (including all classes, homeroom periods, lunch, recess, study halls, and passing time) on  school grounds (any building, structure, athletic playing field, playground, or land contained within the boundary of a school or district or BOCES facility), unless under an exception (e.g., IEP\/Section 504).<\/p>\n<p>Such devices include “internet-enabled devices” defined as: any smartphone, tablet, smartwatch or other device capable of connecting to the internet and enabling the user to access content on the internet, including social media applications, but do not include any such device supplied by the district for educational purposes. Other personal electronic devices includes devices which are capable of connecting to the internet, either directly or indirectly, and access content on the internet, fitness trackers, wired or wireless headphones and earbuds, e-readers, voice recorders, cameras and music devices.<\/p>\n<ul>\n<li>At the elementary level, students are discouraged from bringing devices to school. Any device that is brought to school must be silenced and kept in their assigned personal cubby.<\/li>\n<li>At the middle and high school level, student devices must be silenced and stored in their assigned student locker.<\/li>\n<li>Parents\/guardians may contact their children by calling their child’s assigned administrator’s office. Students may contact their parents\/guardians by requesting to use the nearest administrator’s office phone.<\/li>\n<li>The district is not responsible for lost, stolen, or damaged personal electronic devices brought to school.<\/li>\n<li>Enforcement of this policy is the responsibility of building administrative staff; however, all employees will participate in enforcement. Students will be reminded of this policy regularly and consistently, especially at the start of the school year and after returning from breaks.<\/li>\n<li>For students out of compliance with this policy, the adult who sees the device will confiscate it and the device will be held in the school office until the end of the school day.\n<ul>\n<li>The first time this happens, the student may retrieve the device, and the parent will be notified.<\/li>\n<li>For subsequent instances, the parent must retrieve the device.<\/li>\n<li>Further instances will result in the device being held in the school office daily for longer periods of time. The district will exercise reasonable care to maintain the security of devices that are held by the district but cannot guarantee the devices will be secure.<\/li>\n<li>For students with exceptions under this policy, the district will examine alternative ways to achieve the purpose of the exception, including different storage or access provisions<\/li>\n<\/ul>\n<\/li>\n<li>Reference BOE Policy 5695 for more information.<\/li>\n<\/ul>\n<h2>Teacher Qualifications<\/h2>\n<p>In accordance with the federal No Child Left Behind Act of 2001, parents and guardians have the right to request specific information about the professional qualifications of their children’s classroom teachers. As a parent\/guardian of a student in the Saratoga Springs City School District, you have the right to request the following information: <\/p>\n<ul>\n<li>if the teacher has met the New York State qualifications and licensing criteria for the grade levels and subject areas he or she teaches.<\/li>\n<li>whether the teacher is teaching under emergency or other provisional status through which the state qualification or licensing criteria have been waived.<\/li>\n<li>the teacher’s college major: whether the teacher has any advanced degrees and, if so, the subject of the degrees; and<\/li>\n<li>if your child is provided services by any instructional aides or similar paraprofessionals provide services to your child and, if they do, their qualifications.<\/li>\n<\/ul>\n<p>Requests for information about the qualifications of your child’s teacher(s) can be directed to the Building Principal. All requests will be honored in a timely manner. Thank you for your continued support and interest in your child&#8217;s education.<\/p>\n<h2>Transportation Guidelines<\/h2>\n<h3>Transportation Purpose and Objective<\/h3>\n<p>Pupil transportation is a necessary service and integral part of the total educational program. The major objectives of the pupil transportation program are to provide safe transportation, operate an efficient and economical transportation system, adapt transportation to the requirements of the instructional program, and maintain conditions on the buses which are conducive to the best interests of students.<\/p>\n<p><strong>Philosophy<\/strong><\/p>\n<p>The school bus is considered an extension of the school; therefore, the safety and welfare of all pupils riding school buses is a major responsibility of the school district. Bus discipline, in order to be effective, must be a cooperative effort involving the transportation department, administrators, parents\/guardians and pupils.<\/p>\n<p><strong>Roles and Responsibilities:<\/strong><\/p>\n<ol>\n<li>Transportation personnel will receive orientation on a regularly scheduled basis regarding general discipline, pupil behavior, pupil rights, bus rules and disciplinary procedures.<\/li>\n<li>Bus drivers, teachers and administrators will be responsible for orienting pupils on a regularly scheduled basis regarding bus behavior.<\/li>\n<li>Pupils will be under the authority and supervision of the bus driver while on the bus and will always be expected to adhere to directions.<\/li>\n<li>Bus expectations will be published and distributed to parents\/guardians, pupils, and bus drivers, and they will be posted on every bus.<\/li>\n<li>Pupils who are disorderly and insubordinate will be subject to disciplinary actions.<\/li>\n<li>Disciplinary action for misbehavior will be the responsibility of building administrators in collaboration with the Director of Transportation (or their designee).<\/li>\n<li>Disciplinary action will be reasonable and administered in a progressive manner with pupil’s rights to due process guaranteed.<\/li>\n<li>The principal or the Director of Transportation (or their designee) will be responsible for notifying parents\/guardians of disciplinary action resulting from bus referrals in order to obtain their support and cooperation.<\/li>\n<\/ol>\n<h3>Unauthorized Entry on School Buses<\/h3>\n<p>For safety and security reasons, unauthorized persons are not allowed to board or ride a school bus at any time, unless prior approval has been received from the transportation department. This includes parents\/guardians, daycare providers, siblings, and underage children.<\/p>\n<h3>Student RFID (Radio-frequency identification) Cards<\/h3>\n<p>Students are issued RFID Cards that are used for attendance and accountability purposes on school buses. When the student boards and leaves the school bus, they are required to scan their card on the card reader in the bus. This will verify that the student has boarded or left the school bus, as well as display on the driver’s Mobile Data Terminal and at the transportation dispatch office.<\/p>\n<p>The following pertains to the use of the RFID Cards:<\/p>\n<ol>\n<li>Students are required to use their RFID Card when boarding and leaving the bus each day. The bus driver will remind students of this requirement if they fail to use their card.<\/li>\n<li>If a student repetitively fails to scan their card when entering\/exiting the bus, or consistently loses their card, drivers may submit written discipline referrals.<\/li>\n<li>If a student has not received an RFID Card, they should let their building principal know immediately so they order one for the student.  All initial cards are free of charge.  For lost or missing RFID cards, parents and\/or <strong>students will need to order a replacement card on the districts website by going “Family Links &amp; Resources” and then scrolling down to “Student ID Replacement”. <\/strong><\/li>\n<\/ol>\n<h3>Reporting School Bus Incidents\/Concerns:<\/h3>\n<ol>\n<li>If the incident\/concern specifically relates to the bus driver or bus driver assistant, please call the Transportation Department at 518-587-4545 option 0 (inform receptionist) as they will complete an intake form at the initial phone call.<\/li>\n<li>If the incident\/concern is student discipline related and on the school bus:\n<ol style=\"list-style-type: lower-alpha;\">\n<li>The first step is to inform the driver, who will take the appropriate steps to address the concern.<\/li>\n<li>If this does not resolve the problem, inform your building administrator.<\/li>\n<\/ol>\n<\/li>\n<li>If the concern involves bus routing or bus stops, please email the Transportation Routing Office at <a href=\"mailto:routing@saratogaschools.org\">routing@saratogaschools.org<\/a><\/li>\n<li>Any other bus concerns may be directed to the Bus Dispatch Office at 518-587-4545. option 1.<\/li>\n<\/ol>\n<h3>Bus Behavior Expectations<\/h3>\n<p>Students should always conduct themselves in a manner consistent with established standards for classroom behavior in accordance with the Code of Conduct.<\/p>\n<p>Inappropriate student behavior can cause the driver to become distracted, which can increase the chances of the bus being involved in an accident.<\/p>\n<p>The following “<em><strong>Bus Behavior Expectations<\/strong><\/em>” are posted in each school bus:<\/p>\n<ul>\n<li>Be Safe, Be Respectful, Be Responsible<\/li>\n<li>Follow driver instructions the first time<\/li>\n<li>Always remain seated in your assigned seat<\/li>\n<li>Keep aisle, windows &amp; emergency exits clear<\/li>\n<li>Always use an inside voice. (Level 1-2)<\/li>\n<li>Keep body parts\/objects to yourself<\/li>\n<li>Always treat others with respect<\/li>\n<li>No tobacco products, vaping or illegal substances<\/li>\n<li>No eating\/drinking &amp; keep your bus clean<\/li>\n<li>No hazardous items or fragrances allowed<\/li>\n<li>No profanity or rude behavior<\/li>\n<li>No photos, videos or laser pointers allowed<\/li>\n<li>Headphones must always be used<\/li>\n<\/ul>\n<p>Violations of the rules above may result in the following consequences:<\/p>\n<ul>\n<li>Warning<\/li>\n<li>Assigned seat<\/li>\n<li>Parent phone call<\/li>\n<li>Discipline Referrals<\/li>\n<li>Bus Suspension<\/li>\n<li>Restitution for damages to the school bus or cost of replacement of RFID Cards.<\/li>\n<\/ul>\n<p>Parents\/guardians may request a transportation conference if a bus suspension is assigned. Transportation conferences may also be utilized for students accumulating 10 bus referrals and 20 days of bus suspension during a school year.<\/p>\n<h3>PM Drop-Off Procedure for Kindergarten Students<\/h3>\n<p>School district regulations require that a parent\/guardian or another responsible person be available at the bus stop in the afternoon to meet kindergarteners and Head Start students. Due to safety concerns, these children will not be dropped off unless a designated person is available. Parents\/guardians will be contacted to pick up the child. Responsible individuals include:<\/p>\n<ol>\n<li>Parents or guardians<\/li>\n<li>Older siblings<\/li>\n<li>Other designated persons with prior written approval from parent or guardian<\/li>\n<\/ol>\n<h3>Transportation Changes<\/h3>\n<p>Student transportation is scheduled to and from the student&#8217;s primary residence. If transportation is needed to a different location on a regular basis for daycare or joint custody purposes, the parent\/guardian must complete a Transportation Change Form.<\/p>\n<ol>\n<li>Transportation Change Forms must be renewed on a yearly basis by June 1 <sup>St<\/sup> for the following school year. Forms received after August 15<em><sup>th<\/sup><\/em> will not be processed until after the first week of school. For changes during the school year, submit forms as soon as possible.<\/li>\n<li>Only students in grades K – 8 are eligible for transportation changes for daycare purposes.<\/li>\n<li>Transportation is available to accredited daycare centers within the school district boundaries. If your elementary school children will be attending private or home-based daycare, that location must be within the boundaries of the elementary school in which they attend.<\/li>\n<li>Requests will be approved on an annual basis if seating is available on established bus routes. Additional buses will not be added to accommodate transportation change requests.<\/li>\n<li>Students are not allowed to ride a different bus for social functions, jobs (including babysitting), scouting, religious activities or any other non-approved activity as determined by the building principal.<\/li>\n<li>Students who are not eligible for transportation are not permitted to ride home with a friend for an afterschool activity.<\/li>\n<li>In the event of an emergency and your child needs to ride a different bus or get off at a different stop on the same bus, please send a note to the school with your child. The note must then be approved by the school office. If an emergency occurs during the day, please contact your child’s school office as soon as possible to arrange for alternate transportation.<\/li>\n<li>Transportation Change Requests: Parent\/guardian completes and submits the electronic “Transportation Change Request” form on the school district website. Assistance with this process can also be found at the Transportation Department, the Registrar’s office or each of the district’s six elementary school offices.  Upon receiving an approval\/denial from the transportation department, the transportation department notifies the parent\/guardian of the decision. Elementary Schools are also notified by the transportation department and are provided updated bus schedule information. Requests received after August 15<sup>th<\/sup> may not be honored until after school begins.<\/li>\n<\/ol>\n<h3>Bus Schedule Information<\/h3>\n<p>The My Ride K-12 mobile app and website provides secure access to “real time” student transportation information, student ID card scans, current bus location and estimated arrival time at the bus stop. Instructions to access My Ride K-12 can be found on the Transportation Webpage on the district website.<\/p>\n<p>Students should be at their bus stop <em>5 <\/em>minutes before the bus is scheduled to arrive in the morning.<\/p>\n<p>If you have bus routing questions, please email the routing office at routing@saratogaschools.org.<\/p>\n<h3>Assigned Seating on School Buses<\/h3>\n<p>The school district reserves the right to assign student seating on school buses for safety, efficiency, and disciplinary reasons. In addition, assigned seating is required on all elementary buses and may be assigned on middle and high school buses if needed for behavioral issues. Drivers should have assigned seats in place by early October after considering grade level, compatibility, behaviors, siblings, friends etc. Assigned seats are also subject to change at any time during the school year.<\/p>\n<h3>Dangerous Substances<\/h3>\n<p>D.O.T. regulations prohibit aerosol cans, glass containers and flammable substances inside the passenger compartment of school buses. Therefore, students shall not carry these items on school buses at any time. Perfumes and colognes shall not be discharged on school buses because they can cause an adverse allergic reaction with some individuals.<\/p>\n<h3>Food and Beverages on School Buses<\/h3>\n<p>New York State Education Department regulations prohibit eating or drinking on the bus. The reason for this regulation is due to the danger of a child choking when eating on a school bus and due to students, who have food allergies. So, please remember, no eating or drinking on the bus at any time.<\/p>\n<h3>Transporting Large Items on School Buses<\/h3>\n<p>For the safety of all occupants being transported on district school buses, the following guidelines have been established to provide information on the size of items that students may transport on school buses.<\/p>\n<ol>\n<li>Objects smaller than 36 inches (length) by 12 inches (width) by 8 inches (depth) can be transported on school buses. These items must be kept on the student&#8217;s lap or on the floor between their legs. They must not obstruct the center aisle of the bus or be placed in a seat alongside a student, especially if another student needs to sit there.<\/li>\n<li>Objects that can obstruct or impair the vision of the driver are prohibited.<\/li>\n<li>Hockey and lacrosse sticks can be transported on the bus but must be stored behind the driver&#8217;s seat.<\/li>\n<li>Any items that are larger than the sizes listed above must be transported by other means, or arrangements may be made to store the items in the school. This includes large athletic equipment bags, skis, ski poles, sleds, skateboards, bicycles and fishing poles.<\/li>\n<\/ol>\n<p>This policy is designed to provide the safest environment for all occupants riding on our school buses. If you have questions regarding this policy, please contact the Transportation Department at (518) 587-4545.<\/p>\n<h3>Use of Personal Electronic Devices on School Buses<\/h3>\n<p>Improper use of electronics on the school bus can cause a distraction to the driver and may be detrimental to the safety and well-being of other students and bus drivers. Therefore, the following guidelines are provided in accordance with the district&#8217;s Code of Conduct policy.<\/p>\n<ol>\n<li>Cell phones and other electronic communication devices shall not be used to bully, discriminate, threaten, harass, or denigrate other students or school personnel.<\/li>\n<li>Devices may not be used while boarding\/discharging or crossing, and during emergency situations or school bus safety drills unless authorized by the driver.<\/li>\n<li>Video\/audio recordings and pictures are not allowed to be taken by students riding District buses.<\/li>\n<li>Laser pointers and other objects that can obstruct or impair the vision of the driver are not allowed to be used on school buses at any time.<\/li>\n<li>iPods, tablets, or other similar electronic devices may be used on school buses only if equipped with headphones and the volume is maintained at a level that does not disrupt the driver or other students.<\/li>\n<li>Headphones must be used when listening to music, playing games or viewing content on devices. For student safety reasons headphones must be removed when entering\/exiting the bus or crossing at bus stops.<\/li>\n<li>Any devices that are being used inappropriately may be confiscated by bus drivers and returned to the students when they depart the bus. If a student continues to use their device inappropriately, a discipline referral may be submitted, and the device may be confiscated and returned only to a parent\/guardian.<\/li>\n<li>The school District will not be held responsible for the loss or theft of any personal electronic device.<\/li>\n<\/ol>\n<p>Failure to follow these and any bus rules may result in disciplinary action in accordance with the Code of Conduct.<\/p>\n<h2>Visitors To The School<\/h2>\n<ul>\n<li><span style=\"font-size: 1rem;\">No students will leave school unless they are signed-out in the office as per school procedures.<\/span><\/li>\n<li>Teachers are not expected to discuss individual matters with visitors during class time\/activities.<\/li>\n<li>Any visitor must get administrative permission to meet with a student during the school day or at school sponsored events.<\/li>\n<li>Visitors attending school functions outside the school day that are open to the public, such as HSA, PTA, PTSO meetings or public gatherings, are not required to sign-in at the Main Office.<\/li>\n<li>Unauthorized persons may be asked to leave, and police may be called if the situation warrants.<\/li>\n<li>Visitors are expected to sign-in at the Main Office upon arriving at the school, and to sign-out when leaving.<\/li>\n<li>Parents\/guardians are not permitted to walk their child to the classroom unless pre-approved permission has been given by the principal and teacher.<\/li>\n<\/ul>\n<h2>Volunteers<\/h2>\n<p>The Board of Education of the Saratoga Springs City School District recognizes that community involvement is an important component of the District’s mission, and essential to the success of its academic and extracurricular programs. In an effort to bring community resources into our schools, while ensuring the welfare and safety of all students, faculty, staff and community members, the District has adopted policy 821.2 with regard to the volunteerism of parents\/guardians and other community members, for the following purposes<\/p>\n<ul>\n<li>To encourage community volunteerism in a manner that will increase the resources available to the District’s students.<\/li>\n<li>To expand community understanding of the District’s goals and programs. <\/li>\n<li>To establish a framework which allows the work of volunteers to be tracked, monitored and\/or appropriately supervised within the District.<\/li>\n<\/ul>\n<p>Visitors who are volunteers must have completed an approved application form on file.  <a href=\"https:\/\/forms.office.com\/r\/Km3DKEgEbX\" rel=\"nofollow noreferrer\" title=\"Lake Avenue volunteer form\">If you would like to volunteer, please fill out the elementary school volunteer form<\/a><span>. <\/span>For further information about volunteering at the Saratoga Springs City School District please refer to the complete Board of Education policy 821.2. Please contact the main office of the building for the volunteer handbook and further information.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>2025-2026 Elementary Student Handbook Agenda Books Agendas are utilized in many classrooms throughout the district. The agenda serves as an excellent resource for students organizationally, and for parents\/guardians to monitor their child’s progress and assignments in the classroom. The agendas can also serve as an effective communication tool between parents\/guardians and teachers. Your classroom teacher &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Elementary Student Handbook&#8221;<\/span><\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":359,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-894","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v25.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\r\n<title>Elementary Student Handbook - Saratoga City School District<\/title>\r\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\r\n<link rel=\"canonical\" href=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\" \/>\r\n<meta property=\"og:locale\" content=\"en_US\" \/>\r\n<meta property=\"og:type\" content=\"article\" \/>\r\n<meta property=\"og:title\" content=\"Elementary Student Handbook - Saratoga City School District\" \/>\r\n<meta property=\"og:description\" content=\"2025-2026 Elementary Student Handbook Agenda Books Agendas are utilized in many classrooms throughout the district. The agenda serves as an excellent resource for students organizationally, and for parents\/guardians to monitor their child’s progress and assignments in the classroom. The agendas can also serve as an effective communication tool between parents\/guardians and teachers. Your classroom teacher &hellip; Continue reading &quot;Elementary Student Handbook&quot;\" \/>\r\n<meta property=\"og:url\" content=\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\" \/>\r\n<meta property=\"og:site_name\" content=\"Saratoga City School District\" \/>\r\n<meta property=\"article:modified_time\" content=\"2025-08-19T17:01:04+00:00\" \/>\r\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\r\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"66 minutes\" \/>\r\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\",\"url\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\",\"name\":\"Elementary Student Handbook - Saratoga City School District\",\"isPartOf\":{\"@id\":\"https:\/\/www.saratogaschools.org\/#website\"},\"datePublished\":\"2022-02-10T14:22:40+00:00\",\"dateModified\":\"2025-08-19T17:01:04+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.saratogaschools.org\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"About Us\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Policies and Procedures\",\"item\":\"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Elementary Student Handbook\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.saratogaschools.org\/#website\",\"url\":\"https:\/\/www.saratogaschools.org\/\",\"name\":\"Saratoga City School District\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.saratogaschools.org\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"}]}<\/script>\r\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Elementary Student Handbook - Saratoga City School District","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/","og_locale":"en_US","og_type":"article","og_title":"Elementary Student Handbook - Saratoga City School District","og_description":"2025-2026 Elementary Student Handbook Agenda Books Agendas are utilized in many classrooms throughout the district. The agenda serves as an excellent resource for students organizationally, and for parents\/guardians to monitor their child’s progress and assignments in the classroom. The agendas can also serve as an effective communication tool between parents\/guardians and teachers. Your classroom teacher &hellip; Continue reading \"Elementary Student Handbook\"","og_url":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/","og_site_name":"Saratoga City School District","article_modified_time":"2025-08-19T17:01:04+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"66 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/","url":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/","name":"Elementary Student Handbook - Saratoga City School District","isPartOf":{"@id":"https:\/\/www.saratogaschools.org\/#website"},"datePublished":"2022-02-10T14:22:40+00:00","dateModified":"2025-08-19T17:01:04+00:00","breadcrumb":{"@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/elementary-student-handbook\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.saratogaschools.org\/"},{"@type":"ListItem","position":2,"name":"About Us","item":"https:\/\/www.saratogaschools.org\/about-us\/"},{"@type":"ListItem","position":3,"name":"Policies and Procedures","item":"https:\/\/www.saratogaschools.org\/about-us\/policies-and-procedures\/"},{"@type":"ListItem","position":4,"name":"Elementary Student Handbook"}]},{"@type":"WebSite","@id":"https:\/\/www.saratogaschools.org\/#website","url":"https:\/\/www.saratogaschools.org\/","name":"Saratoga City School District","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.saratogaschools.org\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"}]}},"jetpack_sharing_enabled":true,"publishpress_future_workflow_manual_trigger":{"enabledWorkflows":[]},"_links":{"self":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/894","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/comments?post=894"}],"version-history":[{"count":19,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/894\/revisions"}],"predecessor-version":[{"id":11054,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/894\/revisions\/11054"}],"up":[{"embeddable":true,"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/pages\/359"}],"wp:attachment":[{"href":"https:\/\/www.saratogaschools.org\/wp-json\/wp\/v2\/media?parent=894"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}